{"title":"lhasa 2009","uid":11589885,"size":358511684,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:00d0aff3d032afe2bcb7c4b1ccab6cf0c9fed98f&amp;dn=lhasa+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":null,"files":33,"time":1417219673,"description":"\nLhasa takes her time in crafting her music and this, her third album and first all-English-language effort, comes six years after her second opus, The Living Road. Since her debut album, La Llorona, included arrangements that drew on ranchera and Gypsy music, the singer was classified as a world music artist. The influences from other cultures are surely there, but Lhasa isn't that easy to pigeonhole. Alongside the world music you could hear the influences of American, Canadian, and Mexican folk; French chanson; and pop that was more worldly than world music. The Living Road followed the same template with the &quot;world&quot; influences less obvious, despite lyrics in French, Spanish, and English. The international flavor is even more subtle on Lhasa, without vanishing entirely. As should be obvious by now, Lhasa is a subtle artist; her impact slowly creeps up on you. The songs on the album all deal with love, usually of the obsessive, hopeless, and doomed variety, and even at her most seductive, as on the subtle rock/tango &quot;The Lonely Spider,&quot; her vocals hint at grief and despair. The song's Latin standup bassline and a subtle chiming rock guitar that's even quieter than the singer's voice combine with a muted tango beat to give the song a deeply melancholy air. &quot;Is Anything Wrong&quot; is a bluesy pop song with a haunting melody carried by Lhasa's melisma-drenched vocals. Pedal steel supplies a mournful accent and flamenco handclaps mixed down to the edge of audibility give the song a subtle drive as the singer contemplates the unknowable mysteries of love. &quot;What Kind of Heart&quot; has a vague Eastern European feel; &quot;A Fish on Land&quot; is a folk fable that sounds like ambient flamenco; and &quot;1001 Nights&quot; features Pop Staples-style twang-drenched electric gospel guitar and another languid, slightly anguished vocal. \n\nThere are two songs that are marginally louder. &quot;Rising&quot; is built on the familiar I-IV-V turnaround that was the basis of thousands of hits in the '50s. There's no chorus -- just a relentless repetition of the lead line played on classical harp and Lhasa's mournful vocal. Ghostly backing vocals and what sounds like toy piano play in the background to give the piece an eerie vibe. &quot;Fool's Gold,&quot; a country song with what sounds like a banjo that was recorded underwater, has a hint of pedal steel and some stirring country harmonies. The images of betrayal and infidelity make it a perfect country tune, and could strike gold with a slicker, more commercial arrangement. The albums closes with &quot;Anyone and Everyone&quot; a folk-like ballad with Dobro, bass, and occasional hits on a snare accompanying a meditation on fearlessness that nonetheless sounds desolate and hopeless. As on her previous albums, the subtle beauty of Lhasa's art unfolds slowly, taking you deeper into her vision with each listen. The tempos on Lhasa are measured and Lhasa herself never sings much above a whisper, but the power of her singing and the beauty of the songs are undeniable.\n\nReview by J. Poet, Allmusic.com\n\n\n01. Is Anything Wrong (03:55)\n02. Rising (03:48)\n03. Love Came Here (03:51)\n04. What Kind Of Heart (05:05)\n05. Bells (05:03)\n06. Fool's Gold (03:01)\n07. A Fish On Land (03:59)\n08. Where Do You Go (04:28)\n09. The Lonely Spider (03:17)\n10. 1001 Nights (03:52)\n11. I'm Going In (06:39)\n12. Anyone And Everyone (02:45)","torrent":{"xt":"urn:btih:00d0aff3d032afe2bcb7c4b1ccab6cf0c9fed98f","amp;dn":"lhasa+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00d0aff3d032afe2bcb7c4b1ccab6cf0c9fed98f","infoHashBuffer":{"type":"Buffer","data":[0,208,175,243,208,50,175,226,188,183,196,177,204,171,108,240,201,254,217,143]},"announce":[],"urlList":[]}}