{"title":"Wayne Shorter - Juju (1964) 2013 HDtracks 24-192-FLAC","uid":11350246,"size":1640940255,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0288404da19af46f288ecc2296da9ecc9f25ddb1&amp;dn=Wayne+Shorter+-+Juju+%281964%29+2013+HDtracks+24-192-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"hal4000","files":-1,"time":1414892857,"description":"Wayne Shorter (born August 25, 1933) is an American jazz saxophonist and composer.\nJazz critic Ben Ratliff of the New York Times has described Shorter as &quot;probably jazz's greatest living small-group composer and a contender for greatest living improviser.&quot; Many of Shorter's compositions have become jazz standards. His output has earned worldwide recognition, critical praise and various commendations, including 10 Grammy Awards. He has also received acclaim for his mastery of the soprano saxophone (after switching his focus from the tenor in the late 1960s), beginning an extended reign in 1970 as Down Beat's annual poll-winner on that instrument, winning the critics' poll for 10 consecutive years and the readers' for 18.\nShorter first came to wide prominence in the late 1950s as a member of, and eventually primary composer for, Art Blakey's Jazz Messengers. In the 1960s, he went on to join Miles Davis's Second Great Quintet, and from there he co-founded the jazz fusion band Weather Report. He has recorded over 20 albums as a bandleader.\n\nFulfilling the potential promised on his Blue Note debut, Night Dreamer, Wayne Shorter's JuJu was the first great showcase for both his performance and compositional gifts. Early in his career as a leader, Shorter was criticized as a mere acolyte of John Coltrane, and his use of Coltrane's rhythm section on his first two Blue Note albums only bolstered that criticism. The truth is, though, that Elvin Jones, Reggie Workman, and McCoy Tyner were the perfect musicians to back Shorter. Jones' playing at the time was almost otherworldly. He seemed to channel the music through him when improvising and emit the perfect structure to hold it together. Workman too seemed to almost instinctively understand how to embellish Shorter's compositions. McCoy Tyner's role as one of the greatest jazz pianists of all time was played here as well, and his light touch and beautiful, joyful improvisations would make him a much better match for Shorter than Herbie Hancock would later prove to be. What really shines on JuJu is the songwriting. From the African-influenced title track (with its short, hypnotic, repetitive phrases) to the mesmerizing interplay between Tyner and Shorter on &quot;Mahjong,&quot; the album (which is all originals) blooms with ideas, pulling in a world of influences and releasing them again as a series of stunning, complete visions.\n\nFor the liner notes, change the pdfX extension into pdf.\n\nHDtracks PCM-24Bit-192Khz-FLAC","torrent":{"xt":"urn:btih:0288404da19af46f288ecc2296da9ecc9f25ddb1","amp;dn":"Wayne+Shorter+-+Juju+%281964%29+2013+HDtracks+24-192-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0288404da19af46f288ecc2296da9ecc9f25ddb1","infoHashBuffer":{"type":"Buffer","data":[2,136,64,77,161,154,244,111,40,142,204,34,150,218,158,204,159,37,221,177]},"announce":[],"urlList":[]}}