{"title":"Bloody Mary Horror Story","uid":11563411,"size":1409024,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:05650b7ce28efa60b8dfd8054bcf374abdd60c36&amp;dn=Bloody+Mary+Horror+Story&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ppull-mmomry","files":1,"time":1416922752,"description":" &lt;a href=&quot;http://bayimg.com/bAgEmAAGK&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/bAgEmAAGK&lt;/a&gt;\n\nSome of my friends, five of us, cramped ourselves into a small bathroom in my friend Cathryn's House. We ended up saying Bloody Mary (more like chanting it) about 20 times or so for anything to appear. When we did finally see something it started out as a green glow then the darkened portrait of a face became more visible, by that time half of us were screaming so we knocked each other down trying to get out of the bathroom and then I flipped on the light. It was a welcome relief.\n\nSome girls Kat didn't know invited her over for a sleepover. That night they played Truth or Dare. When it was Kat's turn she picked dare. One of the girls said, &quot;I dare you to do Bloody Mary.&quot; Kat accepted. They gave Kat a lit candle and pushed her into the bathroom. Kat spun around three times and said, &quot;Bloody Mary, Bloody Mary, Bloody Mary.&quot;\n\n\nWhen nothing happened, she walked to the door. Before she could reach it, her only light blew out. She banged on the door, begging the girls to open it, but they just laughed. She backed up against the door. The sink and the bath started to run. It poured out thick blood. It soon was overflowing onto the floor. Kat screamed a blood-curdling scream as Bloody Mary rose from the water then crawled out. When she reached Kat she slit her throat and dragged her back to the bath. The next morning, the girls cheeked on her. When they saw her, their screams could be heard for miles.\n\nWhen I was about 9 years old, I went to a friend's for a birthday/slumber party. There were about 10 other girls there. About midnight, we decided to play Mary Worth. Some of us had never heard of this so one of the girls told the story.\n\nMary Worth lived a long time ago. She was a very beautiful young girl. One day she had a terrible accident that left her face so disfigured that nobody would look at her. She had not been allowed to see her own reflection after this accident for fear that she would lose her mind. Before this, she had spent long hours admiring her beauty in her bedroom mirror.\n\nOne night, after everyone had gone to bed, unable to fight the curiosity any longer, she crept into a room that had a mirror. As soon as she saw her face, she broke down into terrible screams and sobs. It was at this moment that she was so heartbroken and wanted her old reflection back, that she walked into the mirror to find it, vowing to disfigure anybody that came looking for her in the mirror.\n\nAfter hearing this story, which was told very scarily, we decided to turn out all of the lights and try it. We all huddled around the mirror and starting repeating &quot;Mary Worth, Mary Worth, I believe in Mary Worth.&quot;\n\nAbout the seventh time we said it one of the girls that was in front of the mirror started screaming and trying to push her way back away from the mirror. She was screaming so loud that my friends mom came running into the room. She quickly turned on the lights and found this girl huddled in the corner screaming. She turned her around to see what the problem and saw these long fingernail scratches running down her right cheek. I will never forget her face as long as I live!!","torrent":{"xt":"urn:btih:05650b7ce28efa60b8dfd8054bcf374abdd60c36","amp;dn":"Bloody+Mary+Horror+Story","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05650b7ce28efa60b8dfd8054bcf374abdd60c36","infoHashBuffer":{"type":"Buffer","data":[5,101,11,124,226,142,250,96,184,223,216,5,75,207,55,74,189,214,12,54]},"announce":[],"urlList":[]}}