{"title":"A Simples Life by Aleksandr Orlov {dwg}","uid":11254343,"size":24622348,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0605c3d8ed6f648cd2e7879734e515d3b3528197&amp;dn=A+Simples+Life+by+Aleksandr+Orlov+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"gratefuldawg77","files":6,"time":1413876964,"description":"Aleksandr Orlov has in the last year become one of the most loved figures in British culture and his catchphrase - Simples! - can be heard from the playground to the office. Written in his inimitable voice (as dictated to his sidekick Sergei), his autobiography will offer the same humour as his TV ads, giving us the full story of his ancestor's Journey of Courageousness from the Kalahari to Russia, the low-down on his life as entrepreneur and founder of comparethemeerkat.com and his love of grubs and cravats.\n\n'My name is Aleksandr Orlov. I live and make work in Moscow. I have a success business. I have a mansion decorate with many fine things. I have a naturally majestic posture. But I would have none of these things if it were not for my family. This book is dedicated to them. I also wish to inspire next generation of young businesskats. I am hope that this book will show what can come of courage, hard work and a good fur-care regime. I am also hope that with royalties I will be able to re-marble roof on Orlov family mansion","torrent":{"xt":"urn:btih:0605c3d8ed6f648cd2e7879734e515d3b3528197","amp;dn":"A+Simples+Life+by+Aleksandr+Orlov+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0605c3d8ed6f648cd2e7879734e515d3b3528197","infoHashBuffer":{"type":"Buffer","data":[6,5,195,216,237,111,100,140,210,231,135,151,52,229,21,211,179,82,129,151]},"announce":[],"urlList":[]}}