{"title":"Casablanca - The Classic Film Scores for Humphrey Bogart","uid":11498806,"size":274264010,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0952d094d8a07031564751e5dff1667771da7865&amp;dn=Casablanca+-+The+Classic+Film+Scores+for+Humphrey+Bogart&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"metro369","files":13,"time":1416317434,"description":"It could be argued that, even for the golden age of Hollywood, when movie stars tended to be typecast and to have star vehicles designed for their established images, collecting music composed for films featuring a particular performer is a sort of &quot;apples as chosen by oranges&quot; sort of idea, an arbitrary assemblage of excerpts from different sorts of pictures. What do the scores for 12 different films that happen to have starred Humphrey Bogart have to do with each other? As it turns out in this collection of re-recordings of such music performed by the National Philharmonic Orchestra conducted by Charles Gerhardt, one thing seven out of 12 share is the composer Max Steiner. This makes the album something of a companion to two other discs in Gerhardt's Classic Film Scores series, Now Voyager: The Classic Film Scores of Max Steiner and a treatment of Gone with the Wind. Steiner is a highly functional Hollywood composer, not at all above the practice known as &quot;mickeymousing,&quot; i.e., providing very specific accompaniment to actions seen on the screen. And, highly prolific, he doesn't mind borrowing familiar sounds to create effects. These tendencies he demonstrates amply in the lengthiest track here, a suite drawn from Casablanca, which makes extensive use of &quot;La Marseilles&quot; (to be fair, the French national anthem has a large part in an important scene in the film, but that isn't the only time Steiner employs it); he also includes &quot;As Time Goes By&quot; so often that the track really should be co-credited to the songwriter Herman Hupfeld. Meanwhile, another suite of cues from The Treasure of the Sierra Madre illustrates Steiner's tendency to score every varying mood in the film, from foreboding to playful. His march from The Caine Mutiny, on the other hand, is so heroic it gives no sense of the film's dark theme. At least when the album sticks with Steiner, there's a consistency; when it moves on to other composers, it only ends up demonstrating that the career of almost any major star, even one with as specific a persona as Bogart's, can have many different sides. Frederick Hollander's waltzing main title from Sabrina, for instance, is much more light-hearted than what one normally expects from a Bogie movie. Thus, while there is some good and interesting film scoring on this album, handled with the usual efficiency by the National Philharmonic, the collection also has a miscellaneous feel to it","torrent":{"xt":"urn:btih:0952d094d8a07031564751e5dff1667771da7865","amp;dn":"Casablanca+-+The+Classic+Film+Scores+for+Humphrey+Bogart","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0952d094d8a07031564751e5dff1667771da7865","infoHashBuffer":{"type":"Buffer","data":[9,82,208,148,216,160,112,49,86,71,81,229,223,241,102,119,113,218,120,101]},"announce":[],"urlList":[]}}