{"title":"ExxxtraSmall - Sophia Torres (But Youre His Sister) NEW 20 Novem","uid":11531814,"size":590958775,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:0bd6c42720e217a36be3837d720a4d3afa0e7457&amp;dn=ExxxtraSmall+-+Sophia+Torres+%28But+Youre+His+Sister%29+NEW+20+Novem&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1416579022,"description":"Sophias boyfriend has cheated on her for the last time! She had just finished breaking up with him when her brothers friend, Chad, came by looking for his phone - and Sophia got a brilliant idea! Since shes newly single, and Chad happens to be here, why not have some fun? She tempted him with an offer of movies and weed smoking and that was enough to get him to stay. Were sure that as soon as she started rubbing on his boner through his jeans he wasnt going anywhere! Tiny Sophia took that huge dick into her petite mouth and made Chad go nuts! Once the dick went in it didnt matter whos sister she was anymore - Sophia was about to get fucked stupid just like she wanted! Watching her bulbous ass bounce up and down is mesmerizing. I the end, Chad put vertically challenged Sophia in that white tiger position and sprayed his load all over her mouth and face. He even got some on the carpet - better clean that up before you go!\nTags:\n18, 18 Year, Adorable, Babe, Big Ass, Big Dicks, BJ, Blowjob, Booty, Brunette, Bubble Butt, Butt, Camel Toe, Casual, Clothed Sex, Completely Naked, Couch, Cowgirl, Crazy, Cute, Deepthroat, Doggystyle, Dominance, Easy, Facial, Fingering, Fishnet, Fondling, Girl Next Door, Hardcore, Hispanic, Home, Indoor, Latin, Latina, Living Room, Long Hair, Missionary, Money Shot, Natural Tits, No Condom, Nympho, Petite, Pornstar, Pussy Lick, Rough Sex, Sexy, Shaved Pussy, Short, Skinny, Slim, Slutty, Spanish, Straight, Tan, Tanlines, Teen, Thong, Tiny, Toned, Wild,\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=45464722817645453852.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=45464722817645453852.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=84730324414042020224.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=84730324414042020224.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:0bd6c42720e217a36be3837d720a4d3afa0e7457","amp;dn":"ExxxtraSmall+-+Sophia+Torres+%28But+Youre+His+Sister%29+NEW+20+Novem","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bd6c42720e217a36be3837d720a4d3afa0e7457","infoHashBuffer":{"type":"Buffer","data":[11,214,196,39,32,226,23,163,107,227,131,125,114,10,77,58,250,14,116,87]},"announce":[],"urlList":[]}}