{"title":"High.Definition.Music.Videos.1","uid":11643461,"size":54782377691,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1845e40660fd912927872107e5b1cee22f829b42&amp;dn=High.Definition.Music.Videos.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"user101966","files":212,"time":1417791458,"description":"This &quot;latest&quot; high definition videos release includes almost all of the ones in the previous release and many additions. One thing I discovered during the course of investigating YouTube's so-called &quot;High Definition&quot; content is that it's never really high definition at all. In fact, the audio sampling rates for YouTube videos are always 44.1 KHz (or less) and the data rate (for audio) rarely exceeds about 192 kbps. The highest quality audio stream available from YouTube is paired up with their 720p videos and no others. So that means that if you watch a video at 1080p on YouTube the audio quality is correspondingly diminished. I presume this is a trick they use to save on bandwidth costs since most people seem to be &quot;wowed&quot; by YouTube's 1080p setting. Well, it also turns out that YouTube's 1080p videos are typically given a video data rate of about 2000 kbps which is well below the norm for 1080p content. In fact it's about one fifth (â…•) of the norm for HD ~10,000 kbps video.\n\nSo there's never any &quot;high definition&quot; video on YouTube. But you can come closer to HD if you download the audio for the 720p version, convert that to AC3 at 224 kbps and 48.000 KHz and then recompress the 1080p video to where it belongs (just barely) which is 720p keeping the 1080p data rate of about 2 kbps. Putting the two together results in a 720p video which is is as close to &quot;high definition&quot; (both audio and video) as you can squeeze out of YouTube. And I have done that on many occasions in this collection adding to my 720p set which is now becoming quite large.\n\nIn several cases I converted entire concerts to 720p &quot;Highest YouTube Definition&quot; (YTHD) videos and separated those from &quot;singles&quot; (single songs). So there is overlap for those videos which I clipped out of their corresponding full length videos. I wasn't going to include the full concerts at all (who has the time to watch them?), but I figure it can't hurt.\n\nI have also significantly augmented the &quot;classical&quot; (now called &quot;Classical, Bollywood&quot; under 720p) section with performances by Glenn Gould and Vladimir Horowitz, two of the finest classical pianists ever to have graced the 20áµ—Ê° century. &quot;BBC Proms&quot; concerts (full length shows from 2012) were also added, initially, under Beethoven (5áµ—Ê°, 6áµ—Ê° and 9áµ—Ê° symphonies with the 6áµ—Ê° being placed out of order for obvious reasons). \n\nI said &quot;initially&quot; because I wasn't sure whether the &quot;BBC Proms&quot; symphonic works fell better under &quot;Bollywood&quot; or &quot;Beethoven&quot; and finally deciding on &quot;Bollywood&quot; (that's &quot;British Hollywood&quot;) due to the over-indulgent and excessive &quot;razzmatazz&quot; prior-to and following these events.\n\n--------------- Addendum -----------------\n\nNo musician deserves to be insulted:\n------------------------------------\nI should point out, in the classical section I have included on two occasions, works either identical or similar but performed by a professional musician (Vladimir Horowitz [actually about 2 years before he died]) and a relative amateur, namely Valentina Lisitsa. This is not meant to insult Ms. Lisitsa but to demonstrate, by example, what it means to be a professional musician as opposed to a (very promising) highly skilled but not yet fully accomplished one.\n\nPolitics:\n---------\nNote: Any political statements made by implication in file names are solely my own personal opinions and not necessarily backed up by facts and evidence. For instance, the &quot;First Aid Kit&quot; iTunes concert in 2014 I have labeled the &quot;iTunes Stockholders Meeting Concert&quot; or something along those lines. This was a concert held by iTunes for which tickets could not be purchased, but instead would be given to the &quot;lucky winners&quot; of a privately run lottery.\n\nI have no direct evidence that the winners of that lottery were actually iTunes Stockholders, except that through the use of similar naming on YouTube for clips taken from this event I was punished by iTunes directly. The punishment was specific to one of the 4 or 5 videos I had had on my YouTube channel(s) [they are all gone now of course]. \n\nIt turns out that this punishment followed almost immediately (within 24 hours) after I insulted the VEVO corporation, who are currently in a partnership with iTunes, on one of their randomly selected videos telling them to [QUOTE] &quot;get the hell out of here&quot; [/QUOTE] while at the same time lauding iTunes for &quot;preventing VEVO&quot; from acquiring the &quot;First Aid Kit&quot; content. You can see how iTunes would have no other choice but to &quot;slap me upside the face&quot; so to speak, in order to get rid of the comment which certainly does misrepresent iTunes position with respect to VEVO (and intentionally so). \n\nIt also demonstrates their lack of a sense of humour, in fact openly admitted in a comment, obviously by one of their employees (who else would care?), on one of the other videos with regards to its title. &quot;I didn't get the joke&quot; I believe was the response after I explained that the title was meant as a light hearted joke and not to be taken seriously. \n\nI felt and feel sorry for this person actually. The &quot;I didn't get the joke&quot; followed my response wherein I characterized the audience members as &quot;stiff as corpses&quot; and I imagine this person could easily have been one them.\n\nBut most likely I am over-exaggerating my importance in their eyes and it's all probably just coincidental. Just as the attempt (first I've ever seen), earlier today, directly from Time Warner's own servers (ie. with no intervening buffers) to access the contents of my hard drive might easily be misinterpreted in a similar way. \n\nActually (just re-checking the logs), there have been several attempts today both UPD and TCP and seemingly random as far as ports go. So there you go. Just business as usual.\n-------------------- end ----------------\n\n\n- user101966","torrent":{"xt":"urn:btih:1845e40660fd912927872107e5b1cee22f829b42","amp;dn":"High.Definition.Music.Videos.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1845e40660fd912927872107e5b1cee22f829b42","infoHashBuffer":{"type":"Buffer","data":[24,69,228,6,96,253,145,41,39,135,33,7,229,177,206,226,47,130,155,66]},"announce":[],"urlList":[]}}