{"title":"Aap Aye Bahaar Ayee  (1971) VCD - No Subs - Rajendra Kumar, Sadh","uid":11390924,"size":1399269725,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1c43b34f814828e5a548e90e6e9d366a8670c5ca&amp;dn=Aap+Aye+Bahaar+Ayee++%281971%29+VCD+-+No+Subs+-+Rajendra+Kumar%2C+Sadh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1415326104,"description":"Aap Aye Bahaar Ayee  (1971) VCD - No Subs - Rajendra Kumar, Sadhana [DDR]\n\nAap Aye Bahar Ayee is a 1971 Bollywood film produced, directed and written by Mohan Kumar. It stars Rajendra Kumar, Sadhana, Rajendranath and Prem Chopra. The film's music is by Laxmikant Pyarelal.\n\nCAST:- Rajendra Kumar, Sadhana, Prem Chopra, Rajendra Nath, Raj Mehra, Mumtaz Begum, Meena T, Kamaldeep, Madhu Apte\n\nProducer - Director: Mohan Kumar\nMusic Director: Laxmikant-Pyarelal\nLyricist: Anand Bakshi\nPlayback Singers:- Mohammed Rafi, Lata Mangeshkar, Kishore Kumar, Hemlata\t\n\nSongs are included in MP3s\nAap Aye Bahaar Ayee (1971) 00. Title Music and Screen Credits, Laxmikant - Pyarelal\nAap Aye Bahaar Ayee (1971) 01. Poochhe Jo Koi Mujhse, Rafi, Anand Bakshi, Laxmikant - Pyarelal\nAap Aye Bahaar Ayee (1971) 02. Aap Aaye Bahar Aayi, Rafi, A. Bakshi, Laxmikant-Pyarelal\nAap Aye Bahaar Ayee (1971) 03. Tum Ko Bhi To Aisa Hi Kuchh Hota Hoga, Kishore, Lata, A. Bakshi, Laxmikant-Pyarelal\nAap Aye Bahaar Ayee (1971) 04. Koyal Kyun Gaaye, Rafi, Lata, Anand Bakshi, Laxmikant - Pyarelal\nAap Aye Bahaar Ayee (1971) 05. Mujhe Teri Mohabbat Ka Sahara Mil Gaya Hota, Rafi, Lata, A.Bakshi, Laxmikant-Pyarelal\nAap Aye Bahaar Ayee (1971) 06. Taare Kitne Neel Gagan Pe Taare, Rafi, Hemlata, A. Bakshi, Laxmikant-Pyarelal\n\nSYNOPSIS:- Aap Aye Bahar Ayee (1971\nRohit, Whiskey, and Kumar (Rajendra Kumar, Rajendra Nath, and Prem Chopra respectively) are childhood friends. While travelling to his estate in the company of Whiskey, Rohit meets with beautiful Neena (Sadhana) and falls in love with her. Subsequently, he meets with her father (Raj Mehra) where they are properly introduced, and she too falls in love with him. Unknowingly, Kumar also sends his proposal for marriage to Neena, but she not only rejects it, but also makes it a laugh. Kumar is offended. He plans to take revenge and, shortly before the marriage of Neena and Rohit, just when the marriage is officially fixed, in the same night, Neena un-knowingly surrenders to Kumar, presuming that he is Rohit. After Neena gets molested, Rohit and Kumar become enemies, have a fight and Kumar loses sight in his left eye. Feeling that she is not worthy of Rohit anymore, Neena refuses to marry him.\n\nNeena discovers that she is pregnant with Kumar's child and tries to commit suicide. Rohit stops her from doing so and marries her in a nearby Shiv Mandir. Rohit brings up the child as his own son who is adored by all. Kumar, who is now a known criminal, comes to Rohit asking for money. While he and Rohit are having an argument, Rohit slips out the information that the child is not his. Kumar secretly records this information and blackmails him. One day he kidnaps Rohit's son; Rohit goes to his hideout to get his son back. During their fight, Rohit is badly injured, but then Neena comes and kills Kumar with one of with his own henchman's gun. Rohit, Neena and their son live happily ever after.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-1\nVideo Bitrate: 1150 kbps\nVideo Resolution: 352x288\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 25.000\nAudio Codec:  MPEG-1 Layer 2\nAudio Bitrate: 224kb/s CBR 44100 Hz\nAudio Streams: 2\nAudio Languages: Hindi\nRunTime: 2:08:57\nSubtitles: NONE\nRipped by: Trinidad [DDR]    \nDuration: 2:08:57","torrent":{"xt":"urn:btih:1c43b34f814828e5a548e90e6e9d366a8670c5ca","amp;dn":"Aap+Aye+Bahaar+Ayee++%281971%29+VCD+-+No+Subs+-+Rajendra+Kumar%2C+Sadh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c43b34f814828e5a548e90e6e9d366a8670c5ca","infoHashBuffer":{"type":"Buffer","data":[28,67,179,79,129,72,40,229,165,72,233,14,110,157,54,106,134,112,197,202]},"announce":[],"urlList":[]}}