{"title":"Coast.To.Coast.AM.11.11.14.Angels.In.Science.&amp;.Spirit.iSAAC","uid":11441716,"size":53759814,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1e1ae5ec7f15b41d0fc90f958c00813141116a34&amp;dn=Coast.To.Coast.AM.11.11.14.Angels.In.Science.%26amp%3B.Spirit.iSAAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Isaac09","files":-1,"time":1415815832,"description":"Angels in Science &amp; Spirit\n\n\nDate:\t11-11-14\nHost:\tGeorge Noory\nGuests:\tMatthew Fox, Rupert Sheldrake, Dannion Brinkley\n\nAudio\nFormat                                   : MPEG Audio\nFormat version                           : Version 1\nFormat profile                           : Layer 3\nDuration                                 : 2h 29mn\nBit rate mode                            : Constant\nBit rate                                 : 48.0 Kbps\nChannel(s)                               : 1 channel\nSampling rate                            : 44.1 KHz\nCompression mode                         : Lossy\nStream size                              : 50.9 MiB (100%)\n\n\nRadical theologian and Episcopalian priest Matthew Fox (hours 2, 3, &amp; 4) and maverick biologist Rupert Sheldrake (hours 3 &amp; 4) joined forces to explore the nature of angels. They addressed some of the spiritual, and literary references to angels, and detailed people's encounters with them. Angels are closely associated with intuition as well as creativity, and many artists and musicians experience them in the form of a muse, Fox noted. &quot;I know painters who say that spirits come through the canvas...telling them what to paint,&quot; he recounted.\n\nWhile some people get direct communication from angels, they can also show themselves through deeds and actions, Fox reported. If one is going through a crisis, you can ask for guidance through a dream, as angels will often speak to us via the dream state, he said. Angels are not just here for us as individuals but also to assist in our evolution, and how we relate to other beings, and types of consciousness, he continued. They may also have intuitions about our future, and people such as Lorna Byrne (who reportedly has the ability to see everyone's guardian angels) has been shown various visions of what may come.\n\nAngels may represent levels of consciousness that reside somewhere between humans and God, and relate as well to the animating principles of the stars and the cosmos, Sheldrake commented. In addition to directly assisting people, angels may work through nature to affect changes they consider beneficial to humanity, he added. Angels could be considered light beings, Fox remarked, connecting this concept to physics and photons (light waves found throughout the universe).\n\nVeterans Update\nFirst hour guest, author and hospice volunteer, Dannion Brinkley, talked about Veteran's Day, and soldiers' issues. Though the VA is plagued with difficulties, wounded vets have a stronger chance of survival than in years past, and some of their medical problems and treatments will help to change the face of health care in general, he indicated. He also spoke about his hospice work with The Twilight Brigade, helping vets deal with end-of-life situations.\n\nNews segment guests: Steve Kates, Jerome Corsi\n\n\nWebsite(s):\n\nmatthewfox.org\nsheldrake.org\ndannion.com\nthetwilightbrigade.com\n\n\nBook(s):\n\nThe Physics of Angels\nChristian Mystics\nThe Evolutionary Mind\nSecrets of the Light\nSaved by the Light","torrent":{"xt":"urn:btih:1e1ae5ec7f15b41d0fc90f958c00813141116a34","amp;dn":"Coast.To.Coast.AM.11.11.14.Angels.In.Science.%26amp%3B.Spirit.iSAAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e1ae5ec7f15b41d0fc90f958c00813141116a34","infoHashBuffer":{"type":"Buffer","data":[30,26,229,236,127,21,180,29,15,201,15,149,140,0,129,49,65,17,106,52]},"announce":[],"urlList":[]}}