{"title":"EPK-mka","uid":11149711,"size":213192044,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:1f535646b167f9b964158d190f5fb126a346a30c&amp;dn=EPK-mka&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"martinkandersonart","files":36,"time":1412317356,"description":"A selection of material created by myself including; dodgy old audio experiments, poems &amp; a badly written film idea; which is an absurd tale surrounding dreams and what have been described to me as out of body experiences. A further chapter or 2 will be added to the story at a later date (I've already set it up for a rather ridiculous ending), but the idea itself is laid out completely in the PDF. Bare in mind also, a large chunk of poems featured in this torrent were written when I was quite young, and the others during a volatile relationship. Still, I decided to breathe new life into them by recording them in audio format. Hopefully my work may be of some interest, and while I admit I am not technically great, I at least have the ability to get my ideas and points of view across. Some may like my work, some may loathe my work, either way, art is a subjective bitch. If you are interested I also have a facebook page where I will post future works, and random oddness. Trust me when I say my page isn't all about me, and hey I'm not asking for money;\n\n\nIn closing, I am by no means expecting big things. I just felt a need to share my odd concepts, and experiences through my work.","torrent":{"xt":"urn:btih:1f535646b167f9b964158d190f5fb126a346a30c","amp;dn":"EPK-mka","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f535646b167f9b964158d190f5fb126a346a30c","infoHashBuffer":{"type":"Buffer","data":[31,83,86,70,177,103,249,185,100,21,141,25,15,95,177,38,163,70,163,12]},"announce":[],"urlList":[]}}