{"title":"Star Wars: Pink Five Saga","uid":11262279,"size":636435562,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:20f21b872c648e2f7925b206b21409d205f19ac7&amp;dn=Star+Wars%3A+Pink+Five+Saga&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"74310","files":15,"time":1413983514,"description":"Star Wars: Pink Five Saga (Star Wars Spoof)\n\n\nThe Pink Five Saga trailer\t640x360\t\t0:01:55\n\n\nPink Five\t\t(2002),\t640x480,\t0:04:27\n\nPink Five is a Star Wars fan film that made its debut on the Internet in 2002 and was written and directed by Trey Stokes and stars Amy Earhart as Stacey (aka Pink Five), a fast-talking Valley Girl-type dropped into an X-Wing cockpit during the Battle of Yavin, and presents familiar events and story points from Episode IV from a very different point of view.\n\n\nPink Five Strikes Back\t(2004),\t640x480,\t0:09:44\n\nPink Five Strikes Back is a fan film that made its debut on the internet in 2004, created by fans of the Star Wars franchise. The sequel to the popular Pink Five, it is a comedy set in the Star Wars universe. Amy Earhart returns as Stacey (aka Pink Five), a fast-talking Valley Girl-type pilot.\n\nIn this installment, Stacey follows Luke Skywalker to Dagobah, and eventually ends up being trained by Yoda as well. As Pink Five did with Episode IV, the film presents familiar events, story points, and now characters from Episode V from a very different point of view.\n\n\nReturn of Pink Five \t(2006),\t640x480,\t0:26:22\n\nA sequel to the fan films Pink Five and Pink Five Strikes Back, Return of Pink Five continues the adventures of Stacey (Pink Five) around the edges of the original Star Wars trilogy. The film was directed by series creator Trey Stokes, who co-wrote the film with Chris Hanel (The Formula)","torrent":{"xt":"urn:btih:20f21b872c648e2f7925b206b21409d205f19ac7","amp;dn":"Star+Wars%3A+Pink+Five+Saga","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20f21b872c648e2f7925b206b21409d205f19ac7","infoHashBuffer":{"type":"Buffer","data":[32,242,27,135,44,100,142,47,121,37,178,6,178,20,9,210,5,241,154,199]},"announce":[],"urlList":[]}}