{"title":"Behemoth - Live Barbarossa (2014)","uid":11264905,"size":163863179,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2181f3ff653400f60aa309246fa06509e63dadfc&amp;dn=Behemoth+-+Live+Barbarossa+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"analogkid6103","files":15,"time":1414011016,"description":"\nConsidered to be one of the leading death metal bands to emerge from Poland in the 1990s, Behemoth have endured quite a few lineup shifts during their career (especially in the bass department), with founding singer/guitarist Nergal being the only constant member.\nBehemoth were formed during 1991 (originally as a trio), and began issuing several demos shortly thereafter, the most circulated one being 1993's From the Pagan Vastlands. The same year, Behemoth issued their debut release (via the Italian independent record label Entropy), And the Forests Dream Eternally. Two years later, the group released its first full-length recording, Sventevith, which received favorable reviews by the metal underground press. For 1996's Grom, Behemoth widened their musical vision by experimenting with acoustic guitars, synthesizers, and female vocalists, but all the while retained their brutal, extreme metal sound, leading to the group's inaugural full-on tour of Europe. Released in 1997, the three-track stopgap EP Bewitching the Pomerania proved to be the first recording to feature drummer Inferno, who would soon become a driving force (and permanent fixture) in Behemoth.\n\nTheir fifth release overall, Pandemonic Incantations, was issued a year later in 1998, as Behemoth continued to average at least one lineup change per release. Behemoth's last release as a trio (and first for new label Avantgarde), 1999's Satanica, continued to expand the group's following among the black metal masses, as Behemoth secured supporting slots on two separate tours with leading bands of the genre: Deicide and Satyricon. Behemoth's first release of the 21st century, 2000's Thelema.6, saw the group's lineup expand to four members for the first time, as newcomers Novy (bass) and Havoc (guitar) signed on with stalwarts Nergal and Inferno. The album proved to be the first of the group's career to receive worldwide distribution (issued in the U.S. a year after its initial release), and also featured Nergal collaborating lyrically with outsider Krzysztof Azarewicz. Behemoth embarked on their most substantial tour yet, playing shows alongside the likes of Morbid Angel and Nile, and even launched a few headlining tours on their own. In 2002, a home video/DVD was issued (recorded in their homeland of Poland), The Art of Rebellion: Live. Zos Kia Cultus followed a year later and was supported by a world tour including, for the first time, the United States. Demigod landed at the beginning of 2005, with The Apostasy arriving in 2007. Ezkaton was an EP released in 2008, and featured a handful of studio cuts along with some live tracks. It was followed in 2009 by the full-length Evangelion. ~ Greg Prato\n\n\n\nBand Members\n\nNergal\tGuitars, Vocals\nInferno\tDrums\nOrion\tBass, Vocals (backing)\n\n\n\nDiscography\n\nSventevith (Storming Near the Baltic) (1995)\nGrom (1996)\nPandemonic Incantations (1998)\nSatanica (1999)\nThelema.6 (2000)\nZos Kia Cultus (Here and Beyond) (2002)\nDemigod (2004)\nThe Apostasy (2007)\nEvangelion (2009)\nThe Satanist (2014)\n\n\n\nLive Barbarossa (2014)\n\n\n\n01. Intro 02:44\n02. Ov Fire and the Void 04:38\n03. Demigod 04:11\n04. Moonspell Rites 07:20\n05. Conquer All 04:09\n06. Christians to the Lions 05:05\n07. The Seed ov I 05:40\n08. Alas, Lord Is Upon Me 03:59\n09. Decade ov Therion 03:46\n10. At the Left Hand ov God 05:11\n11. Slaves Shall Serve 03:37\n12. Chant for Ezkaton 2000 06:50\n13. 23 (The Youth Manifesto) 04:33\n14. Lucifer 09:34\nGenre:\tDeath\nSubgenre:\tBlackened Death Metal\nBitrate:\tWebrip\nSize:\t156.27 MB\nShow/Hide Files: \t\n15 files","torrent":{"xt":"urn:btih:2181f3ff653400f60aa309246fa06509e63dadfc","amp;dn":"Behemoth+-+Live+Barbarossa+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2181f3ff653400f60aa309246fa06509e63dadfc","infoHashBuffer":{"type":"Buffer","data":[33,129,243,255,101,52,0,246,10,163,9,36,111,160,101,9,230,61,173,252]},"announce":[],"urlList":[]}}