{"title":"Elvis Presley - Spinout","uid":11270740,"size":184254852,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:227e01a34c5d712caee86efa551027333b93105e&amp;dn=Elvis+Presley+-+Spinout&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"reider7","files":13,"time":1414078476,"description":"Spinout (album)\nFrom Wikipedia, the free encyclopedia\n&quot;Adam and Evil&quot; redirects here. For the 2004 film, see Adam and Evil (film).\nSpinout\n\nSoundtrack album / Studio album by Elvis Presley\nReleased\tOctober 31, 1966\nRecorded\tFebruary 1966\nLength\t29:23\nLabel\tRCA Victor\nProducer\tGeorge Stoll\nElvis Presley chronology\nParadise, Hawaiian Style\n(1966)\tSpinout\n(1966)\tHow Great Thou Art\n(1967)\nSingles from Spinout\n&quot;Spinout&quot;\nReleased: October 1966\nSpinout is the twenty-seventh album by Elvis Presley, released by RCA Victor in mono and stereo, LPM/LSP 3702, in October 1966. Recording sessions took place at Radio Recorders in Hollywood, California, on February 16 and 17, 1966. It peaked at number 18 on the Top Pop Albums chart.[1]\nContents  [hide] \n1 Content\n2 Personnel\n3 Track listing\n4 References\nContent[edit]\nIn early 1966, executives at RCA and Presley's manager, Colonel Tom Parker, had arrived at the same conclusion. They could no longer expect records of only soundtrack recordings and session leftovers to perform as strongly as in the past.[2] Popular music was rife with changes in the mid-1960s, and with chart dominance from The Beatles, Bob Dylan, and a host of others, Presley no longer reigned supreme in the marketplace. Soundtrack sales were plunging, shifting fewer units and peaking at lower positions on the chart.[2]\nBut the Spinout sessions still adhered to the same formula of the past four years. Nine songs were recorded for the soundtrack, all of which appeared in the film. Most of the songs derived from the standard pool of songwriters, their publishing rights signed over to Elvis Presley Music and Gladys Music, the companies owned by Elvis and the Colonel.[3] One song &quot;Stop, Look, and Listen&quot; was previously recorded by Ricky Nelson and Bill Haley &amp; His Comets.[4] Two songs were released as a single the month before the film's premiere, the title track backed with &quot;All That I Am&quot;, and although both sides charted independently the A-side just barely made the Top 40. Elvis performed the song &quot;Adam and Evil&quot; on stage in the film which features a long drum roll at the beginning. He makes reference to Adam and Eve in the Bible, that &quot;Adam and Evil they go hand in hand / Eve taught him sin, that's the way it all began&quot;. Elvis clicks his fingers throughout the track.\nAcknowledging shifts in taste, three additional tracks of a contemporary nature were added as a &quot;special bonus&quot; to bring the album up to a more acceptable running time. Recorded at RCA Studio B in Nashville, Tennessee during the sessions for his gospel album How Great Thou Art, two were rhythm and blues songs. The other was &quot;Tomorrow Is a Long Time&quot;, an original by Bob Dylan (publishing rights were, of course, not signed over to Presley and Parker), with a ballad from a later Nashville session in June.[5] &quot;Down in the Alley&quot; had been released in 1957 by The Clovers, and Presley knew of and appreciated the Dylan song from the version on Odetta Sings Dylan by the folk singer Odetta.[6] &quot;I'll Remember You&quot; had been a record by Don Ho, and reflected Presley's infatuation with Hawaii and its culture.[7] Even with these inclusions, the album fared little better than its predecessors in 1966.\nDylan confessed to Rolling Stone in June 1969 that Presley's version of &quot;Tomorrow Is a Long Time&quot; was the cover of one of his songs that he &quot;treasured the most.&quot;[8] The three additional songs can be found on From Nashville to Memphis: The Essential 60s Masters, while three songs from the film soundtrack appeared on Command Performances: The Essential 60s Masters II: &quot;Spinout&quot;, &quot;All That I Am&quot;, and &quot;I'll Be Back&quot;.\nRCA Stereo FLAC","torrent":{"xt":"urn:btih:227e01a34c5d712caee86efa551027333b93105e","amp;dn":"Elvis+Presley+-+Spinout","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"227e01a34c5d712caee86efa551027333b93105e","infoHashBuffer":{"type":"Buffer","data":[34,126,1,163,76,93,113,44,174,232,110,250,85,16,39,51,59,147,16,94]},"announce":[],"urlList":[]}}