{"title":"Voidcraeft - The Body Is of Death (2014)","uid":11268923,"size":40945309,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:23f872c236356936af4e691a1e5b05e845601259&amp;dn=Voidcraeft+-+The+Body+Is+of+Death+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"analogkid6103","files":5,"time":1414061237,"description":"\nArtist: Voidcraeft\nRelease: The Body Is of Death\nYear: 2014\nCountry: Germany\n\nTrack listing:\n1. The Grey Ritual of Existence (5:08)\n2. The Weight of Days (5:02)\n3. Great Gulfs of Non-Being (5:18)\n4. From the Womb of Nature (5:18)\n\n\nDescription from http://voidcraeft.svart.nu/:\n\n\nQuote:\nVoidcraeft is my latest one-man musical endeavour.\nInstrumentally speaking, it is somewhat atypical black metal with an emphasis on dissonance.\nThe lyrical themes deal with emptiness, pessimism, renunciation, suffering and the human condition in general.\n\nIn my early days I was primarily influenced by raw black metal like Darkthrone (primarily Under a Funeral Moon and perhaps Transilvanian Hunger, they haven't made anything resembling black metal in close to a decade now, though) and Katharsis (of Norma Evangelium Diaboli fame).\nIn the past ten years the two artists I consumed the most and returned to over and over again are avant-garde black metal legends Deathspell Omega and Australian experimental (blackened) death metal pioneers Portal.\nOther bands worth mentioning are Nightbringer, Black Witchery, Diocletian and Antediluvian.\n\nJust like Negation Made Flesh, this release features some radical changes.\nThis is the first time I actually played all of the drums myself, which is also why they are rubbish.\nMy apologies.\nI started playing the drums about 10 weeks ago and I still have a long way to go.\nDespite my lack of skill, I had a great time working on these tracks.\n\nSo far I have largely failed to make my old approach to songwriting work.\nIn the past I used to do the guitars first, then the bass, and finally the drums.\nSince I started playing the drums, I actually switched to recording the drums first, then the guitars and finally the bass.\nI might give my old method another try for the next release.\nOn previous releases I frequently switched to more complex signatures, such as 3/4, 5/4 and 7/4, which I am not as comfortable with on the drums yet.\nThis is why this one is dominated by 4/4 and a tiny bit of 3/4.\nOverall, I think my music has become more conventional black metal.\n\nYou might also notice a progression in the speed of the tracks.\nTrack 1 is 139 BPM, track 2 is 151 BPM, while tracks 3 and 4 are 163 BPM.\nThis makes tracks 1 and 2 considerably slower than most of the previous releases.\nI am currently trying to get comfortable with playing blast beat at 173 BPM but it is quite a mess so far, even more so than at 163 BPM.\nEven though I currently only play the drums for about 40 minutes a day, I am constantly suffering from nasty sores on both of my hands.\nOne of them even starts oozing at times.\nThis is why I recently started wearing silly gloves for drummers and they somewhat reduced the damage to my hands.\nUnfortunately, they make me play slightly worse but I am not going stop using them any time soon.\n\nMy low vocals have made a bit of a comeback in this release.\nAs usual, I am not satisfied with my vocal work in general and I am not sure where to go from here.\nI was actually considering making a release that is all dual vocals only, i.e. high pitched and low pitched vocals in unison, at all times, because my high pitched vocals bother me all on their own.\nIn the past I recorded a couple of tracks that were dominated by low pitched vocals that only featured high vocals in combination with the low ones for highlights.\nMaybe I should give that approach another try.\nHowever, it is atypical in black metal and my current taste in riffs is not particularly suited for blackened death metal.\n\nLyrically, this release is all based on Ernest Becker (The Denial of Death) and Thomas Ligotti (Teatro Grottesco, The Conspiracy Against the Human Race).\nBecker was a cynical cultural anthropologist with a keen interest in some of the major figures of the infamous pseudoscience of psychoanalysis.\nNonetheless, I loved &quot;The Denial of Death&quot; and managed to create a large amount of lyrics from it, so far only exceeded by two of Emil Cioran's books and &quot;The Name of the Rose&quot; by Umberto Eco.\nI have since read a second book by him, which was rather disappointing in comparison.\nI do not think that I am going to evaluate any more of his work.\nLigotti generally writes too much prose I am unable to use, but &quot;The Conspiracy Against the Human Race&quot; was lovely.\nI recently realised that this book might have also influenced the title of the Leviathan album &quot;Massive Conspiracy Against All Life&quot;.\nThe title of this release is a reference to a quote by Becker, in which he was elaborating on the connection between human sexuality, suffering and death:\n&quot;Sex is of the body, and the body is of death.&quot;\n\nI still have many unused notes on the books I consumed in the past two months.\nOriginally I was hoping that I would be able to catch up with my pace of reading but I doubt that is going to happen any time soon.\nRecently, I purchased over 1000 pages worth of notes by Cioran, written in French.\nI have been given the impression that the English translation of this collection was cancelled so I will try to read it in the original language instead.\nThis is going to be extremely challenging.\nDespite my general interest in languages, my French is even worse than my drumming.\nI took French for a couple of years back in high school but I simply lack regular exposure and I hardly have any other Romance language to fall back on.\nIt might take me 6-12 months to deal with this sucker and I suspect I am going to give up on the way.\nIt remains to be seen.\nBy the way, sometimes I get the distinct feeling that this project is a bit of a personal &quot;black metal book club&quot;.\n\nFor the cover of this release, I continued using the old book print style I recently introduced, using scans of 17th-18th century books provided by the excellent Saxon State and University Library Dresden (SBLU Dresden).\nIn a far more minimalist way, though.\n\nThe new hardware I purchased for the purpose of both vocal recordings and drum recordings worked out really well.\nI am very pleased with the Tascam US-1800 audio interface and it works well with the new cheap laptop.\nUnfortunately there are no reliable Linux drivers available so I actually ended up installing Windows 8 on the laptop.\nThe new Rode NT1-A condenser microphone is considerably better than the rubbish t.bone SC-440 USB condenser microphone I used for two tracks on the previous full-length release.\nThe differences in the frequency response curves between high pitched vocals and low pitched ones were just ridiculous on that USB microphone.\n\nAs was the case at the end of Negation Made Flesh, I am still highly motivated to make more music.\nHell, I just realised that it took me only one month to make this release.\nI am currently also working on some open source programming project of mine and I recently started playingagain, so it might take longer this time.\n\nGenre:\tBlack\nBitrate:\tVbr\nSize:\t39.05 MB\nShow/Hide Files: \t\n5 files\nAdded:\t22/10/2014","torrent":{"xt":"urn:btih:23f872c236356936af4e691a1e5b05e845601259","amp;dn":"Voidcraeft+-+The+Body+Is+of+Death+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23f872c236356936af4e691a1e5b05e845601259","infoHashBuffer":{"type":"Buffer","data":[35,248,114,194,54,53,105,54,175,78,105,26,30,91,5,232,69,96,18,89]},"announce":[],"urlList":[]}}