{"title":"[FemaleAgent] Mike (f1275 / 05.12.2014)","uid":11645059,"size":715760626,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:25e9f041450a07c47312fb9082f460a447f4545b&amp;dn=%5BFemaleAgent%5D+Mike+%28f1275+%2F+05.12.2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2.No.2","files":1,"time":1417812437,"description":"[FemaleAgent] Mike (f1275 / 05.12.2014)\n\nMike (32 mins). They say it's the quiet ones that you have to watch, and this couldn't be more true with today's casting that I just experienced. Mike came across as a bit of a spoiled lad. A good looking guy who wanted to find some modelling work, but not someone that was desperate for cash. His parents paid for his own flat and they sounded very wealthy, although he wouldn't tell me how much allowance they also gave him on top of paying for his accommodation. So I had two barriers to getting this studs cock into my hands, I couldn't tempt him with money as he had no money troubles and he also had a girlfriend that he was in love with and had been faithful to. This was not stopping me getting my dose of cock for the day and I took the direct approach, I began undressing in front of him and the old saying became true once more, an erect penis has no conscience. There was no longer any need to convince him to fuck me once his cock was in my mouth. And fuck me was exactly what he did. I couldn't believe this quiet guy turned into an absolute fuck machine right before my eyes. My pussy hasn't been pounded like this in years. He fucked me so hard on my desk that he shook everything, including my laptop, off it and I didn't even bat an eyelid. I could not get enough of his stamina and energy, we fucked in a few more positions and then I needed to see his seed. I wanked him furiously and when he did cum it was a bit of a disappointment as his cum shot was not the best I've ever seen. To my dismay, he got straight up, as guilt of what he'd done seemed to consume him, and walked straight out of the office. I normally have to throw them out so I was slightly confused. But, at the end of the day, he fucked me better then most and I would love a repeat performance from this surprise fuck machine.\n\nHardcore, Agent\n\nScreens:\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=xhbbj0my39p3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=xhbbj0my39p3.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=zgl1gnzpy9wc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=zgl1gnzpy9wc.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:25e9f041450a07c47312fb9082f460a447f4545b","amp;dn":"%5BFemaleAgent%5D+Mike+%28f1275+%2F+05.12.2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25e9f041450a07c47312fb9082f460a447f4545b","infoHashBuffer":{"type":"Buffer","data":[37,233,240,65,69,10,7,196,115,18,251,144,130,244,96,164,71,244,84,91]},"announce":[],"urlList":[]}}