{"title":"Leibstandarte: Hitler's Elite Bodyguard","uid":11380897,"size":27067226,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:27a02a45977c5abfdf084d664c39181a9b55ddd9&amp;dn=Leibstandarte%3A+Hitler%27s+Elite+Bodyguard&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"HowdyDooDoo","files":-1,"time":1415214682,"description":"This series looks at the cutting edge of war, and deals exclusively with units capable of operating independently in the forefront of battle. Each volume in the series examines the chosen unit's origins and history, its organisation and order of battle, its battle history theatre by theatre, its insignia and markings. Also covered are biographies of the most important commanders of each unit. Each title ends with an assessment of unit effectiveness - as seen by the unit itself, by its opponents and in the light of more recent historical research. The books also include a detailed reference section with a critical biography, a listing of relevant museums and web sites, plus information about re-enactment groups and memorials. Initially Hitler's personal bodyguard, a 120-man guard that formed a cordon around him at the Nuremberg rallies, it became the Leibstandarte-SS Adolf Hitler in 1933 under SS-Obengruppenfuhrer Sepp Dietrich. It took a leading role in internal affairs but also took on a military role during the war, as a motorised regiment during the invasion of Poland, the Low Countries and France; a brigade during the conquest of the Balkans; a motorised division during Operation 'Barbarossa'; and an SS-Panzengrenadier Division during 1942. In 1943 it reformed in Italy becoming 1st SS-Panzerdivision Leibstandarte Adolf Hitler, and fought in Italy and Russia before being transferred to Normandy. Destroyed in the Falaise Pocket, a further refit saw it in action in the Ardennes, before moving to Hungary. What was left of the Division finally surrendered to US forces at Linz","torrent":{"xt":"urn:btih:27a02a45977c5abfdf084d664c39181a9b55ddd9","amp;dn":"Leibstandarte%3A+Hitler%27s+Elite+Bodyguard","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27a02a45977c5abfdf084d664c39181a9b55ddd9","infoHashBuffer":{"type":"Buffer","data":[39,160,42,69,151,124,90,191,223,8,77,102,76,57,24,26,155,85,221,217]},"announce":[],"urlList":[]}}