{"title":"Jonathan Richman - 2008 - Because Her Beauty... (FLAC°","uid":11235464,"size":294059011,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:28c8b01711e629fcf70ed1d92e39928e1250b8ba&amp;dn=Jonathan+Richman+-+2008+-+Because+Her+Beauty...+%28FLAC%26deg%3B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":15,"time":1413596547,"description":"&quot;As another understated Jonathan Richman album arrives, with remarkably little publicity, this Massachusetts native's influence can hardly be overstated. 1976's recently reissued The Modern Lovers is a proto-punk classic, foreshadowing hardcore punk's Minor Threat-led &quot;straight edge&quot; movement while inspiring artists from the Sex Pistols and David Bowie through Galaxie 500 and Art Brut. Richman's wide-eyed sincerity, developed further over subsequent solo LPs, also shines out of great indie-pop from the Television Personalities to Jens Lekman. But the last thing most people would expect from the There's Something About Mary guy is an album haunted by death.\n\nBecause Her Beauty Is Raw and Wild, Richman's first proper LP since 2004's minor masterpiece Not So Much to Be Loved as to Love, sounds like more of the same low-key acoustic-pop that Richman and percussionist Tommy Larkins have made into practically their own genre over the years. There's even Richman's latest ode to a painter-- the &quot;Egyptian Reggae&quot;-flavored &quot;No One Was Like Vermeer&quot;-- plus two more foreign-language songs (one French, one Spanish, both so-so). It's just that, for Richman, our human imperfection only heightens our human emotions: whether natural beauty on the title track, or natural odors on &quot;The Lovers Are Here and They're Full of Sweat&quot;. Richman and Larkins play their live shows without A/C, and the production here is just as warm and intimate, romanticizing the messy, ever-passing moment rather than striving for a digital perfection Richman probably considers drab and sterile.\n\nLike unruly hair or B.O., death is a fact of nature that polite society would prefer to cover up or ignore. It's also what gives love such precious urgency, Richman hints on the vibrant &quot;Time Has Been Going By So Fast&quot;, which glories in impermanence as a feature and not a bug. Still, for all the poignancy of Richman's theme, he can come across as preachy on &quot;When We Refuse to Suffer&quot;, which condemns anti-depressants as a way of avoiding the feelings that Mother Nature intended. Pain is natural, yeah, but it's asking a bit much for everyone to deal with it Richman's way, just as no recording, not even this one, is completely free of artifice. Does Richman wear sunscreen, or is that bad, too?\n\nIt would be harder to sympathize with Richman if he weren't in such palpable agony. Reprising the Modern Lovers' &quot;Old World&quot;, the singer bids a regretful farewell to a past he originally embraced. Finally, a devastating cover of Leonard Cohen's mortality-themed &quot;Here It Is&quot; is followed by the album's capstone, &quot;As My Mother Lay Lying&quot;, which brings to the nursing home the quiet dignity those who pass through it deserve, and suggests a personal tragedy at the heart of a grief-stricken album. Richman's refusal to refuse to suffer makes for an occasionally uneven listen (&quot;Our Party Will Be on the Beach Tonight&quot; is no party), but there's enough sad beauty in Raw and Wild to offer Richman devotees-- or anyone mourning a loved one-- some measure of solace. Even if it hurts a little.&quot;","torrent":{"xt":"urn:btih:28c8b01711e629fcf70ed1d92e39928e1250b8ba","amp;dn":"Jonathan+Richman+-+2008+-+Because+Her+Beauty...+%28FLAC%26deg%3B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28c8b01711e629fcf70ed1d92e39928e1250b8ba","infoHashBuffer":{"type":"Buffer","data":[40,200,176,23,17,230,41,252,247,14,209,217,46,57,146,142,18,80,184,186]},"announce":[],"urlList":[]}}