{"title":"Million Dollar Arm- Sometimes to Win, You Have to Change the Gam","uid":11184628,"size":85626060,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2bf62c78450d117c4f8bbada8e045d1ed50a1dea&amp;dn=Million+Dollar+Arm-+Sometimes+to+Win%2C+You+Have+to+Change+the+Gam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gratefuldawg77","files":6,"time":1412903759,"description":"India is a country with more than one billion people, a fanatical national cricket obsession, and exactly zero talent scouts. There, superstar sports agent J. B. Bernstein knew that he could find the Yao Ming of baseball; someone with a strong arm and enough raw talent to pitch in the major leagues. Almost no one in India is familiar with the game, but Bernstein had heard enough coaches swear that if you gave them a guy who throws a hundred miles an hour, they could teach him how to pitch. So in 2007, Bernstein flew to Mumbai with a radar gun and a plan to find his diamond in the rough. His idea was The Million Dollar Arm, a reality television competition with a huge cash prize and a chance to become the first native of India to sign a contract with an American major-league team.\n\nThe result is a humorous and inspiring story about three guys transformed: Bernstein, the consummate bachelor and shrewd businessman, and Dinesh and Rinku, the two young men from small farming villages whom he brought home to California. Million Dollar Arm is a timeless reflection on baseball and the American dream, as well as a tale of victory over incredible odds. But, above all, it's about the limitless possibilities inside every one of us.\n","torrent":{"xt":"urn:btih:2bf62c78450d117c4f8bbada8e045d1ed50a1dea","amp;dn":"Million+Dollar+Arm-+Sometimes+to+Win%2C+You+Have+to+Change+the+Gam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bf62c78450d117c4f8bbada8e045d1ed50a1dea","infoHashBuffer":{"type":"Buffer","data":[43,246,44,120,69,13,17,124,79,139,186,218,142,4,93,30,213,10,29,234]},"announce":[],"urlList":[]}}