{"title":"Disappeared - Season 5 - SD 480p","uid":11566257,"size":12525960038,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2c27e0ce069fc5fa1860994e271ed10a72e12119&amp;dn=Disappeared+-+Season+5+-+SD+480p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"voltxrid","files":-1,"time":1416955110,"description":" &lt;a href=&quot;http://bayimg.com/CAgJpaAgL&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/CAgJpaAgL&lt;/a&gt;\n\n\n=================================\n\nDisappeared - Season 5 - SD 480p\n\n=================================\n\n\nEpisode 1 - &quot;The Road Not Taken&quot; - January 9, 2012\n\nCollege freshman Ginni Wood drops out of contact with her mother while on a spring break road trip to visit her best friend Kelly Gaskins in Texas. The mystery deepens when investigators realize that Kelly and her boyfriend may be missing too.\n\n\nEpisode 2 - &quot;Dancing Into Darkness&quot; - January 16, 2012\n\n36 -year-old single mother Susan Walsh leads an unusual life: reporter by day, stripper by night. When she disappears outside of her New Jersey home, investigators don't know where to begin. But her loved ones insist that Susan would never leave her son.\n\n\nEpisode 3 - &quot;Crime and Punishment&quot; - January 23, 2012\n\nWhen Terrance Williams goes missing, his family fears he may have been picked up for driving without a license. But when they find his car has been towed by a police officer with no record of an arrest, an investigation reveals a disturbing case.\n\n\nEpisode 4 - &quot;Wrong Side of the Tracks&quot; - January 30, 2012\n\nJackie Markham, a feisty trucking company manager, vanishes from her Florida home without a trace of violence. A boyfriend's tale suggesting she departed with a rival suitor appears to crumble - just as her purse is found near the lair of a serial killer.\n\n\nEpisode 5 - &quot;Daddy's Girl&quot; - February 6, 2012\n\nDanice Day's father receives a phone call on January 12, 2002 that throws him into a panic. His daughter has gone missing in Monte Vista, Colorado. She is a recovering drug addict. Did the pressure of sobriety become too much, or has someone harmed her?\n\n\nEpisode 6 - &quot;Last Call&quot; - February 13, 2012\n\nAllison Jackson-Foy left a bar after drinks with a close friend and was never seen or heard from again. Her extended family says there is no way she would have left her daughters behind, but they wonder if she was fed up with her stormy marriage.\n\n\nEpisode 7 - &quot;Hometown Hero&quot; - February 20, 2012\n\nMargaret McEnroe disappears from her home, leaving behind her infant daughter alone in her crib. Local cops know Margaret as a hero firefighter, with a fiery temper but strong maternal instincts. How could this loving mother disappear without a trace?\n\n\nEpisode 8 - &quot;A Soldier's Story&quot; - February 27, 2012\n\nIn August 2010, 31-year-old ex-marine Noah Pippin left Michigan to report to the California National Guard. But Noah never shows up. Police trace his path to the forests of Montana, leaving Noah's parents to wonder why he is venturing into the wild.\n\n\nEpisode 9 - &quot;Into the Bayou&quot; - March 5, 2012\n\nClinton Nelson heads off to Louisiana to get to know his biological father and take a job in the oilfields. The 20 year-old is looking for a fresh start. But 6 months later, the bayou is combed for traces of a man who had been facing enormous pressure.\n\n\nEpisode 10 - &quot;Little Girl Lost&quot; - March 12, 2012\n\nJoey Lynn Offutt, mother of three small children, vanishes after an argument with her on-and-off-again boyfriend. Is she holding a grudge or overwhelmed by motherhood and taking a break? A fiery tragedy leaves loved-ones searching for answers.\n\n\nEpisode 11 - &quot;The Vortex&quot; - March 19, 2012\n\nPolice believe Ben McDaniel disappeared during a dangerous underwater cave dive. But the best divers in the world search for his body and are convinced that he is not in the cave. Baffled, investigators start questioning the nature of his disappearance.\n\n\nEpisode 12 - &quot;Final Exam&quot; - March 26, 2012\n\nSuzy Lyall never returned to her dorm room after working the nightshift, and her boyfriend, Richard, became concerned. When her family finds out, panic ensues. After an investigation begins, leads point to the possibility that Suzy isn't far from campus.\n\n\nEpisode 13 - &quot;Too Young For Love&quot; - April 2, 2012\n\nFourteen-year-old Chioma Gray disappears with an older man in 2007 and crosses the border into Mexico. For four years, her family wonders how she disappeared and if she's still alive. In October of 2011, they get the answers they've been waiting for.\n\n\nEpisode 14 - &quot;Footprints in the Sand&quot; - April 9, 2012\n\nIn the early hours of May 1st, 2010, Jersey City escort Shannan Gilbert goes missing on the affluent shores of Long Island. Police launch a search through the dense underbrush, and what they find hidden in the weeds will spark a gruesome investigation.\n\n\nEpisode 15 - &quot;Just a Nice Guy&quot; - April 16, 2012\n\nThe last time Zebb Quinn was seen, he was leaving his work shift with an acquaintance in Asheville, North Carolina. Family members know the shy teenager's every move, but they are stunned when police find unusual evidence surrounding his disappearance.\n\n\nEpisode 16 - &quot;Hard Life in the Big Easy&quot; - April 23, 2012\n\nDana Pastori hoped to leave New Orleans and get custody of her daughters, but she never got the chance. It is not until Hurricane Katrina hits that anyone realizes Dana is missing. In the storm's aftermath, the truth about her disappearance is exposed.\n\n\nEpisode 17 - &quot;Missing By Design&quot; - April 30, 2012\n\nWhen Arizona millionaire Billy McGrath disappears, his financial advisor alerts police. Friends share the concern when someone starts impersonating Billy through calls and emails. As police follow the clues, they uncover a shocking and twisted plot.\n\n\n=========\n\nIf problems or inconsistencies with any of the content files are noticed, please let me know via the comments and I will attempt to upload some corrected replacements.  Thanks much and enjoy!  :-)","torrent":{"xt":"urn:btih:2c27e0ce069fc5fa1860994e271ed10a72e12119","amp;dn":"Disappeared+-+Season+5+-+SD+480p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c27e0ce069fc5fa1860994e271ed10a72e12119","infoHashBuffer":{"type":"Buffer","data":[44,39,224,206,6,159,197,250,24,96,153,78,39,30,209,10,114,225,33,25]},"announce":[],"urlList":[]}}