{"title":"The Glasshouse 2006 (Aussie Comedy)","uid":11650176,"size":12670483983,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2c72befd5e3a5b03e8ce01c269f50940235a5ff7&amp;dn=The+Glasshouse+2006+%28Aussie+Comedy%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"MoofieMan","files":37,"time":1417865576,"description":"This is an almost complete collection of The Glasshouse 2006 from ABC TV (Australian Broadcasting Corporation). Unfortunately I missed the last episode (sob), but I think I recorded the majority of it.\n\nThe show revolved around the three lead comedians - Wil Anderson, Corinne Grant and Dave Hughes - leading a panel discussion on current events, news and pop culture of the day. It had a unique energy about it, a massive following and was always extremely funny. I wish I had more of it but sadly this was all I had by the time I decided to produce digital versions of it.\n\nI originally recorded it onto VHS tape (yes folks - it's a VHS rip). I captured to MPEG2 through a Winfast PVR Capture Card at high quality. Eventually I compressed the DVD's to AVI with XVID video and MP3 audio. Recently, I remastered the soundtracks in Audacity (levelling them up to -1dB)and remuxed the XVID video with the new AC3 soundtrack into MKV format.\n\nNo matter what, I have tried to maintain or improve the integrity of the video and audio for the best possible outcomes. So here it is... The Glasshouse 2006.\n\nCheers and enjoy,\nMoofieMan\n\nPS: For more cool Aussie satire check out http://thepiratebay.se/torrent/11625440/Shaun_Micallef_s_Mad_As_Hell\n\n\nPPS: Please seed as I'm on limited bandwidth and can't do it by myself. Thanks, MM","torrent":{"xt":"urn:btih:2c72befd5e3a5b03e8ce01c269f50940235a5ff7","amp;dn":"The+Glasshouse+2006+%28Aussie+Comedy%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c72befd5e3a5b03e8ce01c269f50940235a5ff7","infoHashBuffer":{"type":"Buffer","data":[44,114,190,253,94,58,91,3,232,206,1,194,105,245,9,64,35,90,95,247]},"announce":[],"urlList":[]}}