{"title":"Disney's Hercules Series","uid":11207001,"size":5229967201,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:31360e38c39a481bb23b4bd75a3c01eb2592ad32&amp;dn=Disney%27s+Hercules+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"tini0069","files":65,"time":1413233486,"description":"Hercules (1998 TV series)\n\nDisney's Hercules: The Animated Series is an American animated series based on the 1997 film of the same name and the Greek myth. The series premiered in syndication on August 31, 1998, and on Disney's One Saturday Morning on September 12, 1998. The syndicated series ran 52 episodes, while the Saturday morning run ran 13.[1]\n\nThe series follows Hercules, as a teenager, training as a hero, as well as trying to adjust to life. With his free-spirited friend Icarus, his future-seeing friend Cassandra, and his teacher Philoctetes (&quot;Phil&quot;), he battles his evil uncle Hades. Like all teenagers though, Hercules has to worry about peer pressure when the snobbish prince Adonis ridicules him. The series notably contradicts several events in the original film.\n\n~~~\n\nDisney's Hercules, like the animated series Disney's The Little Mermaid, is a spin-off of the 1997 theatrically released animated film of the same name (Hercules) and is based on his teenaged adventures, though it is not a prequel to the film of the same name (Disney's The Little Mermaid featured tales of a 16-year-old Ariel which occurred before the start of the theatrical film) or truly a sequel like Disney's Aladdin (whose tales takes place after the original film and The Return of Jafar). Rather Hercules features events which occur midway through the actual film, similar to The Lion King 1Â½ and Tarzan II, during his years in training on the Isle of Idra under the tutelage of Philoctetes (Phil) the Satyr. Many of the Olympian Gods and Goddesses only glimpsed during the film pay visit to the young hero-to-be and help or hinder him in his adventures. Other characters from the film that appear are the evil god Hades (voiced by James Woods) and winged stallion Pegasus (voiced by Frank Welker). Corey Burton portrayed Hercules' father Zeus.\n\nHowever, the series ignores a certain fact about the movie: In the film, Hades believed that Hercules was dead throughout his first 18 years of his life, but in the series, the two of them have many interactions while Hercules is still in high school.\n\n\n\n\n*** Please note\nS01E28 - Hercules and the Big Games is Missing Audio, I will edit and re-upload if I can locate it!","torrent":{"xt":"urn:btih:31360e38c39a481bb23b4bd75a3c01eb2592ad32","amp;dn":"Disney%27s+Hercules+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31360e38c39a481bb23b4bd75a3c01eb2592ad32","infoHashBuffer":{"type":"Buffer","data":[49,54,14,56,195,154,72,27,178,59,75,215,90,60,1,235,37,146,173,50]},"announce":[],"urlList":[]}}