{"title":"Duniya (1968) MHCe DVD5 - Eng Subs - Dev Anand, Vyjantimala [DDR","uid":11320217,"size":4660324186,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:328bd7c6db3b524ac86bf7f96a29e88f5c06ef79&amp;dn=Duniya+%281968%29+MHCe+DVD5+-+Eng+Subs+-+Dev+Anand%2C+Vyjantimala+%5BDDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1414596259,"description":"Duniya (1968) MHCe DVD5 - Eng Subs - Dev Anand, Vyjantimala [DDR]\n\nDuniya is a 1968 Hindi romantic thriller film written by K. A. Narayan and directed by T. Prakash Rao. The film starred Dev Anand, Vyjayanthimala in the lead with Balraj Sahni, Johnny Walker, Lalita Pawar, Prem Chopra, Sulochana Latkar, Madan Puri, Nana Palsikar, Achala Sachdev, Laxmi Chhaya, Jagdish Raj, Tun Tun, Brahm Bhardwaj and Pakistani actor Suresh as the ensemble cast. \nThe film was produced by Amarjeet. The film's score was composed by Shankar Jaikishan duo with lyrics provided by Hasrat Jaipuri, S. H. Bihari and Gopaldas Neeraj, edited by Shivaji Awdhut and was filmed by Faredoon A. Irani. \nThe story revolves around three friends Amarnath, Gopal and his sister, Mala, how they face their problem in the life and how they realize from the problem in the rest of the story.\n\n    CAST:-\n    Dev Anand as Amarnath Sharma or Amar\n    Vyjayanthimala as Mala\n    Balraj Sahni as Public Prosecutor Ramnath Sharma\n    Johnny Walker as James Bond of India\n    Lalita Pawar as Mrs. Sharma\n    Prem Chopra as Mohanchand or Mohan\n    Sulochana Latkar as Janki R. Sharma\n    Madan Puri as Madan\n    Nana Palsikar as Girdharilal\n    Achala Sachdev as Shobha R. Sharma\n    Jagdish Raj as Madan's associate\n    Laxmi Chhaya as Laxmi\n    Tun Tun as Chabeli in cameo appearance\n    Brahm Bhardwaj as Advocate Mehta\n    Suresh as Ram Singh or Gopal\n\nDirected by: T. Prakash Rao. \nProduced by: Amar Jeet. \nMusic Director: Shankar - Jaikishan\t\nLyricist: Hasrat Jaipuri, S.H. Bihari, Neeraj\nRunning time 149 minutes\t\n\nSongs are included in MP3s\nDuniya (1968)_00. Title Music and Screen Credits, Shankar Jaikishan\nDuniya (1968)_01. Jawan tum ho jawan hum hain, Rafi\nDuniya (1968)_02.  Phalsapha pyar ka tum kya jano, Rafi\nDuniya (1968)_03. dooriyan nazdikiyan ban gayi, Asha &amp; Kishore\nDuniya (1968)_04. Duniya isi ka naam hai, Rafi &amp; Sharda\nDuniya (1968)_06. Tu Hi Meri Laxmi, Rafi\nDuniya (1968)_08. Yeh dharti hindustan ki. Asha\nDuniya (1968)_09. Music, Shankar Jaikishan\n\nMOVIE PLOT:- Duniya (1968)\nThe movie deals about three friend Amarnath, Gopal and his sister, Mala, As Mala and Gopal's mom is a widow and is unable to care for both the children, she decides to let her Bombay-based cousin, Shobha R. Sharma, adopt Mala. Gopal is always in trouble with the villagers for petty theft, and when he learns that Mala has left, he too runs away from home. Years later, all three have grown up. Mala's mom is deceased, while she continues to live with her aunt and uncle, Public Prosecutor Ramnath Sharma; Amarnath is now an Advocate working with Senior Advocate Mehta, and is in love with Mala, not knowing that she is his childhood friend; while Gopal has been to prison in Poona, Madras, and the Police in Hyderabad want him for questioning. Soon Amarnath will be defending Gopal, alias Ram Singh, for the murder of one Mohanchand - and it will be an uphill task for Amarnath - for not only do the Police have airtight evidence against Gopal, Mohanchand was to be the future son-in-law of Ramnath - who has sworn to bring Gopal to justice by hook or by crook.\n\nAmarnath, Gopal and his sister, Mala, are three friends who live in a small village in India. As Mala &amp; Gopal's mom is a widow and is unable to care for both the children, she decides to let her Bombay-based cousin, Shobha R. Sharma, adopt Mala. Gopal is always in trouble with the villagers for petty theft, and when he learns that Mala has left, he too runs away from home. Years later, all three have grown up. Mala's mom is deceased, while she continues to live with her aunt and uncle, Public Prosecutor Ramnath Sharma; Amarnath is now an Advocate working with Senior Advocate Mehta, and is in love with Mala, not knowing that she is his childhood friend; while Gopal has been to prison in Poona, Madras, and the Police in Hyderabad want him for questioning. Soon Amarnath will be defending Gopal, alias Ram Singh, for the murder of one Mohanchand - and it will be an uphill task for Amarnath - for not only do the Police have airtight evidence against Gopal, Mohanchand was to be the future ..\n\n\nAt the end of its theatrical run, the film grossed around INR 180,000,000 with nett gross of INR 90,00,000, thus becomes the tenth highest grossing film of 1968 with verdict average success at box office.\nFilmfare Awards Best Cinematographer - Faredoon A. Irani\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 3934 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 448kb/s CBR 48000 Hz\nAudio Streams: 6\nAudio Languages: Hindi\nRunTime: 2:34:47\nSubtitles: English\nRipped by: Trinidad [DDR]   \nDuration: 2:34:47","torrent":{"xt":"urn:btih:328bd7c6db3b524ac86bf7f96a29e88f5c06ef79","amp;dn":"Duniya+%281968%29+MHCe+DVD5+-+Eng+Subs+-+Dev+Anand%2C+Vyjantimala+%5BDDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"328bd7c6db3b524ac86bf7f96a29e88f5c06ef79","infoHashBuffer":{"type":"Buffer","data":[50,139,215,198,219,59,82,74,200,107,247,249,106,41,232,143,92,6,239,121]},"announce":[],"urlList":[]}}