{"title":"Coast.To.Coast.AM.11.09.14.The.Nazi.Diaspora.iSAAC","uid":11424923,"size":57880392,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:35693af8384bafe16d86ba8ccf9425746bbdceca&amp;dn=Coast.To.Coast.AM.11.09.14.The.Nazi.Diaspora.iSAAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Isaac09","files":-1,"time":1415648485,"description":"The Nazi Diaspora\n\n\nDate:\t11-09-14\nHost:\tJimmy Church\nGuests:\tPeter Levenda, Scott Wolter\n\nAudio\nFormat                                   : MPEG Audio\nFormat version                           : Version 1\nFormat profile                           : Layer 3\nDuration                                 : 2h 41mn\nBit rate mode                            : Constant\nBit rate                                 : 48.0 Kbps\nChannel(s)                               : 1 channel\nSampling rate                            : 44.1 KHz\nCompression mode                         : Lossy\nStream size                              : 55.2 MiB (100%)\n\n\nLevenda pointed to the infamous Project Paperclip as a key element in this agenda, since many of the scientists imported to America were former SS officers who were fanatical in their Nazi ideologies and far more loyal to each other than to the United States. Moreover, he noted that since the Nazis hated capitalism as well as communism, they saw the infiltration of America and the Soviet Union as a way of pitting both nations against each other. According to Levenda, this tactic was evident during the Space Race as Nazi scientists in the US and USSR would secretly exchange information about their work in order to ensure that neither nation had a decisive advantage and, thus, fuel even greater spending on these projects. In later years, as this Nazi network became more entrenched, he contended, it would use its influence to steer the US and USSR into imprudent wars and other foolhardy adventures.\n\nOn how the contemporary War on Terrorism connects to this surreptitious Nazi plan, Levenda detailed how the idea of a global jihad was actually conceived in 1914 by a German expert on Islam who convinced his superiors to work with Muslim leaders to foment a holy war against colonial powers. In turn, he said, this concept would be manipulated, fostered, and funded by the underground Nazi network throughout the twentieth century and into contemporary times, leading ultimately to groups like Al Qaeda and ISIS. In looking at how history has unfolded since the Nazi diaspora, Levenda chillingly observed that &quot;everything is going the way they wanted it&quot; and noted that the USSR crumbled, America is in a seemingly unending war against terrorists, and Germany has been both reunified and wields tremendous power in the European Union.\n\nAmerica Unearthed\nDuring the first hour of Sunday's show, forensic geologist Scott Wolter talked about his History Channel show America Unearthed and his mission of using science and intuitive theories to explain the most mysterious artifacts and sites in America. &quot;Only now are we beginning to realize the incredible history we've had on this continent for thousands of years,&quot; he said of artifacts which suggest that America was being visited long before Columbus or the Vikings arrived here. To that end, he expressed dismay that mainstream academia continues to dismiss powerful evidence for such an idea. During his appearance, Wolter also discussed the season three premiere of America Unearthed, which suggested that Davy Crockett survived the Alamo via help from the Freemasons.\n\nNews segment guest: Stephen Bassett\n\nWebsite(s):\n\nsinisterforces.info\nhistory.com/shows/america-unearthed\n\nBook(s):\n\nThe Hitler Legacy: The Nazi Cult in Diaspora\nRatline: Soviet Spies, Nazi Priests, and the Disappearance of Adolf Hitler","torrent":{"xt":"urn:btih:35693af8384bafe16d86ba8ccf9425746bbdceca","amp;dn":"Coast.To.Coast.AM.11.09.14.The.Nazi.Diaspora.iSAAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35693af8384bafe16d86ba8ccf9425746bbdceca","infoHashBuffer":{"type":"Buffer","data":[53,105,58,248,56,75,175,225,109,134,186,140,207,148,37,116,107,189,206,202]},"announce":[],"urlList":[]}}