{"title":"[NubileFilms] Emily Grey (Passionate Awakening)","uid":11373165,"size":316350629,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:3be30f226aeb7b585f68f67f8c5f3eef974ddd89&amp;dn=%5BNubileFilms%5D+Emily+Grey+%28Passionate+Awakening%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Upl0ad3rR","files":1,"time":1415115188,"description":":ScreeNshotS: &lt;a href=&quot;\nhttp://imgruby.com/view-image/a2a308307e9989e28a60326606877afc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgruby.com/view-image/a2a308307e9989e28a60326606877afc.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgruby.com/view-image/6c571d317fe661e5c916f513cc6f4d72.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgruby.com/view-image/6c571d317fe661e5c916f513cc6f4d72.jpeg&lt;/a&gt;\n\n\nNubile beauty Emily Grey wakes up beside her lover Dylan Snow feeling very horny and eager to quench her thirst for sex. The couple starts with some mutual masturbation with Dylan rubbing his already-hard cock while Emily slips her hand beneath her sheer panties for some self-love before climbing into Dylan's lap.\n\nAs satisfying as masturbation was, Emily is much more interested in using her soft warm mouth and small hands to greedily suck and stroke her guy's erection. She can't stop smiling as she bobs her head and takes small licks with her sweet tongue.\n\nEmily's juicy snatch deserves some attention, too, and Dylan doesn't scrimp when she peels off her panties and climbs onto his face. He dives in with total eagerness, lapping his tongue up and down her sweet slit and rubbing her clit with his magic fingers. Moaning her appreciation, Emily drops down into a languorous 69 so that they can continue their quest for pleasure together.\n\nWhen the lovers finally come together, it is with Emily lifting her juicy bottom to slide herself down onto Dylan's rock hard dick for a hip rocking good time. When Dylan sits up and props one of Emily's legs over his shoulder their sex gets more athletic, but soon Emily pushes him back again to take charge and keep things hot and heavy.\n\nTurning onto her side, Emily spreads her legs so that Dylan can come into her from behind for some sensual spooning sex. Dylan sets a quick and steady pace driving in and out of Emily's welcoming warmth, making it easy for her to rub her own clit until she is screaming her pleasure.\n\nQuickly climbing up onto her knees, Emily moans her approval when Dylan slides into her fuck hole doggy style. The position is perfect for a proper pussy pounding and Dylan delivers, pumping his hips while Emily's small tits sway with the impact.\n\nKnowing that Dylan's pleasure is imminent, Emily takes matters into her own hands. Laying on her belly while Dylan stands before her, she uses her clever mouth and hands to blow him until he explodes all over her waiting mouth in a delicious facial. Dylan is happy to thank his lover for her efforts by flipping her onto her back and licking her juicy snatch until she sighs her final climax","torrent":{"xt":"urn:btih:3be30f226aeb7b585f68f67f8c5f3eef974ddd89","amp;dn":"%5BNubileFilms%5D+Emily+Grey+%28Passionate+Awakening%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3be30f226aeb7b585f68f67f8c5f3eef974ddd89","infoHashBuffer":{"type":"Buffer","data":[59,227,15,34,106,235,123,88,95,104,246,127,140,95,62,239,151,77,221,137]},"announce":[],"urlList":[]}}