{"title":"Not man apart - lines from Robinson Jeffers and Photos of the Bi","uid":11238258,"size":21352018,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3bec4a6d0a424d99c1c06e66a1ad89d92f28d08d&amp;dn=Not+man+apart+-+lines+from+Robinson+Jeffers+and+Photos+of+the+Bi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"STBGD","files":-1,"time":1413630446,"description":"pdf / english / 1965 / 159 pages / 20.3 MB\n\n&quot;The poetry and photography give a sense of the spaciousness of the area. It features some America's great artists. The image quality and poetry selection are amazing.&quot;\n\n****\n\n\n&quot;The pictures, taken by the likes of Ansel Adams, Cole and Edward Weston, Steven Crouch, William Gannet, Philip Hyde and even one courtesy of the Lick Observatory, immortalize the Big Sur Coast for all those of us unlucky enough not to have been alive in the 1960s, and visited the Central California Coast ourselves.\n\n95% of the photos are of nature, hence the title, Not Man Apart, meaning that nature is not a part of man, but that man is a part of nature, that we cannot live without the the fantastic biosystem from which we came. But there is one picture of a smog-laden city, by William Gannet, although no humans can be seen. Also, apart from the picture of Robinson in front of Tor House in the front, one photo does reveal a naked girl, looking so much a water nymph, poised next to a creek, beneath a giant redwood tree.\n\nThis is all set the the words of Robinson Jeffers, the &quot;Cassandra of the Carmel Coast,&quot; as many called him. With a foreword by Loren Eisley, and an introduction by Margaret Wentworth Owings&quot;\n\nAMAZON","torrent":{"xt":"urn:btih:3bec4a6d0a424d99c1c06e66a1ad89d92f28d08d","amp;dn":"Not+man+apart+-+lines+from+Robinson+Jeffers+and+Photos+of+the+Bi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bec4a6d0a424d99c1c06e66a1ad89d92f28d08d","infoHashBuffer":{"type":"Buffer","data":[59,236,74,109,10,66,77,153,193,192,110,102,161,173,137,217,47,40,208,141]},"announce":[],"urlList":[]}}