{"title":"[ISO HEAVEN]World of Tanks.iso","uid":11273140,"size":1257236480,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:3f0ee3f263ab931cfa9c6b2b236f9846b9d45028&amp;dn=%5BISO+HEAVEN%5DWorld+of+Tanks.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"animazou","files":-1,"time":1414107257,"description":"For developers Wargaming.net, 150 different tanks, tank destroyers and self-propelled guns just aren't enough. They plan to eventually expand their game's roster to include around 500 engines of war from around the world. Some are infamous, some are esoteric and more than a few never got off the drawing board.\n\nIt seems that, whatever kind of person you might be, Wargaming.net believe there's a tank out there just for you. Just as there is also an armour-piercing shell with your name on it or, in my case, a constant and unremitting rain of them.\n\nWorld of Tanks has been rumbling along in open beta for a while now, but we're reviewing it as a boxed copy is making its way onto the UK high street this week - despite the fact that it's free to play online (more on this later). It's a team-based shooter which draws heavily from its first-person cousins, giving you the opportunity to take control of tanks from the classic era of armoured combat while also shedding any pretence of being a serious vehicle sim. You still point and shoot, but you do it at a rather slower and more considered pace. If you can imagine Day of Defeat as a lithe and limber ninja, then World of Tanks is a stoic sumo with a particular and very patient style.\n\n1\nWhile there are some awesome vehicles in this game, a few are terrible embarrassments to tank-kind.\nThat's not to say it's at all difficult to pick up. I can't help but think of it as Counter-Strike on caterpillar tracks, as it certainly manages to demonstrate that game's variety, accessibility and immediacy, but at a more measured pace.\n\nFrom the moment you climb into your first tank, the game very much makes you feel you're inside a rolling, squeaking, jerking combat machine: something that can be as clumsy as it is deadly. Your field of fire is limited, your creaking turret takes time to rotate and with every start and stop, your entire world spasms with the momentum. Driving through a crater or a ditch pitches your whole vehicle violently, ruining your aim, and as you lurch about a country village you can't help but accidentally smash your way through yet another fence, dog house, washing line or dining room.\n\nAlthough there's the familiar mouse-and-keyboard control system, instead of strafing and skipping their way from cover to cover, players motor their way through large outdoor environments, hiding their vehicles in the shells of collapsed buildings or quietly parking behind a bush on a hill. Rather than needing the precise aim of a twitch gamer, you'll have to consider the benefits of cover, of outmanoeuvring enemy units and, when you can, the advantages of striking at an opponent's weaker rear armour.\n\nThen there's the actual business of spotting the enemy. If nearby team-mates can see an enemy unit, then you also can, but otherwise enemies remain hidden until your crew spot them, a factor determined by a combination your equipment, their distance, their speed and their cover - and also whether they are firing high-explosive rounds toward you.\n\n2\nThe weird thing about spotting open-topped tanks: You never see any crew inside them.\nOf course, this works both ways, and if you've been spotted by one enemy tank, it's a good bet any of their nearby allies know where you are, too. It's not always prudent to open fire at the first opportunity and often possible to remain hidden in undergrowth and watch naive tank commanders trundle by. It also pays to watch for clouds of smoke or the tell-tale sign of a falling tree in the distance.\n\nDon't get me wrong - none of this is either technical nor particularly cerebral, but it does mean the game is far less about making split-second decisions and more about making the right decisions. In theory, it also makes for increased emphasis on team play. Since artillery units are vulnerable on the field of battle but excellent at shelling enemy units spotted from afar, it makes sense for braver souls in fast, lighter tanks to scout ahead and paint targets. Heavy tanks can hold the front lines while self-propelled guns can snuggle down into cover.\n\nOf course, gamers will be gamers and you'll always have one or two with their own interpretation of play - and World of Tanks isn't yet the most communicative of experiences. It doesn't help that the game suffers somewhat from an undeveloped communications interface and could do with a few more shortcuts and, perhaps most importantly, more space for more in-game text that doesn't fade away quite so fast.\n\nThe promised campaign mode also still needs to be developed. In the meantime, there's the robust but unremarkable battle mode where, rather than having players join specific servers to play particular games, the game matches two teams' worth of tanks and sends them to battle across one of its randomly-selected environments. This mode is a bog-standard affair where the winner either eliminates all of their opponents or parks someone in the enemy's spawn long enough to capture it. Teams are matched according to the tier of the tanks that players use; more powerful tanks are gradually unlocked as more games are played and thus usually belong to more experienced players.\nhe higher tiers also represent the vicious tanks deployed towards the mid-to-late 1940s, while most of the lower-end vehicles are older, smaller and often comically primitive. The game's community has christened the default German tank, the 1920s Leichttraktor, the LOLtractor, and some early units look and feel like overweight daleks, but these will never meet their deadly descendents.\n\nNevertheless, no tank, tank destroyer or artillery piece is to be underestimated and every battlefield is a pick-and-mix of lumbering lethality, with packs of steel-snouted metal beasts sniffing through the undergrowth in search of prey. Whether you're in a ruined city or a sub-arctic forest, every match is a hunting experience, a deadly game of Lynx and Maus (the Maus actually being a very, very big tank).\n\nSince this is a free-to-play title, when you purchase a retail copy you aren't really buying the game itself but instead paying for the premium content within: shiny extras reserved for those willing to front a little cash. In this case, it's a free premium tank and a generous helping of in-game currency to spend on... well, whatever bonuses, tanks or tank components you like.\n\n3\nLucky hits allow you to knock out key components, immobilize vehicles and raise insurance premiums.\nIt is, of course, up to you whether you think of it as a springboard into the game, a head start that will let you leave the freeloaders behind, or a silly way to start playing something that you'll never need to pay for. The vast majority of content in the game can be earned through gradual play and while the premium content may be different, it's no more powerful than anything that can be unlocked. The idea is that nobody who gives money to the developers buys an unfair advantage. It works, too.\n\nThe tanks are very well balanced and the discerning driver will surely find a model to suit. Artillery appeals to the campers among us, while there's a particular thrill to be had in driving a speeding Leopard scout at 60kph through the enemy base, spotting the opposing units as their bulky, angry, heavy tanks burp high-explosive shells all about you. At the higher tiers, the pace of play tends to slow further, as many tanks become bulkier and beastlier; for my money, the most exciting tiers are the middle ones, since they have a wide variety of tanks and maintain a good pace of play.\n\nUnfortunately, the game's pimp-my-tank options are currently underwhelming. It's disappointing that selecting and upgrading the components your vehicle comes with is less about customisation than it is about necessity: most tanks have a particular ideal configuration that you'll want to work towards. You never tweak the tanks in your garage.\n\nIf the ability to further customise your tanks would be welcome, so too would a few more opportunities to do things with their crews. At present, it's largely pointless to train or retrain crew members on different vehicles and instead quicker to get a new (and free) crew with each new tank you buy, while the almost limitless array of awards and decorations they receive does little for their effectiveness or ability. They simply get better over time and then become as dumb as donkeys when you sit them down in your newest acquisition.\n\n4\nYou'll want to keep switching between first- and third-person views for better situational awareness.\nMore on World of Tanks\nHands On: World of Tanks\nHeavy going?\nNews: Don't be surprised that just 2.2% of F2P players spend money\nLower than you thought?\nNews: World of Tanks dev Wargaming buys Total Annihilation and Master of Orion franchises\nPromises &quot;big triple-A titles&quot;.\n\nVideo: World of Tanks self-propelled guns\nJust wait ammo!\nWorld of Tanks update 7.0 screenshotsWorld of Tanks update 7.0 screenshotsWorld of Tanks update 7.0 screenshots\nScreenshots: World of Tanks update 7.0 screenshots\nWhile there's a good selection of attractive maps, the game's worst flaw is failing to make the properties of certain terrain clear. Sometimes your tank will happily motor up and down steep gradients, yet other apparently gentle inclines can't be passed, or seemingly shallow water can't be entered. On some maps, learning where you can't drive can be a frustrating and fatal case of trial and error as you suddenly find your tank brought to a halt by a tiny rock or moderate slope. For many light and medium tanks, even the briefest immobilisation can be deadly.\n\nIt might be a little cruel to pick apart World of Tanks like this while it's still in beta, but Wargaming.net is nevertheless charging people for a boxed copy. Still, the game is progressing well and constantly seeing new maps and new tanks added, with a whole slew of French units soon to be released.\n\nI'm not sure I'd recommend you bother buying before trying, since the best thing about World of Tanks is that you can take the controls of its brutal, oily, grumbling gunfighting giants for free. And that's the first - but far from the only - reason why you should consider dipping into this entertaining and unusual spin on the online shooter","torrent":{"xt":"urn:btih:3f0ee3f263ab931cfa9c6b2b236f9846b9d45028","amp;dn":"%5BISO+HEAVEN%5DWorld+of+Tanks.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f0ee3f263ab931cfa9c6b2b236f9846b9d45028","infoHashBuffer":{"type":"Buffer","data":[63,14,227,242,99,171,147,28,250,156,107,43,35,111,152,70,185,212,80,40]},"announce":[],"urlList":[]}}