{"title":"Hen.Party.XXX.DVDRip.x264-TwistedDesires","uid":11440694,"size":1037966162,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:40687ccf99fbb3d6915abb941e8b0e2b9eb7ee21&amp;dn=Hen.Party.XXX.DVDRip.x264-TwistedDesires&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"xxxlavalxxx","files":7,"time":1415802478,"description":"Category\tAll Girl, Girl-Girl, Feature, Plot Based\n\nDirector\tAndrej Lupin\nStarring\tEveline Neill, Iwia, Tess Lyndon, Timea Bela\n\nThe director/producer team of Andrej Lupin and Ariel Piper Fawn have chosen an elegantly simple premise for their latest film for Viv Thomas, the adult DVD Hen Party. Two women - Eveline Neill and Chelsy Sun - invite a couple of friends - Tess Lyndon and Timea Bella - to a party at their house in the country. At first the events at the ensuing &quot;Hen Party&quot; are what one might expect when four women gather to socialize - a glass of wine, friendly chit-chat, a lighthearted joke, and an amusing story enjoyed in a relaxed and sociable setting.\nBut the individual attendees at this &quot;Hen Party&quot; soon begin to pair off, and that's when things begin to get extremely interesting! When Sun and Bella wander off to examine the home's hot tub, Neill quickly and successfully seduces Lyndon - a delicate kiss becomes an intimate caress, and soon the twosome are making love with unrestrained abandon, licking, sucking, stroking, fingering, and rimming each other to a series of powerful climaxes. In the hot tub things are a bit more subdued, at least at first. Chelsey is by far the more experienced, and Timea is shy and timid, but the warm water, bubbly jets, and Sun's aggressive advances cause her reluctance to evaporate, and they share a no-holes-barred session of orgasmic pleasure that leaves them both completely satisfied.\nDuring a brief lull in the festivities, Eveline Neill plays a leisurely game of solo billiards, but when she notices Timea Bella toweling off in the adjacent room she invites her guest to join her for a more interesting sport. One thing leads to another and the twosome are quickly engaged in an in-her-face bout of sweltering Sapphic sex atop the pool table. And when Tess Lyndon interrupts Chelsey Sun's post sex snooze, the twosome give in to their powerful mutual attraction for a passionate, unrestrained, and red-hot tumble that reaches a final explosive climax during a bout of vigorous clit-to-slit collision in the scissors position. &quot;Hen Party,&quot; where everybody wants to come... and everybody does!\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=84916033301172785631.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=84916033301172785631.jpg&lt;/a&gt;\n    \t &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=90920140303332094465.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=90920140303332094465.jpg&lt;/a&gt;\n    \t &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=59565634424336648146.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=59565634424336648146.jpeg&lt;/a&gt;","torrent":{"xt":"urn:btih:40687ccf99fbb3d6915abb941e8b0e2b9eb7ee21","amp;dn":"Hen.Party.XXX.DVDRip.x264-TwistedDesires","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40687ccf99fbb3d6915abb941e8b0e2b9eb7ee21","infoHashBuffer":{"type":"Buffer","data":[64,104,124,207,153,251,179,214,145,90,187,148,30,139,14,43,158,183,238,33]},"announce":[],"urlList":[]}}