{"title":"Sommarstället (The Summer House)","uid":11294923,"size":1591458693,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:435971cac3f570d7ffb86f650cc83b47752b2b17&amp;dn=Sommarst%26auml%3Bllet+%28The+Summer+House%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bethnalgreen","files":1,"time":1414371139,"description":"Swedish independent drama from 2013, starring Sara Blomqvist, Kalle Josephson, Ania Chorabik, Nanna Blondell, Aliette Opheim\n\nFrom IMDB: When old feelings return, a reunion of friends at a Swedish summerhouse is thrown into chaos, hurt and conflict. |\n\n\n  MONTREAL WORLD FILM FESTIVAL REPORT\n________________________________________________________________\n\t   by Harold von Kursk\n\t\t  DIARIO\n\n\nSOMMARSTÃ„LLET  (THE SUMMER HOUSE)\n\nOne of the true gems of the Montreal festival, Swedish director Marcus Werner Hed's The Summer House is one of those joyously self-contained auteur films that linger fondly in one's memory.  Drawing on Danish Dogme principles, the film (co-directed and written with Johan von Reybekiel) provides a riveting hand-held appreciation of a summer party running afoul of its drunken guest's psycho-sexual peccadilloes.  \n\nMuch of our pleasure comes from the sensationally intense and nuanced performance of actress Sara Blomqvist, a former top model in her native Sweden who makes a remarkable film debut as Stina, the leggy cousin of Carl whose birthday is being celebrated in a dilapidated farmhouse in the Swedish countryside. \n\nEven though Stina is presumably in love with her dronish English boyfriend Nick, she nevertheless uses the occasion to engage in drunken sex with the pretentious and obnoxious Carl, who has long nurtured a lustful interest in her. When Nick discovers that Stina has cuckolded him, he proceeds to sink Carl's prized pontoon boat, although not, unfortunately, with Carl inside.  \n\nBlomqvist is a revelation, her subtle expressions and sculpted features alternating between languid alienation and the spoiled indifference of the pretty girl lacking focus.  She brings a simmering sensuality and fragile beauty to Stina whose sexual appetite clearly exceeds Nick's Anglo-Saxon limitations.\n\nCrackling with neurotic tension and dark undercurrents, The Summer House is reminiscent of Thomas Vinterberg with dashes of Ingmar Bergman thrown in for good measure.  The assembled Swedes indulge in a dizzying display of familiar Nordic recriminations and suppressed antagonisms, fuelled by alcohol and a general lack of intellectual ambition. Were he still alive,  Ingmar would probably be watching it late one night on his island home of Faro","torrent":{"xt":"urn:btih:435971cac3f570d7ffb86f650cc83b47752b2b17","amp;dn":"Sommarst%26auml%3Bllet+%28The+Summer+House%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"435971cac3f570d7ffb86f650cc83b47752b2b17","infoHashBuffer":{"type":"Buffer","data":[67,89,113,202,195,245,112,215,255,184,111,101,12,200,59,71,117,43,43,23]},"announce":[],"urlList":[]}}