{"title":"William Raymond Finck - 3 Years Jewish Among Aryans","uid":11347519,"size":41461759,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:46010f967b511b7f1dd3e8373810da4cc5d59d50&amp;dn=William+Raymond+Finck+-+3+Years+Jewish+Among+Aryans&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":-1,"time":1414875122,"description":"Is William Raymond Finck Jewish? By His Own Standards, He is Jewish. \n\nIntroducing WhiteyLeaks! The hidden facts of faux \nnationalism truths that faux pro-white activists are \ntoo timid to expose. \n\nIs William Raymond Finck \nJewish? By His Own \nStandards, He is Jewish. \n\nTwitter hash-tag: # WHITEYLEAKS \ncontact via Twitter: @ WHITEYLEAKS \nRack the muck: share your leaks! \n\n\n\nTitle: Is William Raymond Finck Jewish? By His Own \nStandards, He is Jewish. \n\nSubtitle: Evidences of Jewish Ancestry in the Family of \nWilliam Raymond Finck, Jr. \n\nSubtitle: Proprietor of Christogenea.org adjudicated guilty \nof being Jewish. \n\n&quot;For with what judgment ye judge, ye shall be judged: and \nwith what measure ye mete, it shall be measured to you again.&quot; \n(Matthew 7:2) \n\n\n\n0 JEWS IN FINCK f S WOODPILE? \n\nWilliam Finck is the proprietor of Christogenea.org. \nChristogenea is a website project that Finck &quot;bills&quot; as \nsupportive of national socialism and dual seed-line christian \nidentity. Through numerous broadcasts and essays over the years \nMr. Finck has repeatedly denounced the Jewish race as the seed \nof Satan which deserves extermination for its deep evil. In the \nlast several years Mr. Finck has taken Jewish impostors to task \nfor teaching contrary to his version of the christian identity \nsuperstition . \n\n\n\n\nWilliam Finck may have some explaining to do. New \ninformation about his ancestry points to a trifecta of Jewish \nsurnames victory dancing on his &quot;dual seed-line.&quot; \n\n\n\nA judgment of Mr. Finck' s racial &quot;Jewishness&quot; is rendered \nusing his own standards. Finck loudly adjudged several other \npersons as Jewish deceivers crept into the pro-white movement \nbased on their Jewish surnames. For example he publicly \nexcoriates Joseph November, aliased as Eli James, because of the \nJewish origin of the surname of &quot;November.&quot; Finck declares the \nwife of Martin Lindstedt to be of Jewish admixture due to her \nJewish surname, &quot;Samuelson. &quot; \n\nWhat's good for the goose is good for the gander. Mr Finck \nhas no less than three Jewish surnames spotting his leopard \nskin. BATTACOTTA, VASILE, and LAUER are the three main Jewish \nsurnames of William Finck 's ancestors. How a man with triune \nJewish ancestry can &quot;bill&quot; himself as a professional &quot;anti- \nsemite&quot; is a matter worth considering. Let us consider it in \nlight of Finck ' s ancestral revelations. \n\n\n\nWilliam Raymond Finck, Jr. is the son of William Raymond \nFinck, Sr. and LABERTA ELAINE BATTACOTTA. \n\nLABERTA ELAINE BATTACOTTA is the daughter of Stanley J. \nBATTACOTTA and Doris VASILE. \n\nWilliam Finck has led his followers to believe that \nBATTACOTTA is of Italian origin, for many Italians are white \npeople. In truth BATTACOTTA is a converso-name , or Americanized \nspelling of BATAKAITE. BATAKAITE is not an Italian name. It is a \nLithuanian Jewish (feminine) surname. In Lithuanian surnames, \nthe suffix -AITE is added to the father's surname to render a \nfemale child's surname. Thus when we remove the Lithuanian \nfemale suffix from BATAKAITE the result is BATAK, the original \nsurname of LABERTA 'S great grandfather in Lithuania. BATAK is a \nJewish Hebrew name that means ruin or destroyer. It is also \nspelled PATAK, POTOC (as in Mark Potoc of SPLC fame) and PETAK. \n\n\n\n\nJUDGMENT IS A TWO-EDGED \nSWORD. IT WORKS BOTH WAYS. \n\n\n\n\nSECRETS OF THE WOODPILE. \n\n\n\nIn other words, Mark POTOC and Finck ' s grandfather share the \nsame surname with variant spellings ! \n\nMr. Finck' s great grandfather, STANLEY J. BATTACOTTA, bore \nthe Lithuanian name, STANISLAWA JOSEF BATAK. As an aside there \nis no historical Italian surname of BATTACOTTA in any written \nhistorical records of Europe. The Italian cognate for BATAKAITE \nis BADAGUITE, and is from the Slavic Hebrew original. However, \nSTANLEY BATTACOTTA' s father STANISLAWA did not come from Italy. \nHe boarded a ship from Italy to America but his father's \nbirthplace was Lithuania. \n\nSTANISLAWA JOSEF BATAKAITE used alternate spellings of his \nname in America. Stanley, Stanislaw, Stanislava, and for his \nsurname BUTTACOOTA. \n\nU Knowing BATAK is a common Jewish surname, we must use Mr. \nFinck ' s own logic and consider him of Jewish ancestry. \n\nThe mother of Mr. Finck, named, LABERTA, is a change of her \noriginal name which was recorded as LABUTA which is an \nAmericanized spelling of LIPETA. This name means &quot;little \nlioness&quot; in Yiddish and Hebrew. LABUTA is the feminine form of \nthe Hebrew name LEVI or LEBI. Her real name without the \nLithuanian gender suffix is LABUTA ELENA BATAK or LIPETA ELENA \nPATAK. Both her first and last names are common Jewish names. \nThese are the names of Mr. Finck 's mother. \n\nf Knowing that LABUTA is a common Jewish name, we must use \nMr. Finck 's own logic and adjudge both his mother and him as \nracially Jewish. \n\nDoris VASILE is Mr. Finck ' s maternal grandmother. Her \nhusband is Erl VASILE, son of Domenico VASILLO. VASILE or \nVASILLO are variants of WASSEL, a common Jewish name. \n\nf Seeing that WASSEL is a common Jewish surname, we must use \nMr. Finck ' s own logic and adjudge him as Jewish. \n\nThe Grandmother of William Raymond Finck, Sr. is Elizabeth \nLAUER. Her surname is a common Jewish name in Germany. LAUER \nmeans &quot;thief,&quot; or &quot;liar&quot; or &quot;shifty.&quot; Thus is was given as a \nsurname to many Jews in the good old days when Jews knew better \nthan to argue with their German betters. \n\nf Knowing that LAUER is a common Jewish surname, we must use \nMr. Finck 's own logic and measure to him the judgment he metes \nupon Mr. Lindstedt and Mr. November. We must convict Mr. Finck \nof Jewishness. \n\n\n\nWILLIAM FINCK SHOULD EXPLAIN \nHIS HYPOCRISY \n\nIf Mr. Finck can post proof on his website that his family \nlineages are of non-Jewish descent ten generations into history, \ndespite the names of clearly ubiquitous Jewish usage, it could \nset his audience at ease and persuade them he is not a slithery \nserpent crept in to deceive the sheep. Ten generations of a \nclean &quot;bill&quot; of racial health should satisfy Mr. Finck 's own \ndoctrine, &quot;a bastard shall not enter into the congregation of \nYahweh, even unto his tenth generation.&quot; If Mr. Finck can \nexplain away Jewish surnames back for ten generations, then let \nno man suspect him of being a Jew. \n\nÂ©WILLIAM FINCK f S FRIENDS MUST \nEXPLAIN THEIR HYPOCRISY \n\nFollowers of christian identity and white nationalists who \nfail to act on this information expose themselves as Mr. Finck ' s \nfellow brood of vipers. Failure to expose the devil is \ncollaboration with him. If Eli James is a Jew based on his name \nof NOVEMBER, then Bill Finck is a Jew based on the three strikes \nrule of three Jewish surnames in his family line- -BATAK , LAUER, \nWASSEL. By failing to publicly hold Mr. Finck to his own \nstandard, all who know these presents are enemies of the white \nrace, hypocrites, liars, and probably Jewish impostors hustling \nthe same shuck-and- j ive of Mr. Finck 's song-and-dance . By \nfailing to measure Mr. Finck with his own yardstick, such \npersons' sloth and timidity prove a lack of discernment or \njudgment, and absence of loyalty to racial purity. In a word, it \nconvicts all of Finck 's friends of Jewishness. This is not an \nappeal to mere guilt by association, but of guilt by \ncapitulation . \n\nWill Pastor Mark Downey stand by his man? Will he offer an \nappeal to the verdict of Finck 's Jewishness? Will anti- Jewish \npropagandist Clifton Emahiser stand up for or against the \nJewishness of William Finck? Are any of Finck 's friends really \nanti- Jewish? Or are they all shuckin' and jivin' the sheep for \nshekels? \n\n\n\n\n(6) THE FINAL JUDGMENT \n\n\n\nThis final judgment employs the same formula of logic with \nwhich William Finck convicted Joseph November, Martin Lindstedt, \nand Mrs. Samuelson-Lindstedt of Jewishness. By his own logic \nWilliam Finck is adjudicated guilty of Jewishness. &quot;Beware of \nthe leaven of the Pharisees, which is hypocrisy.&quot; \n\n&quot;For with what judgment ye judge, ye shall be judged: and \nwith what measure ye mete, it shall be measured to you again.&quot; \n(Matthew 7:2) \n\nHow many of Finck 's &quot;pro-white&quot; friends also have histories \nrich with Jewishness? WhiteyLeaks hopes to promulgate them for \nthe public record. Is the &quot;pro-white&quot; movement really composed \nof white Caucasians? Or is &quot;da mooment &quot; really just a shyster \nracket &quot;glitzed and glammed&quot; to smother real nationalism in the \nshadows? WhiteyLeaks may rack the muck chasing such questions. \n\nVERDICT: GUILTY, \nWILLIAM RAYMOND FINCK, JR. , \n\nIS A JUDE. \n\n\n\n(7) WILLIAM R. FINCK GENEALOGY \n\nNotes: Simplified Genealogy Chart (Sources, U.S. Census \nData, marriage documents). \n\nÂ© WILLIAM RAYMOND FINCK, JR. \n\n=&gt; WILLIAM RAYMOND FINCK, SR. (father) \n=&gt; ELIZABETH LAUER (great grandmother) (Jewish name) . \n\n\n\nÂ© WILLIAM RAYMOND FINCK , JR. \n\n=&gt; LABERTA ELAINE BATTACOTTA (mother) \n=&gt; STANLEY JOSEF BADAKAITE (father) (Jewish name) . \n\nÂ© WILLIAM RAYMOND FINCK, JR. \n\n=&gt; LABERTA ELAINE BATTACOTTA (mother) \n=&gt; ERL VASILE (father) (Jewish name) . \n\n(8) JEWISH SURNAMES ETYMOLOGY \n\nNotes: Simplified Surname morphology (Sources, U.S. Census \nData, marriage documents). \n\nÂ© BATTACOTTA (English neologism) \n\n=&gt; BUTTACOOTA (English neologism) \n\n=&gt; BADAKAITE (Lithuanian, from Hebrew, BADAK + KAITE, Slavic \nfeminine suffix) . \n\nÂ© VASILE (Anglicized) \n\n=&gt; VASSEL, VASILLO, WASSEL (Common Slavic and European Jewish \nsurname) . \n\nÂ© LAUER (German) (common Jewish surname, e.g., Matt LAUER, the \nJewish propagandist) \n\n\nTwitter hash-tag: #WHITEYLEAKS \ncontact via Twitter: @WHITEYLEAKS \nRack the muck: share your leaks!","torrent":{"xt":"urn:btih:46010f967b511b7f1dd3e8373810da4cc5d59d50","amp;dn":"William+Raymond+Finck+-+3+Years+Jewish+Among+Aryans","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46010f967b511b7f1dd3e8373810da4cc5d59d50","infoHashBuffer":{"type":"Buffer","data":[70,1,15,150,123,81,27,127,29,211,232,55,56,16,218,76,197,213,157,80]},"announce":[],"urlList":[]}}