{"title":"I Survived... - Season 4 - HD 720p","uid":11443614,"size":22735761403,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:49dd969a9a4796904ba298cbec75b9bb68488b70&amp;dn=I+Survived...+-+Season+4+-+HD+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"voltxrid","files":-1,"time":1415834186,"description":" &lt;a href=&quot;http://bayimg.com/kAElhaaGE&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/kAElhaaGE&lt;/a&gt;\n\n\n==================================\n\nI Survived... - Season 4 - HD 720p\n\n==================================\n\n\nEpisode 1 - &quot;Jennifer / Neely Ann&quot; - May 15, 2011\n\nA Palm Springs, California nurse is kidnapped and sexually tortured by a serial killer; and a mother and her daughter are trapped in an attic during a flood in Nashville, Tennessee.\n\n\nEpisode 2 - &quot;Sharetha / Joe / John&quot; - May 22, 2011\n\nA pregnant woman living in Flint, Michigan is abducted, assaulted, and has her throat cut; a man survives a plane crash and is stranded in an icy river; and a man plays dead when his ex-co-worker shows up at the Warren, Ohio warehouse where he works and starts executing people.\n\n\nEpisode 3 - &quot;Kara / Dan / Tamecka&quot; - June 5, 2011\n\nA teen girl is abducted and assaulted in Columbia, South Carolina; a photographer is trapped during the Haitian earthquake under debris in a hotel; and a Lancaster, Texas woman is beaten and slashed with scissors by her neighbor.\n\n\nEpisode 4 - &quot;Jason / Dave and Joe / Martin&quot; - June 12, 2011\n\nThree Utah men go over waterfalls during a flash flood and fight to stay alive; a teenage boy from Portsmouth, Virginia is abducted and assaulted by a pedophile, then left to die chained in a box, buried under a thick layer of snow.\n\n\nEpisode 5 - &quot;Julie / John&quot; - June 19, 2011\n\nA mother and her children are abducted from Palmetto Bay, Florida and taken to the Everglades; a man survives a bear attack in Lake Moses, Washington.\n\n\nEpisode 6 - &quot;Harold / John / Lisa&quot; - October 23, 2011\n\nA store manager in Saint Louis is shot during a robbery, a Minot, North Dakota teen loses his arms in a farming accident, a girl from Tampa, Florida is kidnapped by a serial killer\n\n\nEpisode 7 - &quot;Yvette / Jeremy and Jenny / Arkesha&quot; - October 30, 2011\n\nOutside Salt Lake City, Utah a 17 year old and her boyfriend are shot late one night, in the parking lot of the deserted reservoir they were hiking in. Two people's lives collide in a split second when two Los Angeles bound trains collide on the same track. A 14 year old, walking home from a school dance in New Orleans, Louisiana, is attacked 3 men- all at different times- in a hellish night she'll never forget.\n\n\nEpisode 8 - &quot;Anita / Jim and Glen / Sabret&quot; - November 6, 2011\n\nA woman in Kokomo, Indiana is kidnapped, raped, and forced to live, chained up, in a metal box, for 13 days. 2 brothers are struck by lightning in a cabin at Yosemite National Park. A propane truck driver in Miami, Florida displays extraordinary courage when she is viciously beaten by a stranger.\n\n\nEpisode 9 - &quot;Amy / Jeff / Tyler&quot; - November 13, 2011\n\nA De Soto, Missouri woman is raped and choked by a man she met at a party. A snowboarder is caught up in an avalanche. In Medicine Hat, Alberta, Canada, a 13-year-old boy and his 12-year-old friend spurned a school bully. They thought they were safe, until he shows up at one boy's home. After repeatedly sexually assaulting the 13-year-old, he slits both boy's throats, leaving them to die in a burning house.\n\n\nEpisode 10 - &quot;Michelle / Terri-Lynn / Jennifer&quot; - November 20, 2011\n\nA Fort Wayne, Indiana woman is carjacked and raped. When a tornado sweeps through Huntsville, Alabama, a woman and her husband become trapped in their collapsed apartment complex, not knowing they're the only survivors in the entire building. An 8-year-old is abducted from her Dickinson, Texas condo and raped, before her attacker slits her throat and leaves her to die in a sawgrass prairie.\n\n\nEpisode 31 - &quot;9/11 Survivors&quot; - September 6, 2011\n\nThe stories of 12 survivors from the Sept. 11 attacks are recalled.\n\n\n=========\n\nI have scoured the Internet for episodes 11-30, but cannot find them available anywhere.  Furthermore, the shows that are currently marketed for streaming are either out of their original sequence or labeled differently by their video providers.  Not sure why this all is, but it's the reason the season is not complete here.  I still wanted to share what was available, though - in the correct order, too.  If I ever happen to locate the omitted episodes then I will surely add them at that time.\n\nAlso, if problems or inconsistencies with any of the content files are noticed, please let me know via the comments and I will attempt to upload some corrected replacements.  Thanks much and enjoy!  :-)","torrent":{"xt":"urn:btih:49dd969a9a4796904ba298cbec75b9bb68488b70","amp;dn":"I+Survived...+-+Season+4+-+HD+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49dd969a9a4796904ba298cbec75b9bb68488b70","infoHashBuffer":{"type":"Buffer","data":[73,221,150,154,154,71,150,144,75,162,152,203,236,117,185,187,104,72,139,112]},"announce":[],"urlList":[]}}