{"title":"Star Wars DDK Cuts","uid":11636952,"size":25538530549,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:4c0b51d0c616a3aafa4f41b3fcb23b0abcf27377&amp;dn=Star+Wars+DDK+Cuts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bbqwoa","files":2,"time":1417742322,"description":"The DDK Fan edits of Star Wars Episodes V and VI are a labour of love.\n\nCreated primarily for personal enjoyment, they are the versions of these great movies I always wanted.\n\nThe included DDK Cut versions of these films are the only Star Wars Fan Edits I have produced. For the best version of Star Wars Episode IV: A New Hope, I recommend you download Adywan's Star Wars Episode IV A New Hope: Revisited\n\nBecause Adywan's A New Hope is such a great edit, I have never felt the need to produce my own cut of that film.\n\nUsing many versions of the films as my sources for content, I have primarily based my cuts on the Blu Ray sources.\n\nAs such, you are required to own the Blu Rays of these movies in order to enjoy my fan-edits.\n\nI will not provide an itemized edit list. \n\nI will note what significant changes I feel are worth mentioning, but suffice to say, the general point of these cuts is to create versions of these two films that retain the quality of the Blu Ray versions and the changes therein, but to remove or return to the original version various scenes and shots that I feel were destroyed by recent versions of these films.\n\nThe DDK cuts are an amalgam of Blu Ray, Theatrical and unused footage.\n\nThe issues that the majority of people have with the recent versions have been fixed.\n\nThe changes that I feel are superior to the Theatrical releases are still present.\n\n-----------\n\nIncomplete changes include:\n------\n\nThe Empire Strikes Back:\n------\n\nAdywan's version of the Ion Cannon shot has been used\n\nAdywan's version of the Emperor Hologram scene has been used\n\nBoba Fett's Voice has been restored to the original Jason Wingreen voice\n\nThe Battle of Hoth score has had its introduction restored\n\nDarth Vader's &quot;Bring my shuttle&quot; line and the original score from the original release has been restored\n\nVader's arrival on the Executor has been removed, restoring the original, exciting pace of the Bespin escape\n\nSlight framing changes has been made to remove set and matte errors\n\nColour correction has been performed in various places for consistency\n\n\n------\nReturn of the Jedi\n------\nJabba's Subtitles have been hardcoded \n\nThe special edition dance/music scene has been replaced by an altered repeat of the previous song to respond to Jabba's request to &quot;Do that again&quot; while Oola is dropped into the Rancor pit\n\nVarious colour corrections have been done to address various glaring green matte errors, shadow saturation problems, superimposition contrast errors etc\n\nThe extraneous 'belching' sounds of the movie have been removed.\nBoba Fett is now &quot;crunched&quot; and not &quot;burped&quot; by the Sarlacc,\n\nThe Frog outside Jabba's palace no longer belches.\n\nR2's short circuit no longer features the extra CG nonsense\n\nFrame rate smoothing has been performed on the Alliance Fleet's arrival at Endor\n\nThe &quot;Popping In&quot; TIE Fighters have been fixed. Instead of TIE Fighters simply &quot;appearing&quot; out of nowhere, they now are in the shot continuously\n\n&quot;Grey Leader&quot; has been replaced by a Mon Calamari (Grey Leader and Red 2 are played by the same actor in the movie. and this is a lazy way to deal with it. I am not re-cutting the battle of Endor and shooting additional pilots to address the glaring continuity errors)\n\nRadio chatter has been added to the Battle of Endor between Rebel ships.\nThe voices are the voices of Rebel pilot footage that was unused but intended to be in the film.\n\nThe Battle of Yavin is rife with radio chatter and Endor would logically be, as well. (after all, in every shot of every pilot, they are speaking to another pilot)\n\nVader's &quot;NOooooo&quot; screams have been removed\n\nAnakin Skywalker's ghost has been restored to that of his older self, played by Sebastian Shaw\n\nThe Special Edition's celebration scenes have been removed with the exception of Coruscant.\n\nDarth Vader's cremation music has been restored to the original, unused version.\n\nVarious matte paintings have been corrected to blend better with their scenes.\n\n-----\n\nAgain, this is a partial list of changes, but gives you the idea of what these edits are all about.\n\n\nThese files are in 1920X1080 with Stereo AAC audio. If you are playing these on a surround sound system I recommend using Neo 6 Cinema or Pro Logic\n\nThese are version '1' of these cuts.\n\nI may release updated versions in the future.\n\nThank you and as always I hope you enjoy.\n\n-DDK","torrent":{"xt":"urn:btih:4c0b51d0c616a3aafa4f41b3fcb23b0abcf27377","amp;dn":"Star+Wars+DDK+Cuts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c0b51d0c616a3aafa4f41b3fcb23b0abcf27377","infoHashBuffer":{"type":"Buffer","data":[76,11,81,208,198,22,163,170,250,79,65,179,252,178,59,10,188,242,115,119]},"announce":[],"urlList":[]}}