{"title":"Calculating Ada The Countess of Computers EN SUB WEBRIP [MPup]","uid":12439613,"size":1054473868,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4d3eed4647ba80bea6cf55cc604c10018b2bef77&amp;dn=Calculating+Ada+The+Countess+of+Computers+EN+SUB+WEBRIP+%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":2,"time":1442563107,"description":"BBC.Documentaries.2015.09.17.Calculating.Ada.The.Countess.of.Computers.EN.SUB.WEBRIP.[MPup]\n\nFormat: MPEG-4\nSize: 1280x720\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\nDocumentary in which Dr Hannah Fry tells the story of Ada Lovelace's remarkable life - a 17th-century countess whose work helped give rise to the modern era of computing.\n\n[img]http://extraimago.com/images/2015/09/18/b4ee65973c972aa4b5285f95e021aa3d.jpg[/img]\n\nAda Lovelace was a most unlikely computer pioneer. In this film, Dr Hannah Fry tells the story of Ada's remarkable life. Born in the early 19th century Ada was a countess of the realm, a scandalous socialite and an 'enchantress of numbers'. The film is an enthralling tale of how a life infused with brilliance, but blighted by illness and gambling addiction, helped give rise to the modern era of computing.\n\nHannah traces Ada's unlikely union with the father of computers, Charles Babbage. Babbage designed the world's first steam-powered computers - most famously the analytical engine - but it was Ada who realised the full potential of these new machines. During her own lifetime Ada was most famous for being the daughter of romantic poet Lord Byron ('mad, bad and dangerous to know'). It was only with the advent of modern computing that Ada's understanding of their flexibility and power (that they could be far more than mere number crunchers) was recognised as truly visionary. Hannah explores how Ada's unique inheritance - poetic imagination and rational logic - made her the ideal prophet of the digital age.\n\nThis moving, intelligent and beautiful film makes you realise we nearly had a Victorian computer revolution","torrent":{"xt":"urn:btih:4d3eed4647ba80bea6cf55cc604c10018b2bef77","amp;dn":"Calculating+Ada+The+Countess+of+Computers+EN+SUB+WEBRIP+%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d3eed4647ba80bea6cf55cc604c10018b2bef77","infoHashBuffer":{"type":"Buffer","data":[77,62,237,70,71,186,128,190,166,207,85,204,96,76,16,1,139,43,239,119]},"announce":[],"urlList":[]}}