{"title":"Years.of.Living.Dangerously.Part.9.720p.HDTV.x264-QCF","uid":11637680,"size":1343646321,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:52d7ece0bd5968e1470e32b9a594a28ba770ae8d&amp;dn=Years.of.Living.Dangerously.Part.9.720p.HDTV.x264-QCF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Core.Share","files":34,"time":1417745724,"description":"Years.of.Living.Dangerously.Part.9.720p.HDTV.x264-QCF\n\nIn Episode 9, &quot;Moving a Mountain&quot; (June 9, 2014), Michael C. Hall concludes his journey to Bangladesh, where rising seas are expected to submerge 17% of the country.\n\nHe learns that global warming is a human rights, public health and foreign policy issue. Sanjayan questions top climate scientists in their fields who collect data from the past, such as ice core samples, that explain how our climate is changing. Friedman interviews President Barack Obama on climate change. He finds that climate can change so fast that it can wipe out a civilization and that &quot;action taken to curb greenhouse emissions could have a measurable, helpful impact.&quot;\n\nObama echoes this, saying &quot;there's a lot we can do about&quot; global warming.[35] He notes that he is deeply concerned about the issue as a father, and he is optimistic that, with persistence, America can make progress on battling global warming and can become a leader on the issue. Obama acknowledges that, to avoid the worst effects of global warming, we must leave some fossil fuels unexploited.\n\nHe tells Friedman that &quot;if you profess leadership in this country at this moment in our history, then you've got to recognize [that global warming] is going to be one of the most significant long-term challenges, if not the most significant long-term challenge, that this country faces and that the planet faces. ... when [the effects of climate change] start multiplying, then people start thinking '... We're going to reward politicians who talk to us honestly and seriously about this problem.'&quot;\n\n---\n\nThis completes the 720p Scene releases available on TPB for this important documentary series.\n\nProps and thanks to the original uploaders to alt.binaries.teevee\n\nPlease keep sharing and seeding for the long term, thank you","torrent":{"xt":"urn:btih:52d7ece0bd5968e1470e32b9a594a28ba770ae8d","amp;dn":"Years.of.Living.Dangerously.Part.9.720p.HDTV.x264-QCF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52d7ece0bd5968e1470e32b9a594a28ba770ae8d","infoHashBuffer":{"type":"Buffer","data":[82,215,236,224,189,89,104,225,71,14,50,185,165,148,162,139,167,112,174,141]},"announce":[],"urlList":[]}}