{"title":"Grateful Dead - In The Dark (1987) 2013 HDTracks 24-96-FLAC","uid":11158878,"size":947555347,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5868f3b4ad8beb3610e2df91c8c3e1fc2c1c3437&amp;dn=Grateful+Dead+-+In+The+Dark+%281987%29+2013+HDTracks+24-96-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"hal4000","files":-1,"time":1412482642,"description":"The Grateful Dead was an American rock band formed in 1965 in Palo Alto, California. The band was known for its unique and eclectic style, which fused elements of rock, folk, bluegrass, blues, reggae, country, improvisational jazz, psychedelia, and space rock, and for live performances of long musical improvisation. &quot;Their music,&quot; writes Lenny Kaye, &quot;touches on ground that most other groups don't even know exists.&quot; These various influences were distilled into a diverse and psychedelic whole that made the Grateful Dead &quot;the pioneering Godfathers of the jam band world&quot;. They were ranked 57th in the issue The Greatest Artists of all Time by Rolling Stone magazine. They were inducted into the Rock and Roll Hall of Fame in 1994 and their Barton Hall Concert at Cornell University (May 8, 1977) was added to the Library of Congress's National Recording Registry. The Grateful Dead have sold more than 35 million albums worldwide.\n\nThe Grateful Dead's last lineup returned intact for In the Dark, an album that ironically thrust the band back into the spotlight on the strength of the band's lone Top 40 single, &quot;Touch of Grey.&quot; Fans had long mused that the Dead's studio albums lacked the easygoing energy and natural flow of their live performances, and In the Dark does come close to capturing that lightning in a bottle. Jerry Garcia, who apparently had to relearn the guitar after a near-fatal illness, approaches his instrument recharged, while his voice (a beneficiary of the extended hiatus?) shows some of its original smoothness. Of his four songwriting collaborations with long-standing lyricist Robert Hunter, &quot;Touch of Grey&quot; is far and away the best. &quot;When Push Comes to Shove&quot; and &quot;West L.A. Fadeaway&quot; use familiar blues-based riffs that lack the pair's often-contagious chemistry, and &quot;Black Muddy River&quot; has one foot firmly stuck in mawkish MOR terrain (although Garcia can be dealt a free pass here in light of the song's real-life implications as an attempt to make his peace with the world). What pushes In the Dark past the band's also-rans are two terrific songs from Bob Weir and John Barlow, the cheerfully cranky &quot;Hell in a Bucket&quot; (co-written with Brent Mydland) and the cautionary tale &quot;Throwing Stones.&quot; Rarely have Weir's songs sounded so effortless; punctuated by Garcia's guitar, they have more in common with the upbeat, flavorful sound of past Garcia/Hunter compositions than the pair's own work this time out (a rare case of role reversal). In the middle of it all is a country-rock song from Mydland, &quot;Tons of Steel,&quot; that sounds oddly out of place. Although the album is unmistakable as the work of the Dead, much of it recalls the punchy, pungent production of Dire Straits' recent work. It's not the second coming of the Dead, but a more entertaining epilogue you couldn't ask for.\n\nHDTracks PCM-24Bit-96Khz-FLAC.","torrent":{"xt":"urn:btih:5868f3b4ad8beb3610e2df91c8c3e1fc2c1c3437","amp;dn":"Grateful+Dead+-+In+The+Dark+%281987%29+2013+HDTracks+24-96-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5868f3b4ad8beb3610e2df91c8c3e1fc2c1c3437","infoHashBuffer":{"type":"Buffer","data":[88,104,243,180,173,139,235,54,16,226,223,145,200,195,225,252,44,28,52,55]},"announce":[],"urlList":[]}}