{"title":"Flashman at the Charge","uid":11289054,"size":108820538,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5c6100da24f632a7d344faaa41e4e63185b5ce63&amp;dn=Flashman+at+the+Charge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Pigman58","files":2,"time":1414301590,"description":"2 x 60 minutes\n\nGeorge Macdonald Fraser's Flashman novels are so well known that they hardly need any introduction. For those not familiar with them, Flashman was the school bully who mercilessly picked on the extremely wet Tom Brown, and was eventually expelled for drunkeness.\n\nIn Fraser's hands, Flashman metamorphoses into a drunken, womanising scoundrel, who joins the army and finds himself forever in the way of beautiful women and terrible dangers, which he always escapes from by dint of cowardice and sheltering behind others, with the result that he becomes lionised by public opinion as a great warrior of the Empire. (Apparently, these have never ben popular in the USA, where some people think they are genuine memoirs!)\n\nThe books are scrupulously historically researched, but lend themselves neither to the cinema (the Prisoner of Zenda knock off &quot;Royal Flash&quot;, the weakest of the early novels, was the only one filmed and quite frankly stinks) and this book, in which Flashman becomes involved unwillingly (as usual) in the Crimean War and the &quot;Great Game&quot;, the only one to be dramatised for radio.\n\nNaturally, the book is vastly better - seeder Gruntfuttock has uploaded an audio book version of the entire piece for those with more time - but this makes for an enjoyable couple of hours listening and hopefully entices others into the Flashman series","torrent":{"xt":"urn:btih:5c6100da24f632a7d344faaa41e4e63185b5ce63","amp;dn":"Flashman+at+the+Charge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c6100da24f632a7d344faaa41e4e63185b5ce63","infoHashBuffer":{"type":"Buffer","data":[92,97,0,218,36,246,50,167,211,68,250,170,65,228,230,49,133,181,206,99]},"announce":[],"urlList":[]}}