{"title":"Coast To Coast AM 11-04-2014 - Counterterrorism Training","uid":11382479,"size":54522257,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5f37f28349a45bad41ec00deb600ff8edbd67eff&amp;dn=Coast+To+Coast+AM+11-04-2014+-+Counterterrorism+Training&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Isaac09","files":-1,"time":1415228865,"description":"Counterterrorism Training\n\nDate:\t11-04-14\nHost:\tGeorge Noory\nGuests:\tMarcus Wynne, Howard Bloom\n\n\nAudio\nFormat                                   : MPEG Audio\nFormat version                           : Version 1\nFormat profile                           : Layer 3\nDuration                                 : 2h 32mn\nBit rate mode                            : Constant\nBit rate                                 : 48.0 Kbps\nChannel(s)                               : 1 channel\nSampling rate                            : 44.1 KHz\nCompression mode                         : Lossy\nStream size                              : 52.0 MiB (100%)\n\n\nWith 23 years of experience designing training for high-stress occupations, Marcus Wynne taught at the Federal Law Enforcement Training Center as well as law enforcement and military academies. He discussed how he uses research in cognitive neuroscience to create his counter terrorism and security training programs. &quot;What I do is I take a lot of the academic concepts,&quot; he said, &quot;and I translate that, through my experience, into something that the guys and gals on the line can use.&quot; He explained that by studying how the brain processes and learns information while under stress, better training techniques can be developed to help law enforcement and military personnel be prepared when they actually encounter such situations.\n\nIn tracing the origins of his work designing training programs, Wynne recalled joining the air marshal program following the downing of Pan Am Flight 103. During his training, Wynne was tasked with five hijacking scenarios and his team was the only group which passed all of the tests. Disgruntled supervisors insisted on learning how he passed the final two tests, because they were &quot;designed to be non-survivable,&quot; and requested that he teach their program. In turn, Wynne set about trying to decipher how exactly he was able to solve problems in violent situations and eventually came to the conclusion that superior performance can be attained by tapping into the psychological components at work in such high stress predicaments.\n\nRegarding modern terrorism and how to combat the threat of ISIS, Wynne dismissed the strategy of &quot;standing back and bombing&quot; because it does not address the nature of the terrorist group. To that end, he warned that the group's sophisticated use of social media allows it to both gain new recruits as well as manipulate emotions to psychologically prepare their fighters for battle. Therefore, Wynne suggested that usurping the social media platform fueling ISIS would be more effective than traditional warfare tactics to defeat the terrorist group. &quot;We'd be better off if we rounded up the top on hundred Youtube and Twitter people in the country,&quot; he mused, &quot;and sat them down with the top hackers in the country and just put them in a room and said 'you guys figure it out, go wage war.'&quot;\n\nMidterm Elections\nIn the first hour, author Howard Bloom shared his thoughts on the mid-term election results and what they might mean about the state of the country. He observed that &quot;midterm elections of this kind have traditionally flushed out the party of the president in charge&quot; and, thus, warned against reading too much into the results of Tuesday's vote. Beyond that, he lamented that the general population has been bombarded with negative and skewed narrative by both ends of the political spectrum as the Left repeatedly blames people for their deleterious effect on the environment while the Right continually promotes the concept of failed policies enacted by President Obama. Ultimately, Bloom mused that &quot;America is a nation in need of a dream&quot; to unify the country towards a common goal.\n\nNews segment guests: Peter Breggin &amp; Steve 'Dr. Sky' Kates\n\nWebsite(s):\n\nmarcuswynne.com\naccentusludus.com\nHowardBloom.net\nbigbangtango.net\n\nBook(s):\n\nThe Sword of Michael\nThe Genius of the Beast: A Radical Re-Vision of Capitalism\nThe Lucifer Principle: A Scientific Expedition into the Forces of History\nGlobal Brain: The Evolution of Mass Mind from the Big Bang to the 21st Century","torrent":{"xt":"urn:btih:5f37f28349a45bad41ec00deb600ff8edbd67eff","amp;dn":"Coast+To+Coast+AM+11-04-2014+-+Counterterrorism+Training","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f37f28349a45bad41ec00deb600ff8edbd67eff","infoHashBuffer":{"type":"Buffer","data":[95,55,242,131,73,164,91,173,65,236,0,222,182,0,255,142,219,214,126,255]},"announce":[],"urlList":[]}}