{"title":"Pokemon Banned/Unaired Episodes","uid":11617195,"size":1793798467,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:643d888eb9b442bfed89749fd0b5b949c967b198&amp;dn=Pokemon+Banned%2FUnaired+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1417502887,"description":"Reasons for banning/skipping:\n\nSeason 1: Ep 18- James uses inflatable breasts and both Jesse and James make fun of Misty because she has the smallest sized breasts.\n\nSeason 1: EP 35- The use of firearms was the main reason for banning this episode. Kaiser the warden of the Safari Zone, aims his gun at Ash &amp; company and shoots at Jesse, James and Meowth. When Kaiser is captured Jesse and James hold guns up to his face threatening him. Jesse also tries to seduce him and Meowth wears a Hitler mustache. \n\nSeason 1: Ep 38- One major scene towards the end gave kids seizures. All thanks to the use of flashing bright lights. Goes without saying that there is a seizure warning on this one. The seizure scene &amp; episode in general aren't worth risking your health if you have a history of epilepsy or are prone to seizures.\n\nSeason 5: Ep 41- Brock comes down with symptoms similar to SARS.\n\nSeason 8: Ep 09- This is only a preview. This never aired anywhere. Reason being because of the earthquakes that happened in this episode. \n\nSeason 8: Ep 29- This is just a recap episode and I guess whoever was in charge of distributing these episodes didn't feel that Westerners wanted to see what previously happened earlier in the season. \n\nSeason 10: Ep 48- This was another recap episode. The episode is all in Japanese with no subtitles because I could not find a sub group that bothered subbing an unaired recap episode. Sorry.\n\nSeason 12: Ep 16- Another recap episode. \n\nSeason 14: Eps 23 &amp; 24 were skipped and never re-aired even though promised. The reason being, too much explosions of buildings within the city that resemble earthquakes &amp; terrorist attacks. I provided the preview however","torrent":{"xt":"urn:btih:643d888eb9b442bfed89749fd0b5b949c967b198","amp;dn":"Pokemon+Banned%2FUnaired+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"643d888eb9b442bfed89749fd0b5b949c967b198","infoHashBuffer":{"type":"Buffer","data":[100,61,136,142,185,180,66,191,237,137,116,159,208,181,185,73,201,103,177,152]},"announce":[],"urlList":[]}}