{"title":"Kay Kenyon -  Bright of the Sky (Entire and the Rose #1)","uid":11634890,"size":519838578,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:69998402267ee1ef45cd63f6a72d540957f9373f&amp;dn=Kay+Kenyon+-++Bright+of+the+Sky+%28Entire+and+the+Rose+%231%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Cybotage","files":3,"time":1417720627,"description":"Kay Kenyon -  Bright of the Sky (Entire and the Rose #1) \n\nRead by Christian Rummel\n\nKay Kenyon, noted for her science fiction world-building, has in this new series created her most vivid and compelling society, the Universe Entire. In a land-locked galaxy that tunnels through our own, the Entire is a bizarre and seductive mix of long-lived quasi-human and alien beings gathered under a sky of fire, called the bright. A land of wonders, the Entire is sustained by monumental storm walls and an exotic, never-ending river. Over all, the elegant and cruel Tarig rule supreme. Into this rich milieu is thrust Titus Quinn, former star pilot, bereft of his beloved wife and daughter who are assumed dead by everyone on earth except Quinn. Believing them trapped in a parallel universe - one where he himself may have been imprisoned - he returns to the Entire without resources, language, or his memories of that former life. He is assisted by Anzi, a woman of the Chalin people, a Chinese culture copied from our own universe and transformed by the kingdom of the bright. Learning of his daughter's dreadful slavery, Quinn swears to free her. To do so, he must cross the unimaginable distances of the Entire in disguise, for the Tarig are lying in wait for him. As Quinn's memories return, he discovers why. Quinn's goal is to penetrate the exotic culture of the Entire - to the heart of Tarig power, the fabulous city of the Ascendancy, to steal the key to his family's redemption. But will his daughter and wife welcome rescue? Ten years of brutality have forced compromises on everyone. What Quinn will learn to his dismay is what his own choices were, long ago, in the Universe Entire. He will also discover why a fearful multiverse destiny is converging on him and what he must sacrifice to oppose the coming storm. This is high-concept science fiction written on the scale of Philip Jose Farmer's Riverworld, Roger Zelazny's Amber Chronicles, and Dan Dimmons' Hyperion","torrent":{"xt":"urn:btih:69998402267ee1ef45cd63f6a72d540957f9373f","amp;dn":"Kay+Kenyon+-++Bright+of+the+Sky+%28Entire+and+the+Rose+%231%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69998402267ee1ef45cd63f6a72d540957f9373f","infoHashBuffer":{"type":"Buffer","data":[105,153,132,2,38,126,225,239,69,205,99,246,167,45,84,9,87,249,55,63]},"announce":[],"urlList":[]}}