{"title":"Paper Moon: Original Recordings Featured In The Soundtrack","uid":11353977,"size":101282139,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6ae2ae234268aef322de9402788bf53464b774c3&amp;dn=Paper+Moon%3A+Original+Recordings+Featured+In+The+Soundtrack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"UrbanCoyote","files":-1,"time":1414924043,"description":"This release of the music of Paper Moon was encoded at 256Kbps from a YouTube MP4 download using Adobe Premiere. Until a better version becomes available we can all enjoy this. The original record was released in 1973, but the original recordings come from the 20's/30's. Considering the sources, the nature of the sound is not only decent but valuable in a historical sense.\nThe (originally single-track 33rpm vinyl rip) soundtrack was broken into 15 individual tracks and metadata was added via iTunes, including album art.\n\nMore information here:\n\nThanks to YouTube user ThoughtTraveler for the original upload, and for providing us with the following description:\n\n&quot;\nThe 33 LP recording of the official soundtrack of Paper Moon was issued at the time of the movie's initial release in 1973. It quickly went out of print however as the film and the movie music did not quite strike a nerve with the contemporary public.\n\nSince its release in 1973 the film and the soundtrack have both taken on a Cult following. In the late 70s, 80s and early 90s it was often shown on Sunday afternoon local TV stations and Late night movie broadcasts. Now its taken on new life in DVD land.\n\nThe hard to find original vinyl record was cherished by those lucky enough to still have an original copy - and a working turntable.\n\nNo more. Now YOU can enjoy the music without having to pay $130 to some ebay creep.\n\nI hope listening to this brings back some memories and brightens your day.\n\nThe year is 1936. Orphaned Addie Loggins (Tatum O'Neal, in her film debut) is left in the care of unethical travelling Bible salesman Moses Pray (Ryan O'Neal, Tatum's dad), who may or may not be her father. En route to Addie's relatives, Moses learns that the 9-year-old is quite a handful: she smokes, cusses, and is almost as devious and manipulative as he is. They join forces as swindlers, working together so well that Addie is averse to breaking up the team -- which is one reason that she sabotages the romance between Moses and good-time gal Trixie Delight (Madeline Kahn). Later, while attempting to square a $200 debt that Addie claims he owes her, Moses runs afoul of of a bootlegger (John Hillerman) and is nearly beaten to death by the criminal's twin-brother sheriff. Painfully pulling himself together, Moses gets Addie to her relatives, whereupon she adamantly refuses to leave his side. Photographed in black-and-white by Laszlo Kovacs, the film was made largely on location in Kansas and Missouri (an experience colorfully recalled by director Peter Bogdanovich in his 1972 book of essays Pieces of Time). 9-year-old Tatum O'Neal won a Best Supporting Actress Oscar, beating out costar Kahn. Paper Moon later became a short-lived TV series, starring Ryan O'Neal lookalike Christopher Connelly and future Oscar winner Jodie Foster.\n\nFAIR USE (17 U.S.C. Â§ 107) is a limitation and exception to the exclusive right granted by copyright law to the author of a creative work. In United States copyright law, fair use is a doctrine that permits limited use of copyrighted material without acquiring permission from the rights holders. Examples of fair use include commentary, search engines, criticism, news reporting, research, teaching, library archiving and scholarship. It provides for the legal, unlicensed citation or incorporation of copyrighted material in another author's work under a four-factor balancing test.\n\nDISCLAIMER: The songs on this soundtrack were originally recorded anywhere from between 1926-1936 so the sound quality and volume differ amongst the tracks. They did not have Dolby magnetic tape back in the day - please bear that in mind when listening.\n&quot;\n\nTrack List:\n1 It's Only a Paper Moon\n2 About a Quarter to Nine\n3 (It Will Have to Do) Until the Real Thing Comes Along\n4 Flirtation Walk\n5 Just One More Chance\n6 One Hour with You\n7 I Found a Million Dollar Baby (in a Five and Ten Cent Store)\n8 The Object of My Affection\n9 Georgia on My Mind\n10 A Picture of Me Without You\n11 The Banks of the Ohio\n12 My Mary\n13 After You've Gone\n14 Let's Have Another Cup of Coffee\n15 Sunnyside Up\n\nEnjoy","torrent":{"xt":"urn:btih:6ae2ae234268aef322de9402788bf53464b774c3","amp;dn":"Paper+Moon%3A+Original+Recordings+Featured+In+The+Soundtrack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ae2ae234268aef322de9402788bf53464b774c3","infoHashBuffer":{"type":"Buffer","data":[106,226,174,35,66,104,174,243,34,222,148,2,120,139,245,52,100,183,116,195]},"announce":[],"urlList":[]}}