{"title":"Back in Shape with Neil Summers DVDRip x264 aac [MP4]","uid":12429599,"size":994710979,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6b0a8fb6ebf430bad817bf8576c1a21d70ad968a&amp;dn=Back+in+Shape+with+Neil+Summers+DVDRip+x264+aac+%5BMP4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"elessedilgirl","files":1,"time":1442437273,"description":"Neil Summers, The World Famous Back Coach, And Inventor Of The World Renowned Back Stretcher.\n\nThis DVD is designed to give you the best results with the least effort - All I'm asking you to do are 7 exercises a day for less than one minute each, and then pause the DVD for the next day. The key is to do these few exercises daily, rather than do the whole DVD once a week. The DVD is coded by day and by colour to make it easier for you to follow.\n\nOver the course of the next hour, there are 49 stretches that help to reduce muscle tension, correct posture, and strengthen your spine and stomach.\n\nEach day we spend much of our time bending, stooping, and slouching, so that by the time we go to bed, we're about an inch shorter than when we woke up. If you follow these simple exercises, for under 7 minutes a day, not only will you cure any backache you have been suffering over the months and years, you will prevent any new pains from taking effect. So, how does this DVD do that? Well, by taking the weight off your spine.\n\nUniquely in this DVD, all the exercises are carried out on the floor, taking the weight off your spine instantly. If you can reverse the trend of a lifetime and take the weight off your back using 7 simple stretches once a day, everyday, then, I believe you will witness the rebirth of your spine. You will look younger, fitter, healthier.\n\nYou will be truly Back In Shape.\n\n51 min\n\nVideo; x264; 720*568 (4:3); 2437 kbps; 25.000 fps\nAudio; aac; 160 kbps; 2 ch; 48.0 Khz","torrent":{"xt":"urn:btih:6b0a8fb6ebf430bad817bf8576c1a21d70ad968a","amp;dn":"Back+in+Shape+with+Neil+Summers+DVDRip+x264+aac+%5BMP4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b0a8fb6ebf430bad817bf8576c1a21d70ad968a","infoHashBuffer":{"type":"Buffer","data":[107,10,143,182,235,244,48,186,216,23,191,133,118,193,162,29,112,173,150,138]},"announce":[],"urlList":[]}}