{"title":"Religion without God (2013) {=IMPAVIDUS=}","uid":11257944,"size":862536,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d5af8984720c331c0dc746c1fa6b6220c6208b1&amp;dn=Religion+without+God+%282013%29+%7B%3DIMPAVIDUS%3D%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sunghabib","files":-1,"time":1413925726,"description":"Book Description:\n\nIn his last book, Ronald Dworkin addresses questions that men and women have asked through the ages: What is religion and what is God's place in it? What is death and what is immortality? Based on the 2011 Einstein Lectures, Religion without God is inspired by remarks Einstein made that if religion consists of awe toward mysteries which &quot;manifest themselves in the highest wisdom and the most radiant beauty, and which our dull faculties can comprehend only in the most primitive forms,&quot; then, he, Einstein, was a religious person.\n\nDworkin joins Einstein's sense of cosmic mystery and beauty to the claim that value is objective, independent of mind, and immanent in the world. He rejects the metaphysics of naturalism--that nothing is real except what can be studied by the natural sciences. Belief in God is one manifestation of this deeper worldview, but not the only one. The conviction that God underwrites value presupposes a prior commitment to the independent reality of that value--a commitment that is available to nonbelievers as well. So theists share a commitment with some atheists that is more fundamental than what divides them. Freedom of religion should flow not from a respect for belief in God but from the right to ethical independence.\n\nDworkin hoped that this short book would contribute to rational conversation and the softening of religious fear and hatred. Religion without God is the work of a humanist who recognized both the possibilities and limitations of humanity.\n\nProduct Details:\n\nPDF: 193 pages\nPublisher: Harvard University Press; 1 edition (September 16, 2013)\nLanguage: English\nISBN-10: 0674726820\nISBN-13: 978-0674726826\nAmazon Link:\n\n\n\n------------------------------------------------\nSeed - Share - Enjoy - Give me Thumbs Up","torrent":{"xt":"urn:btih:6d5af8984720c331c0dc746c1fa6b6220c6208b1","amp;dn":"Religion+without+God+%282013%29+%7B%3DIMPAVIDUS%3D%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d5af8984720c331c0dc746c1fa6b6220c6208b1","infoHashBuffer":{"type":"Buffer","data":[109,90,248,152,71,32,195,49,192,220,116,108,31,166,182,34,12,98,8,177]},"announce":[],"urlList":[]}}