{"title":"Star Wars: Renacimiento [Spanish w/ Hard English Subs]","uid":11272574,"size":194435078,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:6fd84dd6c4dc22da9fce4b646246aaee12c95299&amp;dn=Star+Wars%3A+Renacimiento+%5BSpanish+w%2F+Hard+English+Subs%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"74310","files":1,"time":1414099893,"description":"Renacimiento\t(2008),\t480x360,\t0:17:44\n\n_SPANISH W/ HARD ENGLISH SUBS_\n\n\nThe Galaxy is tainted. The Republic, as ancient as myth, and as vast as the stars, is coming to an end. Slowly, and supported without noticing by naive and ignorant politicians, a New Order has been installed, where freedom and tolerance, pillars of the previous government, no longer fits. And where the guardians of those pillars have been turned into renegades: the legendary Order of the Jedi Knights, warriors of peace and the Force, is prosecuted for crimes of treason and exterminated with no mercy across all the civilized systems of the galaxy. In the middle of the carnage, anonymous heroes try to restore the glory of old days; Jedi Knights without a destiny fighting to retrieve their honor and freedom. The Renaissance Group: last remmant of a millenarian brotherhood. While the exhausted group of fugitives, guided by a young mercenary and a brave astrodroid, is searching a shelter before the final battle, a threat is growing over them. Not from darkness, but from light itself. A Jedi Knight, who will take his loyalty to the Chancellor to the extreme, an old friend and brother, has come to punish those who betrayed that that is the only great truth to his eyes for a Jedi: to protect and guard the Republic at all cost. The Light Side of the Force is divided between justice and duty, while a lone man will defend the last blossom of hope with his life, in a universe that will never be the same","torrent":{"xt":"urn:btih:6fd84dd6c4dc22da9fce4b646246aaee12c95299","amp;dn":"Star+Wars%3A+Renacimiento+%5BSpanish+w%2F+Hard+English+Subs%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fd84dd6c4dc22da9fce4b646246aaee12c95299","infoHashBuffer":{"type":"Buffer","data":[111,216,77,214,196,220,34,218,159,206,75,100,98,70,170,238,18,201,82,153]},"announce":[],"urlList":[]}}