{"title":"Classic Film Scores for Bette Davis","uid":11498993,"size":228412016,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7098487be9cccf290c9cca1cec45471b03d45b1d&amp;dn=Classic+Film+Scores+for+Bette+Davis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"metro369","files":13,"time":1416318695,"description":"This is one of several albums in the RCA-BMG Classic Film Scores series that were hooked around stars and their screen personae, rather than grouped around the work of a particular composer. As Bette Davis' prime years were spent at Warner Bros., Max Steiner was closely involved with virtually all of her important films, and he is the principal composer represented here, with some additional contributions from Erich Wolfgang Korngold and Franz Waxman. In keeping with its focus, this collection is mostly comprised of brief excerpts, as the material at hand emphasizes memorable themes rather than larger, sweeping musical arcs -- Dark Victory is an exception, represented with over six minutes of music filled with an enveloping 19th century romanticism; All This and Heaven Too is, similarly, proportioned and overpowering next to the surrounding pieces. Perhaps the most startling moment on this CD, however, is one of the shorter pieces, the excerpt from A Stolen Life; Steiner often stole from himself, but the main title theme here was used virtually note-for-note by him as the &quot;Pine Island Theme&quot; from A Summer Place 15 years later. Korngold fans may well wish to skip this disc, rather than bother about the less than two minutes of his score for The Private Lives of Elizabeth and Essex included here. The playing is impeccable and the sound has held up reasonably well, though this CD could use a fresh remastering to bring out the playing in the quieter passages. And the annotation by Tony Thomas still holds up three decades later","torrent":{"xt":"urn:btih:7098487be9cccf290c9cca1cec45471b03d45b1d","amp;dn":"Classic+Film+Scores+for+Bette+Davis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7098487be9cccf290c9cca1cec45471b03d45b1d","infoHashBuffer":{"type":"Buffer","data":[112,152,72,123,233,204,207,41,12,156,202,28,236,69,71,27,3,212,91,29]},"announce":[],"urlList":[]}}