{"title":"RPG Asdivine Hearts v1.1.1g Android","uid":11440875,"size":39886625,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:7925ae63be948550bc12dba664fbdc108ba0d479&amp;dn=RPG+Asdivine+Hearts+v1.1.1g+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":".BONE.","files":-1,"time":1415805969,"description":"RPG Asdivine Hearts v1.1.1g\nRequirements: 2.2+\nOverview: Beautiful hand-drawn visuals and a story of epic proportions bring Asdivine Hearts to the forefront of smartphone gaming! Travel alongside four companions and a cat in the adventure of a lifetime and one that transcends even the world in this latest fantasy RPG!\n\nImage\n\nStory\nOne year prior, the world of Asdivine was enveloped by a brilliant flash of light. Since that time, the influence of shadow has only continued to grow ever more powerful across the face of the land. And though the event itself was undoubtedly connected with the heavens, few people seem to have realized the far-reaching implications of what transpired.\nNow turning to the present, a surprising revelation awaits a young man by the name of Zack and his childhood friend, Stella, in the capital from a chubby cat claiming to be none other than the Light Deity and declaring the world to be on the verge of a great collapse.\nAlthough skeptical at first, this band of unlikely adventurers soon finds this chance encounter to be only the beginning of an adventure set to not only change their lives, but their fates, as well.\n\nGroundbreaking Visual Quality\nUsing the latest in visual expression capabilities for smartphones, the world of Asdivine has been rendered with stunning detail.\nFrom meandering clouds to lapping waves, sparkling magic to slithering creatures, and even dynamic skill effects, Asdivine Hearts breaks new ground in 2D turn-based RPGs!\n\nLimitless Play and Loads of Content\nBy taking puzzle piece-like jewels and setting them in a box known as a &quot;rubix,&quot; players are able to customize characters in ways like never before! From having lighting-fast reflexes to berserker status, it is all possible with the power of a rubix!\nMoreover, with plenty of subquests and rare items to go around, there is never a reason to find yourself without something to do! And with a battle arena, treasure to dig for, and an enemy guide to collect information for, there is always something to do for even the most casual and hardcore gamers. So how far can you level and how many millions of damage can you dish out?\nAll these challenges await you and more!\n*This game features some in-app-purchase content. While in-app-purchase content requires additional fees, it is not necessary for finishing the game.\n*The actual price might differ depending on the region.\n[Supported OS]\n- 2.2 to 4.4\n[Supported Screens]\n- WVGA(320x480) and up\n[Xperia(TM) PLAY]\n- Optimized\n[SD Card Storage]\n- Enabled\n[Languages]\n- English, Japanese\n[Non-Supported Devices]\nThis app has generally been tested to work on any mobile device released in Japan. We cannot guarantee support on other devices.\n\nThis app has NO advertisements","torrent":{"xt":"urn:btih:7925ae63be948550bc12dba664fbdc108ba0d479","amp;dn":"RPG+Asdivine+Hearts+v1.1.1g+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7925ae63be948550bc12dba664fbdc108ba0d479","infoHashBuffer":{"type":"Buffer","data":[121,37,174,99,190,148,133,80,188,18,219,166,100,251,220,16,139,160,212,121]},"announce":[],"urlList":[]}}