{"title":"XenoBot (XenoSuite) Patcher - All versions - [0x22]","uid":11444718,"size":28407296,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:79dcc87a57ea8e532edb27684bcc9d98cfa9d612&amp;dn=XenoBot+%28XenoSuite%29+Patcher+-+All+versions+-+%5B0x22%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"arMa","files":1,"time":1415841174,"description":"INSTRUCTIONS:\n1) Place XenoPatcher.exe in the same directory as XenoBot.exe\n2) Open XenoPatcher as administrator and click patch\n3) Open XenoBot.exe, should be ready to use.\n\nPlease leave some feedback in the comment field.\nThanks.\n\nA botting revolution.\n\nXenoBot is a fully-responsive and optimal client modification for Tibia, featuring an arsenal of advanced tools. The software, which is user-friendly, efficient, flexible and highly secure, works flawlessly on Windows operating systems and does not produce lag.\n\n\nFeatures\nCavebot\n\nThe cavebot can quickly advance your stats with its many advanced features: evasive stances, target prioritization, scriptability, a supply refiller, and a loot depositor.\nTools\n\nXenoBot provides many advanced tools such as informative xray, full light hack, a mana bar, anti-idle, automatic mount, creature information, a food eater, and much more!\nScripter\n\nThe scripter provides a plethora of useful functions which users of all skill levels can easily utilize in order to expand and customize XenoBot.\nSupport\n\nXenoBot, with the help of its support feature, will refill your ammunition, heal your character, and train your magic level. It can also cure burning, electrification, curse, bleeding, paralyze, and poison, while holding persistence on haste, recovery and invisible.\nHeads Up Display\n\nWith ease, the HUD can chart important information such as recent loot, kill counters, spell timers, magic wall timers, damage totals, experience statistics, and vital percentages.\nPROFIT ???\n\nXenoBot, with the features mentioned here (and countless others: combo bot, summon indentification, trade helper, etc), will always help you PROFIT","torrent":{"xt":"urn:btih:79dcc87a57ea8e532edb27684bcc9d98cfa9d612","amp;dn":"XenoBot+%28XenoSuite%29+Patcher+-+All+versions+-+%5B0x22%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79dcc87a57ea8e532edb27684bcc9d98cfa9d612","infoHashBuffer":{"type":"Buffer","data":[121,220,200,122,87,234,142,83,46,219,39,104,75,204,157,152,207,169,214,18]},"announce":[],"urlList":[]}}