{"title":"Mineral Trioxide Aggregate - Properties and Clinical Application","uid":11628247,"size":17689779,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7a703b2bdf1cc637ba22e7f40bce795e2127f3b0&amp;dn=Mineral+Trioxide+Aggregate+-+Properties+and+Clinical+Application&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cawihizilifa","files":1,"time":1417648895,"description":"Mineral trioxide aggregate (MTA) was developed more than 20 years ago to seal the pathways of communication of the root canal system. It's currently the preferred material used by endodontists because of its superior properties such as its seal and biocompatibility that significantly improves outcomes of endodontic treatments. Dr. Torabinejad, who was the principle investigator of the dental applications of MTA, and leading authorities on this subject provide a clinically focused reference detailing the properties and uses of MTA, including vital pulp therapy (pulp capping, pulpotomy), apexification, pulp regeneration, repair of root perforations, root end filling and root canal filling. Line illustrations and clinical photographs show proper technique. An accompanying website features photographs and video presentations for selected procedures using MTA. Mineral Trioxide Aggregate: Properties and Clinical Applications is an ideal book for dental students and endodontic residents learning procedures for the first time as well as practicing dentists and endodontists who would like to improve outcomes of endodontic treatments","torrent":{"xt":"urn:btih:7a703b2bdf1cc637ba22e7f40bce795e2127f3b0","amp;dn":"Mineral+Trioxide+Aggregate+-+Properties+and+Clinical+Application","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a703b2bdf1cc637ba22e7f40bce795e2127f3b0","infoHashBuffer":{"type":"Buffer","data":[122,112,59,43,223,28,198,55,186,34,231,244,11,206,121,94,33,39,243,176]},"announce":[],"urlList":[]}}