{"title":"Atom and His Package - Discography (1997-2004) [FLAC]","uid":11528748,"size":1776068696,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7f2a540659f7717778fce0f777b38034ee048bc0&amp;dn=Atom+and+His+Package+-+Discography+%281997-2004%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"politux","files":-1,"time":1416546668,"description":"\n  Atom and His Package - Discography (1997-2004) [FLAC]\n\n  Genre: Rock\n  Style: Indie\n  Source: CD \n  Codec: FLAC\n  Bit rate: ~ 1,000 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  Albums\n\n  1997 A Society of People Named Elihu \n  1997 Atom and His Package\n  2001 Redefining Music\n  2003 Attention! Blah Blah Blah\n\n  EPs\n\n  2000 Going to Ames: A Tribute to the Mountain Goats\n  2002 Hamburgers\n\n  Anthology \n\n  1999 Making Love\n\n  Live \n\n  2004 Hair: Debatable \n\n  Pennsylvania-native punk pioneer Adam Goren is one of the most unconventional musicians of his time. Armed with only his &quot;package,&quot; the creative musician is known for his hilarious, playful synth pop punk songs and outrageous rhymes about unconventional topics. Adam Goren, as his alter ego persona Atom, writes, performs, and records all of the music himself with a QY700 Music Sequencer, an RM1X music sequencer, and a B.C. Rich guitar.\n\n  The musical one-man and machine outfit Atom and His Package was created after Goren's punk band Fracture broke up in 1995. Chock-full of creative ingenuity, Atom's song repertoire includes a sweet pop ode to Irish songstress Enya, &quot;Pumping Iron for Enya,&quot; the rebellious &quot;Punk Rock Academy,&quot; and the raucous &quot;If You Own the Washington Redskins, You're a Cock.&quot; Atom and His Package have toured internationally, including numerous treks across the entire U.S.A., Canada, Japan, the U.K., Netherlands, Belgium, Germany, Austria, and Israel.\n\n  In 1997, Atom and His Package released their first album, The First CD, on No Idea Records. Other releases include A Society of People Named Elihu (October 1997, Mountain Records), Making Love (June 1999, No Idea Records), Fracture (November 1999, No Idea Records), and Shopping Spree (EP) (February 2001, Sub City Records). Redefining Music appeared in spring 2001 as well. The EP Hamburgers was issued in mid-2002 before Atom returned with the full-length Attention, Blah Blah Blah early the next year. Goren's last live show was then documented on 2004's CD/DVD Hair: Debatable. In addition to playing and writing songs, Atom organizes the tours, manages publicity and promotions, and runs his record label, File-13 Records. You can find &quot;My Child is an Honor Student at the Punk Rock Academy&quot; bumper stickers and &quot;Go metric. Now.&quot; T-shirts and other &quot;Junk for Sale&quot; on the Atom and His Package website, www.atomandhispackage.com","torrent":{"xt":"urn:btih:7f2a540659f7717778fce0f777b38034ee048bc0","amp;dn":"Atom+and+His+Package+-+Discography+%281997-2004%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f2a540659f7717778fce0f777b38034ee048bc0","infoHashBuffer":{"type":"Buffer","data":[127,42,84,6,89,247,113,119,120,252,224,247,119,179,128,52,238,4,139,192]},"announce":[],"urlList":[]}}