{"title":"QuarkXPress 2015 11.1.0","uid":12419273,"size":424687451,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:810a074cb5770dd8abe41c6fe2d387876fac3c32&amp;dn=QuarkXPress+2015+11.1.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"radim161","files":2,"time":1442274410,"description":"Name: QuarkXPress\nVersion: 11.1\nMac Platform: Intel\nIncludes: KG\nOS version: 10.8.5\nProcessor type(s) &amp; speed: Intel 64-bit\nRAM minimum: 2GB\nVideo RAM: N/A\nActivation:\nUse the included Keygen (Courtesy of C.O.R.E.)\nWhat's new in this update (SEP 2015):\nQuark Color Manager is enhanced to resolve issues with Black Point Compensation\nFootnote Styles: You can now specify space before and after for Footnotes text and Separator\nFootnotes: You can insert Footnotes/Endnotes in anchored boxes, including nested anchored boxes\nApp Studio: Introduces support for Output Styles allowing 2x or 3x image bundles for Retina/HiDPI devices\nApp Studio/HTML5 interactivity: Enhanced button interactivity in page stacks.\nApp Studio/HTML5 interactivity: Options to disable slideshow indicators and video play button\nContent Variables: Flow box page numbers are now available in Content Variables palette\nContent Variables: Running Headers enhanced to support first and last occurrence on page and spread\nFind/Change: Supports Content Variables, Footnotes and Convert to Graphic\nSearch in Palettes: Now also available in Item Styles, Books and Callout Styles\nReflow ePub: Allows style sheet mapping for Reflow ePub export\nQuarkXPress is powerful layout software with an intuitive, versatile interface that lets you combine writing, editing, and typography with color and pictures to produce dynamic final output. QuarkXPress is widely used by magazines, newspapers, advertising agencies, typesetters, printers, corporate publishers, design firms, catalog houses, book publishers, and form designers. It is also used by businesses with publishing requirements. QuarkXPress is a powerful and full-featured tool that makes it easy to develop your ideas into gorgeous layouts. QuarkXPress provides an arsenal of design tools that let you turn even the most elaborate visions into reality.\nMore details: http://www.quark.com/Products/QuarkXPress/","torrent":{"xt":"urn:btih:810a074cb5770dd8abe41c6fe2d387876fac3c32","amp;dn":"QuarkXPress+2015+11.1.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"810a074cb5770dd8abe41c6fe2d387876fac3c32","infoHashBuffer":{"type":"Buffer","data":[129,10,7,76,181,119,13,216,171,228,28,111,226,211,135,135,111,172,60,50]},"announce":[],"urlList":[]}}