{"title":"Winx Club - The Mystery of The Abyss Trial-Audio (2014) 1080p","uid":11381759,"size":2743094442,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:8749af16fdde75af13e3a20637abd6763c4860e6&amp;dn=Winx+Club+-+The+Mystery+of+The+Abyss+Trial-Audio+%282014%29+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CronosT","files":-1,"time":1415222410,"description":"The Winx Club is struggling with a terrible mystery that will make your heart beat faster!\n\nThe archenemies of the Winx Club, the Trix witches, team up with the evil nymph Politea and find out that, to defeat the fairies once and for all and become invincible, it takes very little: a Pearl hidden in the Deep of the Infinite Ocean! As small as powerful, the Pearl of the Depth gives enormous powers to those who possess it!\n\nThe team of the Dark Magic: Trix, Politea and Tritannus, not bad as group... almost unbeatable! But none of them have come to terms with the true power of the Winx, the power of Love: Bloom is more determined than ever to win the magic Pearl before her enemies and save prince Sky captured by the Trix and imprisoned in the Ocean.\n\nFor the Winx there is not a minute to waste: how will they stop the plans of their enemies before it's too late?\n\nThe answer is not simple: with a twist, Politea is preparing to seize power all to herself, betraying allies and polluting the Oceans to regain strength and power.\n\nGet ready: the most dangerous mission of the Winx is about to begin!","torrent":{"xt":"urn:btih:8749af16fdde75af13e3a20637abd6763c4860e6","amp;dn":"Winx+Club+-+The+Mystery+of+The+Abyss+Trial-Audio+%282014%29+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8749af16fdde75af13e3a20637abd6763c4860e6","infoHashBuffer":{"type":"Buffer","data":[135,73,175,22,253,222,117,175,19,227,162,6,55,171,214,118,60,72,96,230]},"announce":[],"urlList":[]}}