{"title":"POtHS - Secret History of the Islamic Revival","uid":11598131,"size":12077499245,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:96eef02e0c38c7401fbcfd18f1076ade5881b6dd&amp;dn=POtHS+-+Secret+History+of+the+Islamic+Revival&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"POtHS11","files":183,"time":1417310680,"description":"\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Secret History of the Islamic Revival\n\n\n\n\nDescription\n\nThe Islamic Plan to Destroy America from Within:\nBrigitte Gabriel, a survivor of Islamic terror, who lost her native country of Lebanon to the hegemony of radical Islam and vows to make sure her adopted country of America never falls to the same fate.  There are few people who know more about the religion of Islam, its aims, its direction and its intended goals than Brigitte Gabriel. Seeing the religion of Islam firsthand, in the crunch, and I speak of the Lebanese War, Brigitte learned the hard way as to what this religion actually is.\n\nThis lady addresses possibly more governmental leaders and heads of state regarding this problem of Islam than anyone else.  You need to know and understand the threat to our nation and the entire world - possibly the greatest ever faced.\n------------------------------------------------------------------------\n\nWhy We Are Afraid, A 1400 Year Secret:\nWhat we never learn in history class: the REAL history as it happened. A history of Muslim theft, looting, slavery, brutality and savagery so extreme that it destroyed the entire classical civilization and all its accomplishments.  Dr Bill Warner has put together the timeline of events after meticulous study.\n\nLearn the true history of Islam in Europe and how it effects us to this day. This is a history based on numbers and facts concealed from most history books and explains why we may be afraid to see Islam for what it is based on its own doctrine and practice.\n &lt;a href=&quot;\nhttp://themuslimissue.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://themuslimissue.com&lt;/a&gt; &lt;a href=&quot;\nhttp://www.politicalislam.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.politicalislam.com&lt;/a&gt;\nFor a version in other languages with English Subtitles: http://www.mrctv.org/videos/bill-warner-islam-1400-years-fear-english-titles\n------------------------------------------------------------------------\n\nAtomic Jihad - Islamic Revival and Obama's Politics of Defeat 2010:\nSince its Islamic Revolution of 1979, Iran has been the undisputed leader of Islamism, the worldwide movement for Islamic revival. Islamism seeks to resurrect Muslim society from 300 years of decline by returning to its historic formula for success: Islamic law and government over Muslim lands. Iranian President Mahmoud Ahmadinejad has carefully laid out the Islamist view of the world for several years. He depicts a morally superior Muslim society based on Islamic concepts of justice, equality, and human dignity, while proclaiming America selfish, corrupt, hypocritical, and oppressive. Islamist animosity toward America also focuses on U.S. alliances with autocratic regimes in the Muslim world like Egypt, Jordan and Saudi Arabia as well as American support for Israel, &quot;the illegitimate offspring of the Great Satan.&quot;\n\n... &quot;Marg-bar Amreeka (Death to America)!&quot; Atomic Jihad leaves little doubt that Iran is in the final stages of preparing a Coming War for Islamic Revival. Meanwhile, by seeking to appease Ahmadinejad with &quot;change&quot; in U.S. Middle East policy, President Obama is ushering in the Politics of Defeat for America. If successful in its nuclear program, Iran and its allies will finally possess the means to achieve their ultimate goals - the defeat of America and the return of Islam to past glory.\n\nDirected and Written by: Joel Gilbert\nRunning Time: 95 Minutes\nA Highway 61 Entertainment Production\nUSA Release Date: Feb. 23, 2010\nUK Release Date: April 4, 2010\n-----------------------------------------------------------------------\n\nISIS / ISIL Becomes A Biological Chemical Global threat, 7-26-14:\nBreaking News in the Middle East terrorist organization, ISIS, who have now siezed and control both nuclear and biological weapons in Iraq.\n\nThe seizure of Saddam-era chemical weapon stockpiles by the Islamic State of Iraq and Syria (ISIS) not only will have dangerous implications for the security situation in Iraq, but also enflame an already combustible situation in neighboring Syria and the rest of the Middle East, especially Israel.  Additionally, this may easily spread to uncompass a threat to any nation across the planet, including the United States, from dirty (nuclear) bomds to catastrophic biological contanimation.\n\nWill Iraq fall into the hands of jihadists? Did USA forces die in vain and the thousands injured for nothing and lose billions of dollars in military equipment being taken to Syria? Will the ISIS terrorist group create an Islamic caliphate? Then what? Will Obama protect USA civilians, the Government &amp; military personnel?\n------------------------------------------------------------------------\n\nJerusalem Dateline Crisis In Iraq - June 20, 2014:\nThe week on Jerusalem Dateline: Chris Mitchell comes to you from Iraqi Kurdistan. Just a few miles away a radical Muslim army (ISIS - you know the name of the Egytian god) is taking more ground each day. In Erbil, waves of refugees seek protection while Christians in the region fear the worst.\n------------------------------------------------------------------------\n\nThe Watchman - Jihadists on the March:\nJuly 8, 2014; On this week's edition of The Watchman, we sit down with Middle East experts Raymond Ibrahim and Tawfik Hamid to discuss the latest developments with the Muslim Brotherhood, ISIS, Al Qaeda, and Iran and what can be done to counter the jihadist ...\n-----------------------------------------------------------------------\n\nPedophilia in Islam - thighing children - Muslim paedophilia:\nThis documentary contains graphic material and should be viewed only by those 18 years of age or older.  The first 30 minutes contains Qu'ran verses that dscuss and condone pedophilia or the marriage of females before they enter their menstrual age (puberty).\n\nThe documentary then goes into conversations with Islamic leaders who discuss the justification of Muslim pedophilia and the marriage or even rape of children.  No graphic images are provided but the comentary is quite disturbing.\n\nFor those with an ear, let them hear!  After all, this is the near future of our world.  Do not be fooled by the self-righteous religious indoctrination of Islam.\n-----------------------------------------------------------------------\n\nUnderstanding the Muslim Mindset:\nFormer Islamic Terrorist Walid Shoebat and grandson of a Muslim Mukhtar (chieftain), has converted and is now conducting conducting worlwide lectures, giving rate insight into the mind of a Jihadist. Author of the bestselling books including &quot;Why we want to kill you,&quot; Walid, wanting to make up for lost time, is making amends for his past life and on a mission to warn the world of the depth of indoctrination many Muslims go through for their entire life, with all roads pointing to Jihad, or holy war against the 'infidels,' a.k.a. Jews and Christians. In this video, &quot;Understanding the Muslim Mindset,&quot; the viewer will learn hundreds of nuggets of information they probably never before saw discussed on major network TV or read in any newspapers. It's strong, but necessary information. Forewarned is forearmed.\n-----------------------------------------------------------------------\n\nMore featured videos without descriptions include...\nThe Vatican, Hitler, USA, and Islam\nSHOCKING - The Quran admits Allah is Satan\nTop Ten Quran Verses to Understand ISIS\nQuran says Allah is Satan - Al Mudel = The Deceiver\nPalestinian refugee spills the truth - Jordanian army told us to leave in 1948 War\nOct 7 2014 Breaking News Rise of Islam Quran teaches beheading in the name of ISLAM\nLargest Muslim Converts Are South Americans - Yes The Ones Crossing Our Border\n1920, The year the Arabs discovered Palestine\nConcrete Evidence the Vatican Wrote Koran\n\nAlso included are two folders called Recent Islamic Terror and Truth of Islam shorts with various video shorts on the topics\n\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n\nMore Torrents in this series at http://conspiracyhub.com/membershares.php?it=41 ALL TORRENTS are RELEASED here FIRST!!! The First down loaders of my torrents get the Main Hookups on my SERVER. This will get lightning fast downloads, FOR FREE. (The High Speed download wholesalers are going to hate me)I upload to OVER 13 Torrent sites and this site is uploaded 1st.\n\n\nMay Yahweh Bless You as He has me. Seed long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \n\nDo Not believe anything you find here, search the Scriptures daily to determine the TRUTH.  Other Torrents in this Series at\n &lt;a href=&quot;\nhttp://conspiracyhub.com/membershares.php?it=41&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracyhub.com/membershares.php?it=41&lt;/a&gt;  \n\nGet info on the Take Over by The New World Order Below\n &lt;a href=&quot;\nhttp://www.khouse.org/topical_bible_study&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouse.org/topical_bible_study&lt;/a&gt;                                                       Free online Bible Study &lt;a href=&quot;\nhttp://www.babylonthegreatisfalling.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.babylonthegreatisfalling.net&lt;/a&gt;                                                            End Times Prophecy - Who is Babylon the Great\n                                                                                Listen to Alex Jones   Secular Truth &lt;a href=&quot;\nhttp://www.theberean.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theberean.org/&lt;/a&gt;                                                                               Daily Bible Study in Your Email &lt;a href=&quot;\nhttp://www.khouseafrica.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouseafrica.com/&lt;/a&gt;                                                                         Chuck Missler - Africa &lt;a href=&quot;\nhttp://www.store.khouse.org/store/catalog&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.store.khouse.org/store/catalog&lt;/a&gt;                                                       Chuck Missler - USA &lt;a href=&quot;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&lt;/a&gt;                                       Dehydrated Survival Food -  Excellent Taste &lt;a href=&quot;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&lt;/a&gt;          Chuck Missler - New Zealand, Australia, Pacific Rim\n \n\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n                                              :thankyou:    :thankyou:   Thank You JESUS","torrent":{"xt":"urn:btih:96eef02e0c38c7401fbcfd18f1076ade5881b6dd","amp;dn":"POtHS+-+Secret+History+of+the+Islamic+Revival","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96eef02e0c38c7401fbcfd18f1076ade5881b6dd","infoHashBuffer":{"type":"Buffer","data":[150,238,240,46,12,56,199,64,31,188,253,24,241,7,106,222,88,129,182,221]},"announce":[],"urlList":[]}}