{"title":"Maya &amp; Miguel Complete Series","uid":11343493,"size":8188556903,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:98059e749d87655eea71c141790c3c9212f57fe0&amp;dn=Maya+%26amp%3B+Miguel+Complete+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":-1,"time":1414822683,"description":"Maya &amp; Miguel is a children's television animated series produced by Scholastic Studios. It appears on PBS as part of the PBS Kids Go! lineup and on the CBBC channel in the UK. The show ran from October 11, 2004 to October 10, 2007 and had 4 seasons and 65 episodes. On September 10, 2011, it started airing on Univision every Saturday mornings on the block Planeta U. However, as of September 28, 2013, it was removed from the Univision block, Planeta U's Saturday morning lineup for a timeshot replacement for The Jungle Book. The Spanish version is &quot;Maya y Miguel&quot;. It is unknown who performed the theme song, although the singers who performed it rerecorded a line (replacing &quot;He leads with his head and she follows her heart&quot; with &quot;They make a great team as they each do their part&quot;) in mid-2005 due to the original sounding sexist.\n\nThe show presents culture and language learning as fun, relevant and rewarding for all children, with a special emphasis on the Latino population. The show chronicles the adventures, and sometimes misadventures, of fraternal twins Maya and Miguel Santos and features their family, friends and a diverse neighborhood. This show centers on Maya's well-intentioned meddling in her family and friends' lives, ultimately creating new quandaries to fix. Their mother is from Mexico, and their father is from Puerto Rico. The underlying message is the importance of doing good for the family and community, and the philosophy that shared happiness is greater than personal gain. The show presents a positive, culturally rich portrayal of Latino family, language and cultures. In some markets, each episode ends with Maya announcing, &quot;Here's what some of our friends are up to,&quot; introducing clips of children engaging and interacting in ways consistent with the show's themes. Maya concludes episodes by exhorting viewers to &quot;visit your local library like 'Maya &amp; Miguel'&quot;","torrent":{"xt":"urn:btih:98059e749d87655eea71c141790c3c9212f57fe0","amp;dn":"Maya+%26amp%3B+Miguel+Complete+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98059e749d87655eea71c141790c3c9212f57fe0","infoHashBuffer":{"type":"Buffer","data":[152,5,158,116,157,135,101,94,234,113,193,65,121,12,60,146,18,245,127,224]},"announce":[],"urlList":[]}}