{"title":"Christopher Barry-Dee - Online Killers- Portraits of Murderers..","uid":11460600,"size":924952,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9978c52023c0eae014415bc44c2470faf8481c61&amp;dn=Christopher+Barry-Dee+-+Online+Killers-+Portraits+of+Murderers..&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"krystine","files":-1,"time":1415983231,"description":"Online Killers: Portraits of Murderers, Cannibals and Sex Predators Who Stalked the Web for Their Victims\nAuthor: Christopher Barry-Dee\n\n\n\nTHE INTERNET'S DARK SIDE \nTake a cyber journey where the flicker of LCD screens illuminates unimaginable evil. It starts as a harmless online-date, but can quickly turn to kidnap, torture and death. More than just tales of sinister criminals, this collection of true horror stores destroys commonly held myths, like &quot;it's safe to meet someone after knowing them online for many months.&quot; Predators actually gain additional satisfaction from stalking their victims over long periods of time! \n&quot;Online Killers&quot; chronicles the stories of men, women and children whose internet adventures led them into disastrous circumstances, including: \n-Naive 15-year-old Christina Long, whose meeting with a much older man from a chat room led to her rape and murder\n-Schoolteacher Jane Longhurst, the victim of an obsessive necrophiliac who abused her decomposing body for weeks\n-Bernd-Jurgen Brandes, who was not only killed and eaten by a cannibal, but had the whole process immortalized on video\n-Young and beautiful Anastasia Solovyonva, the would-be bride who was brutally murdered at the hands of her supposed fiance.\n\nGenre: Non Fiction | Crime","torrent":{"xt":"urn:btih:9978c52023c0eae014415bc44c2470faf8481c61","amp;dn":"Christopher+Barry-Dee+-+Online+Killers-+Portraits+of+Murderers..","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9978c52023c0eae014415bc44c2470faf8481c61","infoHashBuffer":{"type":"Buffer","data":[153,120,197,32,35,192,234,224,20,65,91,196,76,36,112,250,248,72,28,97]},"announce":[],"urlList":[]}}