{"title":"Zionism in the Age of the Dictators: A Reappraisal","uid":11336247,"size":1927406,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b944002ad06e447d8cf275f714f4b2a8195da72&amp;dn=Zionism+in+the+Age+of+the+Dictators%3A+A+Reappraisal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"HowdyDooDoo","files":-1,"time":1414742114,"description":"In 1933 the German Zionist Federation sought Hitler's patronage: &quot;Zionism hopes to be able to win the collaboration even of a government fundamentally hostile to Jews. . . . Boycott propaganda . . . currently being carried on against Germany . . . is in essence un-Zionist.&quot; Zionism became the only other legal political movement in the Nazi Reich. That same year, the World Zionist Organization (WZO) made the Ha'avara (Transfer) Agreement, undermining the boycott against Nazi Germany. German Jewish emigrants to Palestine had to buy Nazi goods that the WZO sold in the Middle East. In 1937 the Haganah (later the Israeli army) sent an agent to Berlin. They would provide spy intelligence if the Nazis further eased the monetary regulations for emigrants to Palestine. The Zionist-Revisionist movement (today the ruling Likud Party) set up a detachment at Mussolini's naval academy. He personally reviewed them in 1936. They wanted him to replace Britain as Zionism s patron. In 1941, the Fighters for the Freedom of Israel (later Likudniks) told the Nazis that they wanted a &quot;Jewish state on a national and totalitarian basis, bound by a treaty with the German Reich,&quot; and offered &quot;to actively take part in the war on Germany s side.&quot; This is the sordid history documented in Lenni Brenner's Zionism in the Age of the Dictators","torrent":{"xt":"urn:btih:9b944002ad06e447d8cf275f714f4b2a8195da72","amp;dn":"Zionism+in+the+Age+of+the+Dictators%3A+A+Reappraisal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b944002ad06e447d8cf275f714f4b2a8195da72","infoHashBuffer":{"type":"Buffer","data":[155,148,64,2,173,6,228,71,216,207,39,95,113,79,75,42,129,149,218,114]},"announce":[],"urlList":[]}}