{"title":"The Book of Buffalo Pottery (Art Ebook).pdf","uid":12418793,"size":34812552,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d284cfcd05e20b96c49b44df9ded7592eb670b7&amp;dn=The+Book+of+Buffalo+Pottery+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"STBGD","files":1,"time":1442266965,"description":"Crown | 1969 | Pdf | Eng | 192 pages | 33.1 MB\n\nby Violet and Seymour Altman\nWell over 400 pieces illustrated in color and black and white\n\nBuffalo pottery is constantly growing in popularity as a collectible and thus increasing in both scarcity and price. This documentary volume by the Altmans, who have long collected Buffalo wares, is the result of their three years' effort to gather and preserve all available background information and to list and picture as many of the firm's products as possible.\n\nHere, in eleven concise, information-packed chapters, with well over 400 pieces  illustrated in black and white and color, the reader will find all the facts, statistics, and details resulting from the research of these dedicated authors.\n\nEvery kind of ware the firm is known to have made is discussed or pictured. Here, too, is the fascinating background story of the John D. Larkin mail-order company, which founded the pottery that made Deldare, Abino, Blue Willow, advertising and commemorative pieces, game sets, pitchers and jugs, and other articles dating from its early days that are cherished and highly valued today","torrent":{"xt":"urn:btih:9d284cfcd05e20b96c49b44df9ded7592eb670b7","amp;dn":"The+Book+of+Buffalo+Pottery+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d284cfcd05e20b96c49b44df9ded7592eb670b7","infoHashBuffer":{"type":"Buffer","data":[157,40,76,252,208,94,32,185,108,73,180,77,249,222,215,89,46,182,112,183]},"announce":[],"urlList":[]}}