{"title":"Gakuen K -Wonderful School Days-","uid":11647673,"size":977928192,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:a68a63c2cd9613b69367918631fbdfa755bc2aab&amp;dn=Gakuen+K+-Wonderful+School+Days-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"zayu","files":1,"time":1417843038,"description":"Konohana Saya was just an ordinary high schooler, but suddenly, her abilties awaken. Unable to control them, she goes on a rampage. Alienated by her peers due to her powers, she decides that she has no choice but to leave her school. She then receives an invitational letter from Miwa Ichigen, the principal of the &quot;Super&quot; Ashinaka Academy. Saya then transfers into the academy as an &quot;exception&quot; student.\n\nGuided around the academy by her kind classmate, Yukizome Kukuri, Saya's excitement of her new school life was cut short thanks to getting stuck in the middle of a dispute between two clubs.\n\nThe clubs that were quarreling with one another were two of seven special clubs. The Red Club, commonly named &quot;HOMRA&quot;, and the Blue Club, commonly referred to as &quot;SCEPTER 4&quot;.\n\nZeroed in from even the most unexpected places by the leaders of various clubs, Saya gets rescued by three members belonging in one of the seven special clubs- the Silver Club. The three were club leader Isana Yashiro, along with Yatogami Kurou and Neko.\n\nSurrounded by many individualistic characters, the curtains of Saya's new school life are raised","torrent":{"xt":"urn:btih:a68a63c2cd9613b69367918631fbdfa755bc2aab","amp;dn":"Gakuen+K+-Wonderful+School+Days-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a68a63c2cd9613b69367918631fbdfa755bc2aab","infoHashBuffer":{"type":"Buffer","data":[166,138,99,194,205,150,19,182,147,103,145,134,49,251,223,167,85,188,42,171]},"announce":[],"urlList":[]}}