{"title":"Tiny And Shekinahs Weave Trip S01E01 Weave Trippin WEB-DL x264-R","uid":11220393,"size":264608395,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a7b4e56f9ceef08a871098520a9b12b40027a038&amp;dn=Tiny+And+Shekinahs+Weave+Trip+S01E01+Weave+Trippin+WEB-DL+x264-R&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RKSTR","files":1,"time":1413332447,"description":"T.I's better half, Tameka &quot;Tiny&quot; Harris and her outrageous, laugh-out-loud funny best friend and hair stylist Shekinah Jo go cross country with their new mobile hair salon business. With a true passion for flawless hair that just couldn't be restricted to the Atlanta city limits, these ladies are taking their talents and philosophy that &quot;everyone deserves fabulous hair&quot; on the road. From The Voodoo Shop in New Orleans to the Navajo Nation in Arizona, no place is safe when Tiny and Shekinah hit the road. The dynamic duo is ready to leave their comfort zone and experience new cultures, all while being out of their element, starting their new business venture and adjusting to life on the road. Along the way expect an adventure no one will ever forget, a good dose of laughs, some mishaps, a bit of drama and a healthy amount of shenanigans as the ladies work to get their mobile salon off the ground.\n\nWeave Trippin'\nReleasedOct 13, 2014\nBest friends Tiny and Shekinah come up with a new business, a mobile hair salon. But a verbal throw-down ensues as they try to work out the details of this new venture, putting the entire business in jeopardy","torrent":{"xt":"urn:btih:a7b4e56f9ceef08a871098520a9b12b40027a038","amp;dn":"Tiny+And+Shekinahs+Weave+Trip+S01E01+Weave+Trippin+WEB-DL+x264-R","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7b4e56f9ceef08a871098520a9b12b40027a038","infoHashBuffer":{"type":"Buffer","data":[167,180,229,111,156,238,240,138,135,16,152,82,10,155,18,180,0,39,160,56]},"announce":[],"urlList":[]}}