{"title":"Herbie Hancock - The Prisoner (1969) 2014 HDtracks 24-192-FLAC","uid":11411376,"size":1558922892,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:acfca7e3c7b146a22f02f797bdc64ce133915710&amp;dn=Herbie+Hancock+-+The+Prisoner+%281969%29+2014+HDtracks+24-192-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"hal4000","files":-1,"time":1415494664,"description":"Herbert Jeffrey &quot;Herbie&quot; Hancock (born April 12, 1940) is an American pianist, keyboardist, bandleader and composer. As part of Miles Davis's Second Great Quintet, Hancock helped to redefine the role of a jazz rhythm section and was one of the primary architects of the &quot;post-bop&quot; sound. He was one of the first jazz musicians to embrace music synthesizers and funk music (characterized by syncopated drum beats). Hancock's music is often melodic and accessible; he has had many songs &quot;cross over&quot; and achieved success among pop audiences. His music embraces elements of funk and soul while adopting freer stylistic elements from jazz. In his jazz improvisation, he possesses a unique creative blend of jazz, blues, and modern classical music, with harmonic stylings much like the styles of Claude Debussy and Maurice Ravel.\n\nAs one of the first albums Herbie Hancock recorded after departing Miles Davis' quintet in 1968, as well as his final album for Blue Note, The Prisoner is one of Hancock's most ambitious efforts. Assembling a nonet that features Joe Henderson (tenor sax, alto flute), Johnny Coles (flugelhorn), Garnett Brown (trombone), Buster Williams (bass), and Albert &quot;Tootie&quot; Heath (drums), he has created his grandest work since My Point of View. Unlike that effort, The Prisoner has a specific concept -- it's a tribute to Dr. Martin Luther King, evoking his spirit and dreams through spacious, exploratory post-bop. Often, the music doesn't follow conventional patterns, but that doesn't mean that it's alienating or inaccessible. It is certainly challenging, but Hancock's compositions (and his arrangement of Charles Williams' &quot;Firewater&quot;) have enough melody and space to allow listeners into the album. Throughout the record, Hancock, Coles, and Henderson exchange provocative, unpredictable solos that build upon the stark melodies and sober mood of the music. The tone is not of sorrow or celebration, but of reflection and contemplation, and on that level, The Prisoner succeeds handsomely, even if the music meanders a little too often to be judged a complete success.\n\nHDtracks PCM-24Bit-192Khz-FLAC","torrent":{"xt":"urn:btih:acfca7e3c7b146a22f02f797bdc64ce133915710","amp;dn":"Herbie+Hancock+-+The+Prisoner+%281969%29+2014+HDtracks+24-192-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acfca7e3c7b146a22f02f797bdc64ce133915710","infoHashBuffer":{"type":"Buffer","data":[172,252,167,227,199,177,70,162,47,2,247,151,189,198,76,225,51,145,87,16]},"announce":[],"urlList":[]}}