{"title":"Coast.To.Coast.AM.11.10.14.Ouija.Communications.Navy.Seals.iSAAC","uid":11430622,"size":54761180,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:aebb2c01e33bb64a7f29bb99d7deabffd8e00240&amp;dn=Coast.To.Coast.AM.11.10.14.Ouija.Communications.Navy.Seals.iSAAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Isaac09","files":-1,"time":1415722520,"description":"Ouija Communications/ Navy SEALS\n\nDate:\t11-10-14\nHost:\tGeorge Noory\nGuests:\tTracy Twyman, Howard E. Wasdin\n\nAudio\nFormat                                   : MPEG Audio\nFormat version                           : Version 1\nFormat profile                           : Layer 3\nDuration                                 : 2h 31mn\nBit rate mode                            : Constant\nBit rate                                 : 48.0 Kbps\nChannel(s)                               : 1 channel\nSampling rate                            : 44.1 KHz\nCompression mode                         : Lossy\nStream size                              : 51.9 MiB (99%)\n\n\nIn the first half, expert in esoteric history Tracy Twyman discussed her work using the Ouija board as a research tool for exploring occult mysteries. Their experimentation began in 2001, when she and several others attempted to use the Ouija board to contact the deceased French artist Jean Cocteau to learn more about the royal bloodline of France, and the Holy Grail. From there, they were led to the spirit of the &quot;Black Sun&quot;-- Cain, the murderer from the Bible. Eventually, they began using the board to communicate with Baphomet, a demon with a goat face who is part male/female, part human/animal. He is sometimes thought of as the devil, and associated with alchemy and the god of communication Hermes, she said. Recently, Baphomet informed her that the &quot;gates of hell&quot; had been opened in July.\n\nWhile Twyman does not take accept everything these dark spirits tell her, she's found that they can provide poetic inspiration and historical details from the underworld or &quot;other world.&quot; For instance, she learned from Cain that the origins of the game Chess come from an earlier ritual game called Ageio related to the fall of Atlantis and the fall of Adam. Interestingly, she noted that Ouija board contacts with dead people or ghosts are actually more dangerous than interactions with demons, as the deceased tend to have more of a negative influence.\n\n------------------------------------\n\nHoward E. Wasdin served in the U.S. Navy for twelve years, nine as part of the SEAL Teams and was awarded the Silver Star and the Purple Heart. In the latter half, he talked about the training and rigor required to become a SEAL, and the process of assimilating back into civilian life that most veterans face after the trauma and high drama associated with serving their country. A new study has found that among soldiers who return, those who have trouble sleeping have worse PTSD symptoms.\n\nHe recalled being wounded in the battle of Mogadishu in Somalia in 1993. &quot;What most people don't know is the people we were fighting in Somalia-- some of them were al Qaeda, some of them were trained by al Qaeda,&quot; he said, adding that America has a &quot;nasty habit&quot; of not finishing business with countries such as Iraq and Afghanistan. Wasdin shared his story about how he eventually became a chiropractor after he returned from combat, and the value of this approach in treating Vets with various health problems, as opposed to surgery and pharmaceuticals.\n\nNews segment guests: Lauren Weinstein, Chris Geo\n\nWebsite(s):\n\ntracyrtwyman.com\nhowardwasdin.com\nthelastrescuebook.com\n\nBook(s):\n\nClock Shavings\nDead But Dreaming\nSEAL Team Six: Memoirs of an Elite Navy SEAL Sniper\nThe Last Rescue","torrent":{"xt":"urn:btih:aebb2c01e33bb64a7f29bb99d7deabffd8e00240","amp;dn":"Coast.To.Coast.AM.11.10.14.Ouija.Communications.Navy.Seals.iSAAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aebb2c01e33bb64a7f29bb99d7deabffd8e00240","infoHashBuffer":{"type":"Buffer","data":[174,187,44,1,227,59,182,74,127,41,187,153,215,222,171,255,216,224,2,64]},"announce":[],"urlList":[]}}