{"title":"Polyurethanes - Science, Technology, Markets, and Trends","uid":12432281,"size":8900019,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b05b96b2538995f2eab46bab865cf78b3c9dc6eb&amp;dn=Polyurethanes+-+Science%2C+Technology%2C+Markets%2C+and+Trends&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1442478904,"description":"Polyurethanes - Science, Technology, Markets, and Trends - Mark F. Sonnenschein, PhD (Wiley, 2015).pdf\n\nISBN 978-1-118-73783-5\n\nA complete overview of a key plastic\n\nOne of the most versatile polymer materials, polyurethanes have a unique chemical nature that allows for shaping and molding to fit all sorts of consumer and industrial products - seat cushions, carpets, insulation, coatings, and refrigerators to name a few. Despite its popular uses, polyurethane science has only relatively recently achieved appreciation for the richness of its expression as a polymer family. This book provides a thorough presentation of polyurethane science, technology markets and trend analysis based on recent patents. Although it does not provide ultimate detail (such as explicit information typically in patents), the book has a flow and continuity that allows readers to find all the background necessary to understand any other more detailed polyurethane information found elsewhere.\n\nAnyone involved in the polymer and plastics industry will find this book a key resource with features that include: An in-depth summary of the current state of polyurethane research and knowledge Discussion of the applications, manufacture, and markets for polyurethanes Analytical methods, reaction mechanisms, morphology, theoretical techniques, and the selection of chain extenders Polyurethane flexible and rigid foams, elastomers, coatings, adhesives, and medical applications In-depth coverage of governmental regulations, non-isocyanate/non-phosgene routes to polyurethane structure, and industrial routes to environmental, health, and safety risk mitigation","torrent":{"xt":"urn:btih:b05b96b2538995f2eab46bab865cf78b3c9dc6eb","amp;dn":"Polyurethanes+-+Science%2C+Technology%2C+Markets%2C+and+Trends","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b05b96b2538995f2eab46bab865cf78b3c9dc6eb","infoHashBuffer":{"type":"Buffer","data":[176,91,150,178,83,137,149,242,234,180,107,171,134,92,247,139,60,157,198,235]},"announce":[],"urlList":[]}}