{"title":"Now Voyager - The Classic Film Scores of Max Steiner","uid":11499122,"size":290740515,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b1587cc09209d9be51bc2b43bc05a67c97ab8b89&amp;dn=Now+Voyager+-+The+Classic+Film+Scores+of+Max+Steiner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"metro369","files":11,"time":1416319510,"description":"Max Steiner was the epitome of the classic Hollywood film composer, which makes him an ideal candidate for inclusion in conductor Charles Gerhardt's series of &quot;Classic Film Scores&quot; albums of recordings with the National Philharmonic Orchestra. Steiner started out in film in 1930, at the dawn of the sound era, and wrote hundreds of scores into the early '60s, retaining his initial sensibility, in which music, as it might have in the silent era, needed to do a lot of dramatic work. A Vienna native born in 1888, he had a 19th century European perspective, heavily influenced by Richard Wagner, that found him providing powerful, traditional orchestral music to accompany a variety of kinds of films. Gerhardt tries to suggest the breadth of the composer's work by excerpting not only the music of King Kong, with its outsized sense of the clash between the prehistoric and the modern, but also, for instance, &quot;As Long as I Live&quot; from Saratoga Trunk and a suite from Johnny Belinda that show Steiner's ability to be pretty and lyrical. &quot;As Long as I Live&quot; bears some similarity to Steiner's theme for Tara, the plantation in Gone with the Wind. (Gerhardt devotes a separate album to his and the National's recording of that score.) Meanwhile, the &quot;Symphonie Moderne&quot; from Four Wives is, in effect, a piano concerto with some 20th century classical aspects, and the Academy Award-winning music from The Informer is grand, including a choir. Steiner wrote so much that a single LP of samples of his music can only suggest his overall approach, but this one does a good job of that","torrent":{"xt":"urn:btih:b1587cc09209d9be51bc2b43bc05a67c97ab8b89","amp;dn":"Now+Voyager+-+The+Classic+Film+Scores+of+Max+Steiner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1587cc09209d9be51bc2b43bc05a67c97ab8b89","infoHashBuffer":{"type":"Buffer","data":[177,88,124,192,146,9,217,190,81,188,43,67,188,5,166,124,151,171,139,137]},"announce":[],"urlList":[]}}