{"title":"The Hobbit [EXTENDED] (2013-2014) 1080p for iTunes","uid":11363689,"size":8173752077,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b4555f42289fc98ac7a38ed5615e103368982d11&amp;dn=The+Hobbit+%5BEXTENDED%5D+%282013-2014%29+1080p+for+iTunes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gwsb","files":-1,"time":1415026483,"description":"THE HOBBIT: AN UNEXPECTED JOURNEY [EXTENDED] (2013)\n\n\n- Description:\n\nThis Extended adventure follows Bilbo Baggins, who is swept into an epic quest to reclaim Erebor with the help of Gandalf the Grey and 13 Dwarves led by the legendary warrior, Thorin Oakenshield. Their journey will take them through treacherous lands swarming with Goblins, Orcs and deadly Wargs, as well as a mysterious and sinister figure known only as the Necromancer. Although their goal lies to the East and the wastelands of the Lonely Mountain, first they must escape the Goblin tunnels, where Bilbo meets the creature that will change his life forever...Gollum. Here, alone with Gollum, on the shores of an underground lake, the unassuming Bilbo Baggins not only discovers depths of ingenuity and courage, he also gains possession of Gollum's &quot;precious&quot; ring that holds unexpected and useful qualities...A simple, gold ring that is tied to the fate of all Middle-earth in ways Bilbo cannot begin to know.\n\n\n- Audio:\n\nEnglish (AAC, 6 channels)\nPortuguese BR (AAC, 2 channels)\n\n\n\n- Subtitle:\n\nEnglish\nPortuguese BR\nSpanish\nFrench\n\n\n\nTHE HOBBIT: THE DESOLATION OF SMAUG [EXTENDED] (2014)\n\n\n- Description:\n\nAcademy AwardÂ® winner Peter Jackson continues his Middle-Earth saga that follows the adventures of Bilbo Baggins (Martin Freeman) who's swept into an epic quest to reclaim the lost Dwarf Kingdom of Erebor from the fearsome dragon Smaug. In the company of thirteen dwarves and the wizard Gandalf the Grey (Ian McKellen), Bilbo enters the Lonely Mountain in possession of Gollum's &quot;precious&quot; ring and his keen blade, Sting. With an all-star cast, including many acclaimed actors from The Lord of the Rings (such as Cate Blanchett, Ian Holm, Christopher Lee, Hugo Weaving, Elijah Wood, Andy Serkis and more), and the effects wizardry of Jackson's award-winning Weta Workshop, Tolkien's epic story comes to life as never before imagined. The Extended Edition film is 25 minutes longer with new and extended scenes, not seen in the theatrical release.\n\n\n\n- Audio:\n\nEnglish (AAC, 6 channels)\nPortuguese BR (AAC, 6 channels)\n\n\n- Subtitle:\n\nEnglish\nPortuguese BR\nSpanish\nFrench\n\n\n\n- Format (both):\n\n.m4v\n\n\n\n*Tested on Windows and Mac","torrent":{"xt":"urn:btih:b4555f42289fc98ac7a38ed5615e103368982d11","amp;dn":"The+Hobbit+%5BEXTENDED%5D+%282013-2014%29+1080p+for+iTunes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4555f42289fc98ac7a38ed5615e103368982d11","infoHashBuffer":{"type":"Buffer","data":[180,85,95,66,40,159,201,138,199,163,142,213,97,94,16,51,104,152,45,17]},"announce":[],"urlList":[]}}