{"title":"The Sentinel Season 01 '96 webrip","uid":11292897,"size":2281466413,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b4a3dbd353cfc27eb0a7f91666dee1d836ded783&amp;dn=The+Sentinel+Season+01+%2796+webrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"uFlans","files":10,"time":1414355155,"description":"Jim Ellison was a US Army Ranger who spent 18 months in the Peruvian jungle after the rest of his unit was killed. He developed hyperacute senses from surviving in the wild, but repressed them when he returned to civilization. His sensory abilities re-manifested five years later, while conducting an extended stakeout in the forest as a detective in the Major Crimes Unit of the Cascade, Washington, police department. He went to a hospital for an examination where he met Blair Sandburg, an anthropologist from Rainier University, whom Ellison initially mistook for a physician. Upon hearing Ellison's story, Sandburg declares that Ellison is a &quot;Sentinel&quot;: in ancient tribes, Sentinels used their enhanced senses to protect their village. For Jim, Cascade is his village. Blair had been studying Sentinel mythology for years, but he had never before found a person with all five senses enhanced, a &quot;true&quot; Sentinel.\n\nBlair helps Jim control his senses and joins Jim as a police observer. Their unlikely partnership works, and together they fight crime in the streets of Cascade.\n\nJim's hyperacute senses allow him to perceive things undetectable by normal humans. He can see perfectly in low light situations and with superb acuity at long distances, hear sounds at extremely low volume or beyond the normal range of human hearing, and sense what others can't via taste, touch and smell; he declares himself &quot;a walking forensic lab&quot;. Jim's powers have a drawback: if he concentrates too strongly on one sense, he may become oblivious to his immediate surroundings. Part of Blair's job is preventing this, and protecting Jim when he is focusing.\n\nThe only person aside from Sandburg who knows Jim's secret is his captain and friend, Simon Banks.\n\n320 x 480 .mp4 format","torrent":{"xt":"urn:btih:b4a3dbd353cfc27eb0a7f91666dee1d836ded783","amp;dn":"The+Sentinel+Season+01+%2796+webrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4a3dbd353cfc27eb0a7f91666dee1d836ded783","infoHashBuffer":{"type":"Buffer","data":[180,163,219,211,83,207,194,126,176,167,249,22,102,222,225,216,54,222,215,131]},"announce":[],"urlList":[]}}