{"title":"Wayne Shorter - Schizophrenia (1967) 2013 HDtracks 24-192-FLAC","uid":11398535,"size":1343146011,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b59eb495dc9adc3d4ef2bec95ad909c55b15b916&amp;dn=Wayne+Shorter+-+Schizophrenia+%281967%29+2013+HDtracks+24-192-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hal4000","files":-1,"time":1415395659,"description":"Wayne Shorter (born August 25, 1933) is an American jazz saxophonist and composer.\nJazz critic Ben Ratliff of the New York Times has described Shorter as &quot;probably jazz's greatest living small-group composer and a contender for greatest living improviser.&quot; Many of Shorter's compositions have become jazz standards. His output has earned worldwide recognition, critical praise and various commendations, including 10 Grammy Awards. He has also received acclaim for his mastery of the soprano saxophone (after switching his focus from the tenor in the late 1960s), beginning an extended reign in 1970 as Down Beat's annual poll-winner on that instrument, winning the critics' poll for 10 consecutive years and the readers' for 18.\nShorter first came to wide prominence in the late 1950s as a member of, and eventually primary composer for, Art Blakey's Jazz Messengers. In the 1960s, he went on to join Miles Davis's Second Great Quintet, and from there he co-founded the jazz fusion band Weather Report. He has recorded over 20 albums as a bandleader.\n\nWayne Shorter was at the peak of his creative powers when he recorded Schizophrenia in the spring of 1967. Assembling a sextet that featured two of his Miles Davis bandmates (pianist Herbie Hancock and bassist Ron Carter), trombonist Curtis Fuller, alto saxophonist/flautist James Spaulding and drummer Joe Chambers, Shorter found a band that was capable of conveying his musical &quot;schizophrenia,&quot; which means that this is a band that can play straight just as well as they can stretch the limits of jazz. At their best, they do this simultaneously, as they do on the opener &quot;Tom Thumb.&quot; The beat and theme of the song are straightforward, but the musical interplay and solos take chances that result in unpredictable results. And &quot;unpredictable&quot; is the operative phrase for this set of edgy post-bop. Shorter's compositions (as well as Spaulding's lone contribution, &quot;Kryptonite&quot;) have strong themes, but they lead into uncharted territory, constantly challenging the musicians and the listener. This music exists at the border between post-bop and free jazz -- it's grounded in post-bop, but it knows what is happening across the border. Within a few years, he would cross that line, but Schizophrenia crackles with the excitement of Shorter and his colleagues trying to balance the two extremes.\n\nHDtracks PCM-24Bit-192Khz-FLAC","torrent":{"xt":"urn:btih:b59eb495dc9adc3d4ef2bec95ad909c55b15b916","amp;dn":"Wayne+Shorter+-+Schizophrenia+%281967%29+2013+HDtracks+24-192-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b59eb495dc9adc3d4ef2bec95ad909c55b15b916","infoHashBuffer":{"type":"Buffer","data":[181,158,180,149,220,154,220,61,78,242,190,201,90,217,9,197,91,21,185,22]},"announce":[],"urlList":[]}}