{"title":"[Admiral Smith] A3A6A2FFBD3F9A85-00001.7z","uid":11164069,"size":4207611,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b7b939e52fc824357ea265b48307e3ff022104f5&amp;dn=%5BAdmiral+Smith%5D+A3A6A2FFBD3F9A85-00001.7z&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"igtf0","files":1,"time":1412605192,"description":"Filename\t\t\t\t\tsize\t\tprice\tpersonal rating\n[Admiral Smith] A3A6A2FFBD3F9A85-00001.7z\t4109KB\t        $0.00\t10 / 10\nNotes:\nThis is a fixed data locker. The files get encrypted and can be accessed with the correct password.  It is different than a compressed encrypted archive because each file can be randomly accessed.  Think of it as an encrypted virtual usb storage device.\n\n&quot;Admiral Smith&quot; of United States of America.\nReviewed 09-29-2014\nDisclaimer:\nThe image [Admiral Smith - United States of America].jpg was a cute little clean furry image that I wanted to use as a commissioned stamp.  Each file that I review is comissioned in my database with a zero dollar value which means it is used for inventory purposes.  Why yes.  I may write off my storage bank off on my taxes.  I do not need to but that is what good commissioners do.  It is a new era of commissioners, custodians, and pickers.\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nText from the product.\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nHIDE YOUR FILES AND KEEP INTRUDERS OUT\n\nSafeHouse Explorer hides and protects your private documents and files, keeping them safe from intruders and anyone else who doesn't have your permission to view them. Trust your privacy to SafeHouse.\n\n\nSafeHouse uses passwords and advanced encryption to completely hide and defend your sensitive files, including photos, videos, spreadsheets, databases and just about any other kind of file that you might have. Works on any drive, including memory sticks.\n\n\nSafeHouse Explorer is FREE!\n\n\nUSING SAFEHOUSE EXPLORER IS EASY\n\n\nSafeHouse Explorer creates hidden private storage areas on your hard drive to hold your confidential files. Your files are completely invisible until you enter your password.\n\n\nAfter you enter your secret password, you access your files using SafeHouse Explorer's familiar drag-and-drop Explorer-like interface.\n\n\nSafeHouse can also protect files stored on external drives, USB flash disks and CD/DVDs.\n\n\nCOMPATIBILITY\n\n\nThe encrypted file storage vaults created and managed by SafeHouse Explorer are fully compatible with our commercial SafeHouse Personal Edition and SafeHouse Professional Edition software.\n\n\nSafeHouse Explorer is published as a free companion application for our commercial SafeHouse products.\n\n\nSAFEHOUSE EXPLORER IS FREE\n\n\nSafeHouse Explorer is free software which is freely distributable. This is not trial software. SafeHouse Explorer is not crippled and will not time out. \n\n\nWhy then? We simply believe that by freely sharing this tool with the Internet community, that you'll be instantly impressed with this easy-to-use software and that you'll want to try out some of our other SafeHouse encryption products. Please see our license agreement for further details.\n\n\nINSTALLING SAFEHOUSE EXPLORER\n\n\n\n\nPlease know that this setup program will not touch any of your existing files. To protect your files, you will need to use SafeHouse Explorer to create an encrypted file storage vault, commonly known as a SafeHouse volume, and move your files into it. Only files residing inside your SafeHouse volumes will be protected. You may create as many volumes as you need.\n\n\nSYSTEM REQUIREMENTS\n\n\nWindows 2000/XP/2003/2008/Vista/Win7 \n\n\n10MB hard disk space for SafeHouse files \n\n\nAdditional disk space for your private files \n\n\nPlease visit the SafeHouse website for the latest news and software releases.\n\n\nÂ© Copyright 1997-2009 PC Dynamics, Inc.\n\n","torrent":{"xt":"urn:btih:b7b939e52fc824357ea265b48307e3ff022104f5","amp;dn":"%5BAdmiral+Smith%5D+A3A6A2FFBD3F9A85-00001.7z","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7b939e52fc824357ea265b48307e3ff022104f5","infoHashBuffer":{"type":"Buffer","data":[183,185,57,229,47,200,36,53,126,162,101,180,131,7,227,255,2,33,4,245]},"announce":[],"urlList":[]}}