{"title":"EnigmaT Set Rips { Cuts } - November 20th, 2014","uid":11518515,"size":726273285,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b8532b4e631e709196b99df3e80be37c286161c5&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+November+20th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"EnigmaT","files":86,"time":1416464405,"description":"2nd Phase - Breach (Original Mix) (Cut From 2nd Phase Set)-enTc\n2nd Phase - Horrified (Original Mix) (Cut From 2nd Phase Set)-enTc\n3LAU feat. Luciana - We Came To Bang (Cut From Tritonal Set)-enTc\nA.Squared - Overseas (Cut From Ruben Set)-enTc\nAero 21 - Confusion (Original Mix) (Cut From Saux Set)-enTc\nAirbase - Panache (Original Intro Mix) (Cut From Ferry Set)-enTc\nAlex H - Where Stars Collide (Cut From Ruben Set)-enTc\nAlexander Popov - Born To Love (Original Mix) (Cut From Popov Set)-enTc\nAndy Elliass - Whangarei (Araya Remix) (Cut From A&amp;F Set)-enTc\nAndy Elliass - Whangarei (Araya Remix) (Cut From Saux Set)-enTc\nBaseman - Wonderland (Original Mix) (Cut From Carefull Set)-enTc\nBreame &amp; Jack Vath - Arancini (Rodrigo Deem Remix) (Cut From Ost&amp;Meyer Set)-enTc\nCasey Rasch Feat. Taranhawk - Lords Of War (Paul Webster Remix) (Cut From UkTuni Set)-enTc\nClimbers - Down Under (Cut From Seaman Set)-enTc\nCochise - Bet (-Short- Cut From Halliwell Set)-enTc\nDave Seaman - Justified Replacement Of Lulu (Marc Marzenit Remix) (Cut From Seaman Set)-enTc\nDeadmau5 &amp; Kaskade feat Laura Brehm - I Remember (Mr FijiWiji Remix) (Set Rip)-enTc\nDeetron - Photon (WP Dub) (Cut From Seaman Set)-enTc\nDenis Neve - White Nights (Andrew Lang Remix) (Cut From Ost&amp;Meyer Set)-enTc\nDenzal Park &amp; Kevin Breton feat. Jonny Rose - Headrush (Original Mix) (Cut From Armada Set)-enTc\nDigital X - Raveland (Set Rip)-enTc\nDigitalsoulz - Feel So High (Original Mix) (Cut From Ost&amp;Meyer Set)-enTc\nDj Misjah - No More Mr. Nice Guy (Chris Chambers Good Guy Mix) (Cut From Ekman Set)-enTc\nDT8 Project - Forever in a Day (Koishii &amp; Hush vs. Ric Scott Remix) (Cut From A&amp;F Set)-enTc\nDVBBS &amp; Dropgun feat. Sanjin - Pyramids (Cut From Tritonal Set)-enTc\nEddie Bitar - Follow Me (Original Mix) (Cut From Saux Set)-enTc\nFerry Corsten - Pogo (Dimension Remix) (Cut From Ferry Set)-enTc\nFlatdisk - Vertex (Cut From Page Set)-enTc\nFresh Code - Fallen Angel (Original Mix) (Cut From Feel Set)-enTc\nHardnoise - Breakaway (Blazer Remix) (Cut From UkTuni Set)-enTc\nHELENA - Shake It (-Short- Cut From Tritonal Set)-enTc\nHotsteppa - Latch (Zedd Edit) (Cut From Trtitonal Set)-enTc\nID - ID (Iversoon &amp; Alex Daf Remix) (Set Rip)-enTc\nIkerya Project - Morning Exercise (Autocinema Remix) (Cut From UkTuni Set)-enTc\nImida - Not Afraid of the Roller Coaster (Carlos Martz Acid Mix) (Cut From Cold Set)-enTc\nIversoon &amp; Alex Daf - ID 001 {Nov 2014} (Set Rip)-enTc\nIversoon &amp; Alex Daf - ID 002 {Nov 2014} (Set Rip)-enTc\nJohn Dopping - Shady (Original Mix) (Cut From UkTuni Set)-enTc\nJoseph Areas - Beluga (Set Rip)-enTc\nJoze Linecker - Orca (Original Mix) (Cut From Saux Set)-enTc\nJoze Linecker - Orca (Original Mix) (Cut From Sneijder Set)-enTc\nJuventa feat. Kelly Sweet - Superhuman (Kago Penchi Remix) (Cut From Trtitonal Set)-enTc\nKatrin Souza - Closely (Michael A Remix) (Cut From Ruben Set)-enTc\nKelly Andrew - Timeless (Intro Orchestral Trance Mix) (Cut From Romel Set)-enTc\nKevin Focus - Brocked 7 (Pobsky &amp; Paul Atkinson Edit) (Set Rip)-enTc\nKoven - Petrichor (Set Rip)-enTc\nLeSumo - Storm Down 2009 (Original Mix) (Cut From Bowden Set)-enTc\nMajera - Velvet Sun (Moonsouls Remix) (Cut From Solarstone Set)-enTc\nManuel Rocca feat. Emily Richards - Let Your Love Shine (Cut From A&amp;F Set)-enTc\nMarkus Schulz feat. Liz Primo - Blown Away (Venom One Dub Mix) (Cut From Popov Set)-enTc\nMarsbeing - Focus The Moon (Cut From Ferry Set)-enTc\nMiroslav Vrlik - We Dont Change (Cut From A&amp;F Set)-enTc\nMr FijiWiji &amp; Direct - Hysteria (Set Rip)-enTc\nMyk Bee - Under Your Cloud (Original Mix) (Cut From Carefull Set)-enTc\nNERVO feat. Au Revoir Simone - Rise Early Morning (Cut From Page Set)-enTc\nNick Sentience &amp; Charlie Bradley - Affinity (Andres Sanchez Remix) (Cut 2 From Saux Set)-enTc\nNick Sentience &amp; Charlie Bradley - Affinity (Andres Sanchez Remix) (Cut From A&amp;F Set)-enTc\nNick Sentience &amp; Charlie Bradley - Affinity (Andres Sanchez Remix) (Cut From Saux Set)-enTc\nNomination &amp; BBSOUND Feat. Anthya - Save My Tears (Outside The Bound Less Vocals Mix) (Set Rip)-enTc\nOliver S &amp; Jimi Jules - Pushing On (Tchami Remix) (Cut From Page Set)-enTc\nOne Man Groove - Stolen Memories (Original Mix) (Cut From Solarstone Set)-enTc\nOrkidea - Purity (Nicholas Bennison Remix) (Cut From Popov Set)-enTc\nPedro Delgardo - The Spaceman (Rydel Remix) (Cut From UkTuni Set)-enTc\nPeppelino - WTF (Original Mix) (Cut From UkTuni Set)-enTc\nR3dub - Lilisland (Cut From Mad-Core Set)-enTc\nRake feat. Mat Twice - Tonight (Orbion Classic Remix) (Cut From Rake Set)-enTc\nRam - Clockwork Orange (Original Mix) (Cut From Saux Set)-enTc\nRelaunch - One Love (Club Mix) (Cut From Solarstone Set)-enTc\nReYou -Watching You (Cut From Seaman Set)-enTc\nRichard Knott - Mantra (Cut From Connelly Set)-enTc\nRiggi &amp; Piros - Crank (Cut From Tritonal Set)-enTc\nRobert Vadney - Away From You (2015 Reboot) (Cut From Bowden Set)-enTc\nRon Hagen &amp; A.R.D.I. &amp; Sarah Lynn - Gold In The Sky (Signum Remix) (Set Rip)-enTc\nRoul &amp; Doors - Down On This (Original Mix) (Cut From Halliwell Set)-enTc\nRuben de Ronde - A-Tention (Bram Troost Remix) (Cut From Ruben Set)-enTc\nRuslan Radriges - The Need For Change (Original Mix) (Cut From Feel Set)-enTc\nSam Gellaitry - Waiting So Long (Set Rip)-enTc\nSolidame - Infected (Cut From Ruben Set)-enTc\nSorrow - Mourner (Set Rip)-enTc\nStefano Pain &amp; Delayers - Control (-Short- Cut From Halliwell Set)-enTc\nSteven Brooks - New Vision (Dave Cold Remix) (Cut From Cold Set)-enTc\nStumbleine - Lon Lon (Set Rip)-enTc\nSunlight Project - Sweet Memories (Original Mix) (Cut From Sneijder Set)-enTc\nSuper8 &amp; Tab Feat. Julie Thompson - Let Go (Going Deeper Remix) (Cut From Saint-Jules Set)-enTc\nTribal Point - Mutual Vision (Jimmy Chou Remix) (Set Rip)-enTc\nTrizet - Mysticated (Tuomas.L Remix) (Cut From Karbyde Set)-enTc","torrent":{"xt":"urn:btih:b8532b4e631e709196b99df3e80be37c286161c5","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+November+20th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8532b4e631e709196b99df3e80be37c286161c5","infoHashBuffer":{"type":"Buffer","data":[184,83,43,78,99,30,112,145,150,185,157,243,232,11,227,124,40,97,97,197]},"announce":[],"urlList":[]}}