{"title":"Thermodynamics Systems Containing Flexible Chain Polymers","uid":12436803,"size":23774534,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bc56558a1bcf5330f97676f9d717a86992307795&amp;dn=Thermodynamics+Systems+Containing+Flexible+Chain+Polymers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1442521666,"description":"Thermodynamics Systems Containing Flexible Chain Polymers (Elsevier, 1999).pdf\n\nISBN 0444823735\n\nThis book deals with the problems of the thermodynamics of systems containing flexible-chain polymers as the basis of polymer material science. The main thermodynamic quantities and concepts are introduced and discussed in the order of the objects getting more and more complicated: gases, magnets, low-molecular-weight substances and mixtures, and finally, polymers and polymer blends.\nAll topics are considered in a common clue, using the principle of universality. The stability conditions for the one-phase state of multi-component systems are given. Phase separation is regarded as a result of loss in stability. The critical state of a system, with the one-phase state being close to the boundary of stability conditions breaking, is discussed in detail. The effects of both light scattering (elastic and dynamic) and diffusion, as directly depending on the thermodynamic parameters characterizing the one-phase state stability, are considered in detail. One of the versions of colloid scattering, namely, the turbidity spectrum method, is described as useful for the characterization of various heterogeneous structures and for the phase analysis of polymer systems. In the approximation of mean field theories and advanced field theory, formalisms expound the following divisions of the thermodynamics of binary and polynary systems with flexible-chain polymers: conformation of the polymer coil, composition fluctuations, elastic and dynamic light scattering, diffusion in the one-phase state (including the critical range), phase separation, polymer fractionation, the coil-globule transition, phase equilibrium and separation in the system network polymer + low-molecular-weight liquid, polymer blends and multiphase separation","torrent":{"xt":"urn:btih:bc56558a1bcf5330f97676f9d717a86992307795","amp;dn":"Thermodynamics+Systems+Containing+Flexible+Chain+Polymers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc56558a1bcf5330f97676f9d717a86992307795","infoHashBuffer":{"type":"Buffer","data":[188,86,85,138,27,207,83,48,249,118,118,249,215,23,168,105,146,48,119,149]},"announce":[],"urlList":[]}}