{"title":"Kiss Me Monster [1969]","uid":11311870,"size":735102976,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bd5d818c7d74e33f12a766d4bbaf4d47717dcfd8&amp;dn=Kiss+Me+Monster+%5B1969%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jax-dog","files":-1,"time":1414517594,"description":"Kiss Me Monster [1969]\n\nWhen one of the first scene of a film contains the line, &quot;Well, let me tell you the story about what happened,&quot; you know that you're in for a classic. This is that kind of classic. KISS ME MONSTER is a short, sometimes dull, and always sleazy film that makes you wish there were still drive-ins. How else could this have made it into theaters, except for maybe a few grindhouses.\n\nKISS ME MONSTER is a hodge-podge of cliches, lots of red herrings, and a plot that is practically indescribable. In fact, I'm not sure if there really is a plot, just a series of scenes that are excuses to show the two female leads in different stages of undress. The dialogue is ridiculous (to be fair, this may be the fault of the below-par dubbing), and the characters are mostly unlikable.\n\nBut, in its own cynical yet silly way, the film has its charms. The blonde lead is very attractive, and she gives karate-chops, too. Plus, Jesus Franco, as cheap a director as he is, usually accomplishes come good photography. Plus, some of the jazz on the soundtrack is pretty good.\n\nI liked KISS ME MONSTER, but for all the wrong reasons. I laughed out-loud so many times, I kept wondering if it was supposed to be funny. Alas, I don't think so. If anyone can explain how the plot leads to the island with the mad scientist, please let me know. Because I was scratching my head the whole time...\n\nVideo info: XviD - 640x416 - 25fps - 1h 19mn 27s 40ms","torrent":{"xt":"urn:btih:bd5d818c7d74e33f12a766d4bbaf4d47717dcfd8","amp;dn":"Kiss+Me+Monster+%5B1969%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd5d818c7d74e33f12a766d4bbaf4d47717dcfd8","infoHashBuffer":{"type":"Buffer","data":[189,93,129,140,125,116,227,63,18,167,102,212,187,175,77,71,113,125,207,216]},"announce":[],"urlList":[]}}