{"title":"Moon Quest-Choose Your Own Adventure 26.pdf","uid":11594197,"size":7679667,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bdec56ff38428f167cdc4f67862f1ab5c20541fb&amp;dn=Moon+Quest-Choose+Your+Own+Adventure+26.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"spacecb","files":-1,"time":1417262184,"description":"THE YEAR IS 2053. THE PLACE IS THE\nTYCHO COLONY-BENEATH A GLASS\nDOME ON THE NEAR SIDE OF THE MOON.\n\nYou and a group of your friends are on an expedition across some particularly treacherous moonscape. A sudden quakerocks the mountain, and you and your leader are separated from the group.\n\nA rock crashes next to you. You struggle to get back on your feet. You call to John and the bus on your radio, but there's no reply. The bus slowly continues its climb up the cliff face, but you see that a rock has hit its noseand dented it. What should you do? John hos left anoth-er line gun behind, but he told you to stay here and wait for the bus. You don't know what will happen if you turn the winch off.\nIf you turn the winch off ond go see if John is all right, turn to poge 75. If you decide to wait for the bus to make it to the ledge, turn to page 45.\n\nIt's summer vacation-not that that means a lot; there aren't really seasons here on the moon. What it does mean is that you're making big plans. You'll have a lot of expeditions to choose from, but just remember: much of the moon is uncharted territory. Don't get lost-and don't run too low on your oxygen tank!","torrent":{"xt":"urn:btih:bdec56ff38428f167cdc4f67862f1ab5c20541fb","amp;dn":"Moon+Quest-Choose+Your+Own+Adventure+26.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdec56ff38428f167cdc4f67862f1ab5c20541fb","infoHashBuffer":{"type":"Buffer","data":[189,236,86,255,56,66,143,22,124,220,79,103,134,47,26,181,194,5,65,251]},"announce":[],"urlList":[]}}