{"title":"Wages of Sin (2006 movie)","uid":11246818,"size":2829459965,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bf337c5be2b6f19a8d5a2a0a150239dd6d1c659e&amp;dn=Wages+of+Sin+%282006+movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":1,"time":1413750857,"description":"SPOILER BELOW\n\nA truly terrible film. The main character, Sue Walker, receives a letter from a lawyer informing her that she has inherited a mysterious house in the countryside. The lawyer later explains that they have had trouble selling the house because of its troubling history. The reality is that a crucified skeleton - that of the protagonist's overly religious and abusive father - has been occupying the attic and haunting the house. This undoubtedly has made the house difficult to sell.\n\nShe decides to take a weekend trip to the house with her boyfriend Ron and two friends from college. By entering the house, Sue unlocks the dark secrets of her forgotten past and gets all of her friends killed. The minimal plot is made up for with a very boring and convoluted backstory, told through several inexplicable hallucinations and a scene where she nonchalantly vomits one of her own internal organs. A truly memorable moment with no purpose or consequences to the rest of the film.\n\nTrying to drive away from the house, the youths find themselves arriving at the same house again and again - the house having altered spacetime and/or their minds. The unlettered but very attractive youths eventually succumb to a grim fate after two hours of running, hiding, screaming, bad cinematography, and marijuana use","torrent":{"xt":"urn:btih:bf337c5be2b6f19a8d5a2a0a150239dd6d1c659e","amp;dn":"Wages+of+Sin+%282006+movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf337c5be2b6f19a8d5a2a0a150239dd6d1c659e","infoHashBuffer":{"type":"Buffer","data":[191,51,124,91,226,182,241,154,141,90,42,10,21,2,57,221,109,28,101,158]},"announce":[],"urlList":[]}}