{"title":"West Indian Rhythm: Trinidad Calypsos 1938-1940 (10 Disc Set)","uid":11523709,"size":2192510998,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bffb1d89f8ca4c9bddf90a35ff9e3645fbb4db19&amp;dn=West+Indian+Rhythm%3A+Trinidad+Calypsos+1938-1940+%2810+Disc+Set%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CorporateCrime","files":-1,"time":1416506005,"description":"eac secure cues logs no scans\n\nVarious Artists - West Indian Rhythm: Trinidad Calypsos 1938-1940 [2006]\n\nOriginal Release / Bear Family Records\n\nDecca Records, to compete with a similar venture by RCA, sent a recording crew to Trinidad in 1938 to record local calypso artists for commercial release on the island and beyond. West Indian Rhythm compiles all but one of the resulting calypsos from 1938-1940 on ten discs, featuring many of the most popular calypso artists of the day: Atilla the Hun, the Lion, the Caresser, and King Radio. Certainly one of the heaviest box sets Bear Family Records has ever produced, West Indian Rhythm comes with an immense 316-page LP-sized hardback book that might be the most impressive achievement in Bear Family's history. The exhaustively sourced text not only provides historical background and biographical notes on the performers, but provides lyrics for every vocal selection and explanations of the cultural, geographical, and historical references therein that might elude modern listeners. Of the 268 calypso titles recorded for Decca during this period (released and unreleased), the compilers were able to locate the masters for 265, while two of the remaining titles turned up on an acetate in a private collection. As a result, this is an astonishingly complete set of Trinidadian calypsos lovingly restored and presented in remarkable sound quality, unlike previous anthologies of this material mastered from commercial 78s. Many of the unreleased recordings were censored for political reasons or for alleged obscenity; two examples of the former -- Atilla the Hun's &quot;The Banning of Records&quot; and the Lord Executor's sarcastic &quot;The Censoring of Calypso Makes Us Glad,&quot; were censored for commenting on censorship itself. Aside from the lyrically rich topical calypsos listeners would expect, the set offers a wide variety of music issued under Decca's calypso series, including gospel, instrumental, and dance tunes that reflect the diversity of Trinidad's carnival music scene. The time, expense, and attention to detail that obviously went into this set are almost beyond belief, and the result is an unrivaled tribute to what many consider to be the greatest calypso catalog ever recorded","torrent":{"xt":"urn:btih:bffb1d89f8ca4c9bddf90a35ff9e3645fbb4db19","amp;dn":"West+Indian+Rhythm%3A+Trinidad+Calypsos+1938-1940+%2810+Disc+Set%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bffb1d89f8ca4c9bddf90a35ff9e3645fbb4db19","infoHashBuffer":{"type":"Buffer","data":[191,251,29,137,248,202,76,155,221,249,10,53,255,158,54,69,251,180,219,25]},"announce":[],"urlList":[]}}