{"title":"Adsorptive Removal of Heavy Metals from Groundwater by Iron Oxid","uid":12443496,"size":5778052,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c20c9035afd096de5f732513245b128e6398a100&amp;dn=Adsorptive+Removal+of+Heavy+Metals+from+Groundwater+by+Iron+Oxid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1442602724,"description":"Adsorptive Removal of Heavy Metals from Groundwater by Iron Oxide Based Adsorbents - Valentine Uwamariya (CRC, 2013).pdf\n\nISBN 978-1-138-02064-1\n\nIn general, groundwater is a preferred source of drinking water because of its convenient availability and its constant and good quality. However this source is vulnerable to contamination by several substances. Acceptable quality limits relative to micropollutant contents in drinking water are becoming increasingly lower and efficient elimination treatment processes are being implemented in order to meet these requirements. Metals contaminants at low concentration are difficult to remove from water. Chemical precipitation and other methods become inefficient when contaminants are present in trace concentrations and the process of adsorption is one of the few alternatives available for such situations. This book describes the adsorption method in the removal of selected heavy metals present as cations (Cd2+, Cu2+ and Pb2+) or oxyanions (Cr(VI) and As(V)) using iron oxide coated sand (IOCS) and granular ferric hydroxide (GFH). The effects of pH, natural organic matter (fulvic acid (FA)) and interfering ions (PO43-, Ca2+) on the adsorption efficiency were also assessed. The sorption reactions that take place at the surface of the adsorbent were also described through the surface complexation modelling for Cd2+, Cu2+ and Pb2+ adsorption. Batch adsorption tests and rapid small scale column tests (RSST) were used as laboratory methods","torrent":{"xt":"urn:btih:c20c9035afd096de5f732513245b128e6398a100","amp;dn":"Adsorptive+Removal+of+Heavy+Metals+from+Groundwater+by+Iron+Oxid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c20c9035afd096de5f732513245b128e6398a100","infoHashBuffer":{"type":"Buffer","data":[194,12,144,53,175,208,150,222,95,115,37,19,36,91,18,142,99,152,161,0]},"announce":[],"urlList":[]}}