{"title":"[Commie] Psycho-Pass 2 - 01 [495A3950]","uid":11197221,"size":299130819,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c2f1b181a02c2e14eb510d9f70e4184fa898d946&amp;dn=%5BCommie%5D+Psycho-Pass+2+-+01+%5B495A3950%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xKTRx","files":1,"time":1413111656,"description":"Psycho-Pass 2 - 01 [10bit 720p]\n\n\n\nAn explosion occurs on broad daylight and despite having no casualties, it brings the atention of the MWSPB. The police's investigation tracks the culprit as Akira Kitazawa, a demolitions expert whose career was staggered after it was confirmed that his Crime Coefficent tends to increase under pressure. Upon locating Kitazawa's hideout, Akane realizes that he is setting a trap for them and disobeys her orders to advance and confront him. Her assumptions are proven correct, and Kitazawa escapes, apparently taking a hostage with him, which he soon after releases. Certain that the hostage is actually an hologram with another trap, Akane's unit keep pursuing Kitazawa and upon cornering him, Akane notices that his Crime Coefficent is just a little over the mimimum required for the Dominator to enter into execution mode and decides to calm him down instead of killing him. Her plan works and she just knocks him down with the paralyzing mode when his coefficent drops to the non-lethal levels. Elsewhere, another unit is sent to dispose of the hologram, who is revealed to be a man identified as a MWSPB officer who snatches the Dominator from the agent and uses it to kill her Enforcer partner.","torrent":{"xt":"urn:btih:c2f1b181a02c2e14eb510d9f70e4184fa898d946","amp;dn":"%5BCommie%5D+Psycho-Pass+2+-+01+%5B495A3950%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2f1b181a02c2e14eb510d9f70e4184fa898d946","infoHashBuffer":{"type":"Buffer","data":[194,241,177,129,160,44,46,20,235,81,13,159,112,228,24,79,168,152,217,70]},"announce":[],"urlList":[]}}