{"title":"Rory Block - 2003 - Last Fair Deal FLAC","uid":11292158,"size":308667728,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c3e191bacb0b28081ffb76a02311b770f2c0f9fa&amp;dn=Rory+Block+-+2003+-+Last+Fair+Deal+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"eika256","files":-1,"time":1414348019,"description":"Rory Block - 2003 - Last Fair Deal\n\nWhile Rory Block had been a remarkably consistent artist over the course of 30 years, if all it took was for her to leave Rounder Records to make a record like Last Fair Deal, one has to wonder why she didn't do it ages ago. Block is one of the most restless and in-the-field artists in the history of contemporary blues. She has continually dug deeper into the muck and the mire of not only the blues but her personal life, emotionally, spiritually, amorously, and psychically, to bring out what is integral to the creation -- not re-creation -- of blues music. She has suffered, endured, and continued to make music that is not only compelling, but necessary for any accurate understanding of the cultural history of the blues tradition because she is perhaps the living female embodiment of it. Last Fair Deal is a record stripped of artifice or niceties. It is raw, feral, tender, sacred, sinful, lusty, and enlightening. On this recording, Block has assembled a collection of songs -- written, re-arranged, and restored -- that showcases the guitar as an extension of her physical and spiritual body. She writes in the liner notes that this is her tribute to the instrument that has seen her through the darkness, that she wanted the guitar to be an orchestra on its own. She succeeds in diamonds. Beginning with &quot;Gone Again,&quot; and its opening roar of a Harley Davidson and her whip-smart slide playing becoming the timbre of the grain in her voice, the guitar becomes the poem, and her voice underlines, accents, and punctuates it. Block's agility and extension of blues form here is astonishing. Her slide work is effortless; it flies, stings, and stings. &quot;Sookie Sookie&quot; is a slide blues that rings with the same tension that John Fahey's best work did, but Block is more aggressive; she bends herself to the guitar's will. The lyrics delve deep into anger, brokenness, and the seeming impossibility of enduring love. But it is on Son House's &quot;County Farm Blues,&quot; &quot;Amazing Grace,&quot; and Robert Johnson's &quot;Last Fair Deal Gone Down&quot; and &quot;Traveling Riverside Blues&quot; that Block rips the lid off the blues: she hallows the tradition but turns it back on itself in her playing. Here are movements she's never made with her long, lithe hands on that neck. Digging deep into right-hand technique and allowing her left to sing at will, Block brings the archaic primitivism of the Delta into the 21st century like riding an unbroken horse -- but she leaves the wildness in. Block's own songs -- whether they be blues tunes such as gospel songs such as &quot;Declare,&quot; folk songs such as &quot;Cry Out Loud&quot; or &quot;Two Places at Table,&quot; combinations of virtually everything, such as &quot;Awesome Love&quot; -- stand as tall and tough as she does. They testify to the ferocity of a love so profound it can only be expressed as tenderness by a broken heart. Ultimately, this is the finest album of Block's long career, and yet it feels like a signpost of things to come. Last Fair Deal is potent, profound, medicine. (AllMusic)\n\nTrack list:\n01 - Gone Again\n02 - Sookie Sookie\n03 - Country Farm Blues\n04 - Last Fair Deal Gone Down\n05 - Declare\n06 - Cry Out Loud\n07 - Amazing Grace\n08 - Traveling Riverside Blues\n09 - Mama's Stray Baby\n10 - Hallelu, Hallelu\n11 - Two Places At A Table\n12 - Awesome Love\n13 - Look What The Lord Has Done\n14 - Old Friends\n\nEnjoy and share!","torrent":{"xt":"urn:btih:c3e191bacb0b28081ffb76a02311b770f2c0f9fa","amp;dn":"Rory+Block+-+2003+-+Last+Fair+Deal+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3e191bacb0b28081ffb76a02311b770f2c0f9fa","infoHashBuffer":{"type":"Buffer","data":[195,225,145,186,203,11,40,8,31,251,118,160,35,17,183,112,242,192,249,250]},"announce":[],"urlList":[]}}