{"title":"Hyperbranched Polymers - Synthesis, Properties, and Applications","uid":12427313,"size":22389944,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c888afad117d4834db22aa94f5c7ef87e4cd061d&amp;dn=Hyperbranched+Polymers+-+Synthesis%2C+Properties%2C+and+Applications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1442401679,"description":"Hyperbranched Polymers - Synthesis, Properties, and Applications (Wiley, 2011).pdf\n\nISBN 978-0-471-78014-4\n\nA much-needed overview of the state of the art of hyperbranched polymers\n\nThe last two decades have seen a surge of interest in hyperbranched polymers due to their ease of synthesis on a large scale and their promising applications in diverse fields, from medicine to nanotechnology.\n\nWritten by leading scientists in academia and industry, this book provides for the first time a comprehensive overview of the topic, bringing together in one complete volume a wealth of information previously available only in articles scattered across the literature. Drawing on their work at the cutting edge of this dynamic area of research, the authors cover everything readers need to know about hyperbranched polymers when designing highly functional materials. Clear, thorough discussions include:\n\nHow irregular branching affects polymer properties and their potential applications\n\nImportant theoretical basics, plus a useful summary of characterization techniques\n\nHow hyperbranched polymers compare with dendrimers as well as linear polymers\n\nFuture trends in the synthesis and application of hyperbranched polymers\n\nGeared to novices and experts alike, Hyperbranched Polymers is a must-have resource for anyone working in polymer architectures, polymer engineering, and functional materials. It is also useful for scientists in related fields who need a primer on the synthesis, theory, and applications of hyperbranched polymers","torrent":{"xt":"urn:btih:c888afad117d4834db22aa94f5c7ef87e4cd061d","amp;dn":"Hyperbranched+Polymers+-+Synthesis%2C+Properties%2C+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c888afad117d4834db22aa94f5c7ef87e4cd061d","infoHashBuffer":{"type":"Buffer","data":[200,136,175,173,17,125,72,52,219,34,170,148,245,199,239,135,228,205,6,29]},"announce":[],"urlList":[]}}