{"title":"World War II in HD Color","uid":11474991,"size":6257495549,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cd54a89f655592e0a2a6a91ecb786148fc076e5f&amp;dn=World+War+II+in+HD+Color&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"Tally-Ho","files":-1,"time":1416137973,"description":"A new collection of rare and unseen footage of World War II and the very latest colorization techniques come together in World War II In HD Colour. With satellite-delivered terrain mapping and state-of-the-art graphics, this new series reveals the epic conflict of the 20th century in a fresh light. Narrated by English actor Robert Powell, World War II In HD Colour is a vivid, in-depth experience that provides viewers with new insights and information. Newly divulged documents, files and photographs, code breaking revelations, and recently released government papers on both sides of the Atlantic add a different dimension to our understanding of the strategies and battles of World War II.\n\nBy using the very latest colorization techniques it is now possible to show the full story of World War II as it has never been fully seen before. Code breaking revelations and newly released government papers on both sides of the Atlantic have added a very insightful new dimension to the understanding of the world's greatest ever conflict. Worldwide television audiences will have the opportunity to view this epic struggle as never before.\n\nRegards,\n\nTally-Ho","torrent":{"xt":"urn:btih:cd54a89f655592e0a2a6a91ecb786148fc076e5f","amp;dn":"World+War+II+in+HD+Color","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd54a89f655592e0a2a6a91ecb786148fc076e5f","infoHashBuffer":{"type":"Buffer","data":[205,84,168,159,101,85,146,224,162,166,169,30,203,120,97,72,252,7,110,95]},"announce":[],"urlList":[]}}