{"title":"B I B L E - L I E S - Part 20 - The Real Truth - Did Giants or A","uid":11380879,"size":11823580075,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cdf49e0aadceb42ac76b92960163f106d1e2b038&amp;dn=B+I+B+L+E+-+L+I+E+S+-+Part+20+-+The+Real+Truth+-+Did+Giants+or+A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":-1,"time":1415214323,"description":"\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nB I B L E - L I E S - Part 20 - The Real Truth - Did Giants or Angels Build Them - Mystery of The Pyramids DVD\n\n\n\n\n\nDescription\n\nRecent Discoveries of Advanced Ancient Civilizations:\nLaboratory of Alternative History - Results of the LAH Expeditions from 2004-2011 (with Subtitles) by Andrey Sklyarov\n\nInternational Seminar\n&quot;Search for Traces of Technogenic Civilizations&quot;\nCairo, Egypt, December 13th-20th, 2011\n\nSummary: This video is a short summary of the results of the expeditions made by the Laboratory of Alternative History group by Andrey Sklyarov, who is a member of the LAH group in Moscow, Russia. His group of scientists, mathematicians, physicists and historians travels around the world in search of traces left by an advanced ancient civilization. They have traveled to many countries including Egypt, Peru, Bolivia, Mexico, and Greece, among many others. Here he talks about and shows photos of some of his most interesting finds which prove the existence of an advanced civilization on Earth in ancient times, most notably in Egypt, Peru and Bolivia. Some of the evidence discussed here details the use of advanced machining methods used in construction and the fabrication of various ancient objects.\n\nRussian to English translation, subtitles(Closed Captions), and voice narration\nby Kon K.\n\n** Correction at 5:39 : Pepi II (2284 BC - 2184 BC) was a pharaoh of the Sixth dynasty in Egypt's Old Kingdom. Therefore the phrase should be &quot;Dating back to the 2nd millennium BC or 4290 years ago&quot; instead of &quot;5500 years ago.&quot; Thanks to one of the commenters at unexplained-mysteries.com for pointing out the error.\n\nDepending on how this video is received, I may translate some of their other videos and lectures including a whole series on Peru and Bolivia as well as Egypt.\n\nThe author of this translation is not affiliated in any way with Laboratory of Alternative History.  Download video and subtitles (MP4 and SRT format):\n---------------------------------------------------------------------------------------------------------------\n\nANCIENT MAN MADE TUNNELS - Underground Civilizations:\nHistory Channel's Ancient Man Made Tunnels - Underground Civilizations (full documentary episode). Who and why were they made? Many questions remain unanswered after viewing the pieces to this puzzle. thanks for watching.\n---------------------------------------------------------------------------------------------------------------\n\nMystery of the Sphinx:\nThe Mystery of the Sphinx, introduced American viewers to the discovery by John Anthony West and Robert Schoch that the Great Sphinx of Giza might be thousands of years older than its assumed date of 2500 BC. Narrated by Charlton Heston, the documentary provides evidence that the ancient Egyptians possessed scientific knowledge unknown to us and carried on the wisdom tradition of an earlier lost civilization.\n----------------------------------------------------------------------------------------------------------------\n\n\nGenesis 6 - Giants with Steve Quayle:\n----------------------------------------------------------------------------------------------------------------\n\nAlong with various short video clips dealing with the subjects.\n\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n\nMore Torrents in this series at http://conspiracyhub.com/membershares.php?it=41 ALL TORRENTS are RELEASED here FIRST!!! The First down loaders of my torrents get the Main Hookups on my SERVER. This will get lightning fast downloads, FOR FREE. (The High Speed download wholesalers are going to hate me)I upload to OVER 13 Torrent sites and this site is uploaded 1st.\n\n\nMay Yahweh Bless You as He has me. Seed long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \n\nDo Not believe anything you find here, search the Scriptures daily to determine the TRUTH.  Other Torrents in this Series at\n &lt;a href=&quot;\nhttp://conspiracyhub.com/membershares.php?it=41&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracyhub.com/membershares.php?it=41&lt;/a&gt;  \n\nGet info on the Take Over by The New World Order Below\n &lt;a href=&quot;\nhttp://www.khouse.org/topical_bible_study&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouse.org/topical_bible_study&lt;/a&gt;                                                       Free online Bible Study &lt;a href=&quot;\nhttp://www.babylonthegreatisfalling.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.babylonthegreatisfalling.net&lt;/a&gt;                                                            End Times Prophecy - Who is Babylon the Great\n                                                                                Listen to Alex Jones   Secular Truth &lt;a href=&quot;\nhttp://www.theberean.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theberean.org/&lt;/a&gt;                                                                               Daily Bible Study in Your Email &lt;a href=&quot;\nhttp://www.khouseafrica.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouseafrica.com/&lt;/a&gt;                                                                         Chuck Missler - Africa &lt;a href=&quot;\nhttp://www.store.khouse.org/store/catalog&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.store.khouse.org/store/catalog&lt;/a&gt;                                                       Chuck Missler - USA &lt;a href=&quot;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&lt;/a&gt;                                       Dehydrated Survival Food -  Excellent Taste &lt;a href=&quot;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&lt;/a&gt;          Chuck Missler - New Zealand, Australia, Pacific Rim\n \n\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n                                              :thankyou:    :thankyou:   Thank You JESUS","torrent":{"xt":"urn:btih:cdf49e0aadceb42ac76b92960163f106d1e2b038","amp;dn":"B+I+B+L+E+-+L+I+E+S+-+Part+20+-+The+Real+Truth+-+Did+Giants+or+A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdf49e0aadceb42ac76b92960163f106d1e2b038","infoHashBuffer":{"type":"Buffer","data":[205,244,158,10,173,206,180,42,199,107,146,150,1,99,241,6,209,226,176,56]},"announce":[],"urlList":[]}}