{"title":"Stepping Into The Fire -  Ayahuasca Documentary","uid":11597385,"size":568907602,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:cfca4447995b5d001cf50a1db44c389c883e4aae&amp;dn=Stepping+Into+The+Fire+-++Ayahuasca+Documentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"H2oDragon","files":2,"time":1417298537,"description":"Stepping Into the Fire\n  2011 84 min \n\nLysergic acid diethylamide (LSD), psilocybin mushrooms, and mescaline-bearing peyote are the more well-known psychoactive drugs, but by no means the only ones. Stepping Into the Fire is a documentary about a much lesser-known option in this arena, ayahuasca. The film follows two recent first-time takers of the drug, Bo and Rob. Bo being a rather straight-edge lifetime professional diagnosed with a terminal case of cancer in his esophagus, Rob a former stock broker accustomed to hard work and hard living along with his wife Donna and son Declan.\n\nAfter hearing about the potential transformative experience that can come from taking ayahuasca and tired of dealing with their lives in the way they currently were, they each set out for a shaman in Peru that is known for administering the ayahuasca experience.\n\nIn a series of interviews both subjects explain how much more &quot;in touch&quot; with themselves and their environments they were after that first go-round with the drug. Bo cites that it's not so much the taking of the drug itself, in which dimethyltryptamine (DMT) is the active ingredient, that heals you, but more how it opens you up the plant life and all the benefit they can bring you. Bo goes on to explain some of his experiences, thoughts, and breakthroughs achieved during that first experience - psychedelic visuals of the moon and facing long-forgotten love life regrets.\n\nRob describes the boon of the experience being that it allowed him to see the positives in even the most negative of situations in his life. That, and a realization that he was supposed to use his financial achievement to create a compound of sorts where others could comfortably gain access to the same enlightenment he feels he stumbled into. In doing this, he has expended his entire life savings and it's created a sizable rift between he and his wife.\n\nAttention then turns back to Bo, who has made a number of other changes in his life since trying ayahuasca. He has trimmed his diet to raw, unprocessed vegan cuisine that has resulted in a loss of around 90 pounds - one of numerous changes both men go through over the course of this film about what they deem the &quot;teaching plant.&quot;","torrent":{"xt":"urn:btih:cfca4447995b5d001cf50a1db44c389c883e4aae","amp;dn":"Stepping+Into+The+Fire+-++Ayahuasca+Documentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfca4447995b5d001cf50a1db44c389c883e4aae","infoHashBuffer":{"type":"Buffer","data":[207,202,68,71,153,91,93,0,28,245,10,29,180,76,56,156,136,62,74,174]},"announce":[],"urlList":[]}}