{"title":"2 Wolves - Shelter - (2014)","uid":11278806,"size":95218751,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d257cfbe03445064ed81bd9da7f15d60931f70e0&amp;dn=2+Wolves+-+Shelter+-+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"analogkid6103","files":9,"time":1414187899,"description":"2 Wolves - Shelter - (2014)\nInfo Hash:\td257cfbe03445064ed81bd9da7f15d60931f70e0\nDescription:\t2 Wolves is a gothic metal band from South Karelia, Finland. Since their formation in 2010, the band has released three studio albums. With elements from melodic death metal and doom metal, and inspiration from Finnish melancholy and nature, 2 Wolves create their sound. The band's latest album, &quot;Shelter&quot;, presents a more melodic approach to their style, with more emphasis on clean vocals. This theme album tells a tragic love story, set up in a haunted house scenery. The album's atmosphere progresses from light to dark, as the season changes from spring to autumn.\n\nFormation and debut album (2010-11)\n\nSinger Aleksi Susi and drummer Niko Pennanen formed 2 Wolves in Lappeenranta, 2010. After making one demo, the two-piece went to the studio to record their first album. In the studio, Pennanen played drums and bass, and Susi played everything else. The industrial-influenced album &quot;Gentlemen, Please&quot; was released in 2011. The name 2 Wolves originated from Aleksi's last name Susi, which translates to a wolf.\n\nMen of Honour (2012)\n\nAfter the release of their debut, Susi and Pennanen started working on new material and also wanted a live line-up for the band. At this point, Susi wanted to focus on songwriting and playing the guitar. So they needed another singer, guitarist and a bass player. The band soon expanded into a five-piece featuring Ilkka Valkonen on vocals, Ossi Viren on the guitar and Toni Rantala on the bass. They finished the new material as a group and released their second album &quot;Men of Honour&quot; the same year.\n\nFirst shows and Raventale (2013)\n\nFollowing the release of &quot;Men of Honour&quot;, the band was ready to hit the stages for the first time. Nine domestic shows were done overall. Since there was no album released that year, the band recorded their new song &quot;Raventale&quot; as a single, and made a music video of it.\n\nSinger's departure and Shelter (2014)\n\nIn early 2014, a few months into the work of the next album, Valkonen announced that he would quit the band. The rest of the group decided, that they would not try to find replacement for him. Instead, the band would continue as a four-piece with Susi on the harsh vocals, and Viren on the clean vocals. The band finished the material and recorded their third album &quot;Shelter&quot; with the new line-up.\n\n\nCode\nCurrent members:\n\nAleksi Susi (Harsh Vocals, Guitar, Programming, Keys)\n\nNiko Pennanen (Drums)\n\nOssi Viren (Clean Vocals, Guitar)\n\nToni Rantala (Bass, Backing Vocals)\n\nFormer members:\n\nIlkka Valkonen (Vocals)\n\n2 Wolves - Shelter\n\n\n\nTracklist:\n\n01. Freedom Of Two 04:46\n02. Surrounding Fields And Stars In The Sky 04:22\n03. Wake Of Beauty 05:12\n04. Scar Collection 05:06\n05. Visitors 04:33\n06. Serpentine Paths In The Autumn Night 05:05\n07. Shelter 02:25\n08. The Lake Of Black Swans 04:47\nGenre:\tDoom\nSubgenre:\tDoom / Melodic Metal\nBitrate:\t320 k\nSize:\t90.81 MB\nShow/Hide Files: \t\n9 files","torrent":{"xt":"urn:btih:d257cfbe03445064ed81bd9da7f15d60931f70e0","amp;dn":"2+Wolves+-+Shelter+-+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d257cfbe03445064ed81bd9da7f15d60931f70e0","infoHashBuffer":{"type":"Buffer","data":[210,87,207,190,3,68,80,100,237,129,189,157,167,241,93,96,147,31,112,224]},"announce":[],"urlList":[]}}