{"title":"Arzoo (1965) Xvid 2cd - Eng Subs - Rajendra Kumar, Sadhana [DDR]","uid":11601982,"size":1486131140,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d5130f5538abff4345d3305ac56709cb34280d11&amp;dn=Arzoo+%281965%29+Xvid+2cd+-+Eng+Subs+-+Rajendra+Kumar%2C+Sadhana+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"SaM","files":-1,"time":1417364349,"description":"Arzoo (1965) Xvid 2cd - Eng Subs - Rajendra Kumar, Sadhana [DDR]\n\nArzoo 1965  is a Bollywood film directed by Ramanand Sagar. \nIt stars Sadhana, Rajendra Kumar, and Feroz Khan in the lead roles. It was a success at the box office.\nArzoo is the story of a love that triumphed over life and fate. \nThe theme of 'hating the disabled' was also tried in Rajashri films' 'Ek Baar Kaho' starring Navin Nischol and Shabana Azmi, but it did not work.\n\nCAST:- Rajendra Kumar, Sadhana, Feroz Khan, Mehmood, Nazima, Nasir Hussain (II), Achala Sachdev, Dhumal, Nana Palsikar, Hari Shivdasani, Daisy Irani, Brahm Bhardwaj, Jankidas, Narbada Shankar, Praveen Paul, Paro, Keshav Rana\t\n\nDirected by Ramanand Sagar\nProduced by Ramanand Sagar\nMusic by Shankar Jaikishan\nLyricist: Hasrat Jaipuri\nPlayback Singers:- Lata Mangeshkar, Asha Bhosle, Mohammed Rafi, Mubarak Begum, Balbir\n\nSongs are included in MP3s\nArzoo (1965) 00. Title Music and Screen Credits, SHankar-Jaikishan\nArzoo (1965) 01. Ae Nargise Mastana Bas Itni Shikayat Hai , Rafi, Hasrat Jaipuri, Shankar - Jaikishan\nArzoo (1965) 02. Aji Rooth Kar Ab Kahan Jaiyega, Lata, Hasrat Jaipuri, Shankar - Jaikishan\nArzoo (1965) 03. Aji Humse Bachkar Kahan Jaiyega, Rafi, Hasrat Jaipuri, Shankar - Jaikishan\nArzoo (1965) 04. Ae Phoolon Ki Rani Baharon Ki Malika, Rafi, Hasrat Jaipuri, Shankar - Jaikishan\nArzoo (1965) 05. Chhalke Teri Aankhon Se Sharab Aur Zyada, Rafi, Hasrat Jaipuri, Shankar - Jaikishan\nArzoo (1965) 06. Bedardi Baalma Tujhko Mera Man Yaad Karta Hai, Lata, Hasrat Jaipuri, Shankar - Jaikishan\nArzoo (1965) 07. Jab Ishq Kahin Ho Jata Hai, Asha Bhosle, Mubarak Begum, Hasrat Jaipuri, Shankar - Jaikishan\n\nSYNOPSIS:- Arzoo (1965)\nGopal (Rajendra Kumar) is a skiing champion. He meets Usha (Sadhana) on his holidays at Jammu and Kashmir with the fake name Sarju. Then they both fall in love. One day, Usha tells Gopal that she does not like the disabled. According to her instead of living a life of disabled, it is better to die. After spending his holidays in Kashmir and promising Usha that he will marry her, he heads back to Delhi, where his parents and a sister, Sarla, live. Along the way, he loses his a leg in a car accident. Gopal becomes worried. Since he remembers the words of Usha, he tries to avoid her to go away from her life. He thinks Usha will not accept him as he is now disabled. Then he goes back to Delhi and he does not tell anything about Usha. In the meantime, Usha tries a lot to find him, but after having no sign of him, she begins to think that Gopal is in some trouble and hence unable to contact her.\n\nGopal's best friend, Ramesh (Feroz Khan), unknowing about his friend's love story, wants to marry Usha. After saying &quot;no&quot; several times, at Usha's father accepts on her behalf and Usha dutifully agrees to the marriage as well. But on the day of her wedding, one miracle happens in the form of Kashmir Houseboat owner Mangloo (Mehmood) and initially Ramesh and then Usha find out that Gopal and Sarju are not two persons, but one. Then this situation forms the climax of the movie.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: Xvid ISO MPEG-4\nVideo Bitrate: 437 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: Hindi\nRunTime: 2:55:37\nSubtitles: English\nRipped by: Trinidad [DDR]     \nDuration: 176 mins","torrent":{"xt":"urn:btih:d5130f5538abff4345d3305ac56709cb34280d11","amp;dn":"Arzoo+%281965%29+Xvid+2cd+-+Eng+Subs+-+Rajendra+Kumar%2C+Sadhana+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5130f5538abff4345d3305ac56709cb34280d11","infoHashBuffer":{"type":"Buffer","data":[213,19,15,85,56,171,255,67,69,211,48,90,197,103,9,203,52,40,13,17]},"announce":[],"urlList":[]}}