{"title":"Slide Guitar for Blues Lap Style - Vol 1&amp;2 - Bob Brozman","uid":12444408,"size":2353613146,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:db338a3e18815467696be9b1af5a0ca98bc0a48f&amp;dn=Slide+Guitar+for+Blues+Lap+Style+-+Vol+1%26amp%3B2+-+Bob+Brozman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"obys","files":35,"time":1442612119,"description":"Bob Brozman uses a variety of instruments - a Weissenborn, a Dobro-type resophonic and a National steel - to teach the funky blues tunes, cool riffs and adventurous improvisations that he pulls from his seemingly bottomless bag of tricks. His course in lap style slide guitar will open up exciting musical ideas and powerful techniques for anyone who wants to get into the real blues sound. Playing in open D and open G tunings, Bob passes along all the sounds and techniques that make up this compelling style. He teaches pieces that range from the primitive one-chord renditions of Charlie Patton to modern-day country/swing blues. You'll get instruction in the use of the round-nose bar and how you can attain quality vibrato, pitch precision, good tone, blue notes, rhythmic effects and control of the slide. Bob details licks, turnarounds and improvisations along with numerous exercises and right hand picking drills to help you develop your picking strength. By the time you complete this lesson you'll have an arsenal of licks and the improvisational skills you'll need to go on to even more challenging material. Note: You can use any guitar to play this style, although it would be best to have one with a high action.\n\n------------------------------\n\nSlide Guitar for Blues - Lap Style\nVolumes 1 &amp; 2 \nMulti-region format DVD\n\nIn this two-volume series, Bob Brozman offers exciting musical ideas and powerful techniques for anyone who wants to get into the real blues sound. \n\nSlide Guitar for Blues - Lap Style\nVolume #1: The Basics and Beyond\nLevel 3, 60 min. \nIncludes tab. \nBob uses a variety of instruments to teach funky blues tunes, cool riffs and adventurous improvisations. Playing in open D and open G tunings, Bob passes along all the sounds and techniques that make up this compelling style. He teaches pieces that range from the &quot;deep roots&quot; one-chord renditions of Charlie Patton to modern-day country/swing blues. \n\nYou'll get instruction in the use of the round-nose bar and how you can attain quality vibrato, pitch precision, good tone, blue notes, rhythmic effects, and control of the slide. Bob details licks, turnarounds, and improvisations along with numerous exercises and right hand picking drills to help you develop your picking strength. \n\nSlide Guitar for Blues - Lap Style\nVolume #2: Advanced Techniques\nLevel 3, 60 min. \nIncludes tab. \nBob takes lap blues playing to the next level. Starting off in G tuning (you'll also learn open C and D minor), Bob concentrates on the deep blues &quot;Delta notes.&quot; He runs through &quot;sharpening&quot; exercises using bar hammer-ons combined with open strings and alternate pick strokes; drills designed to help you get your rhythm together; and practice jumps and slides to allow you to play faster without sacrificing tone. \n\nBob explores the blues classic Rolling and Tumbling, starting with a stripped down version and then taking it to increasingly more challenging levels. You'll learn numerous turnarounds and get plenty of play-along examples for great practice sessions. \n\nMore advanced moves follow as you learn how to maintain a steady bass groove while keeping country/swing blues rhythm and melody going. You'll employ two-hand damping to get staccato chords to contrast with melody notes, harmonics, sweep picking, raking and other special effects","torrent":{"xt":"urn:btih:db338a3e18815467696be9b1af5a0ca98bc0a48f","amp;dn":"Slide+Guitar+for+Blues+Lap+Style+-+Vol+1%26amp%3B2+-+Bob+Brozman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db338a3e18815467696be9b1af5a0ca98bc0a48f","infoHashBuffer":{"type":"Buffer","data":[219,51,138,62,24,129,84,103,105,107,233,177,175,90,12,169,139,192,164,143]},"announce":[],"urlList":[]}}