{"title":"Unrest: Special Edition (GOG)","uid":12420303,"size":2412214380,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:de7133f2187f9b5eb3cd569d9d0e1d57c4af0923&amp;dn=Unrest%3A+Special+Edition+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mercs215","files":11,"time":1442290310,"description":"Install instructions:\n1. Run &quot;setup_unrest_2.0.0.1&quot;\n2. Play\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS GAME! :)\nIf you like this game, support the developers and BUY IT!\n\nTitle: UNREST SPECIAL EDITION\nGenre: Role-playing - Adventure - Fantasy\nWorks on: Windows (XP, Vista, 7, 8, 10)\nLanguages: Audio and text: English\nModes: Single-player\nReleased: July 23, 2014\nSize: 722.8 MB\nCompany: Pyrodactyl Games / Kiss\nStore page: http://www.gog.com/game/unrest_special_edition\n\nAbout:\nIncludes Unrest and Unrest: Special Edition Upgrade.\nSet in a fantasy interpretation of ancient India, Unrest is an adventure RPG focused on story and choices. Play as five ordinary people who are struggling to get by in the in the famine-stricken city-state of Bhimra.\nBrave poverty, disease, treason, political and social upheaval. Face unique burdens and gripping dilemmas as you struggle to survive in each chapter...but choices made to help one character may well make life harder for another.\nIn Unrest, there are no heroes of legend, there is no mystical quest, and fate has not chosen you. You're on your own.\nPlay as a peasant girl faced with an arranged marriage, a priest troubled by his radical temple, a slum dweller with a dangerous past, an ambassador from a militant nation, and a mercenary captain far out of his depth - all as part of the same narrative.\nHard decisions made in one chapter have consequences in the next. A choice made as one character may well determine the fate of another.\nThere are no fail states in Unrest - if a character dies or fails in their objectives, that becomes part of the narrative.\nOrganic, branching dialogues designed to offer an unparalleled level of control and involvement to the player.\nCombat is rare and always avoidable. When faced with the possibility of death, it's up to you to decide how much you're willing to risk.\nLush hand-drawn sprites and environments combined with a classical Indian soundtrack perfectly echoes the narrative's emotional core.\nMod support allows you to create and share your own worlds and adventures.\n\nMinimum system requirements - Windows: Windows XP SP2 / Vista / 7 / 8 / 10, Processor: 2 GHz Intel Core i3 or AMD equivalent, Memory: 2 GB RAM, Graphics: DirectX 9 or OpenGL 2.1 compatible graphics card with 1 GB memory (Intel cards are not supported), Hard Drive: 1 GB available space","torrent":{"xt":"urn:btih:de7133f2187f9b5eb3cd569d9d0e1d57c4af0923","amp;dn":"Unrest%3A+Special+Edition+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de7133f2187f9b5eb3cd569d9d0e1d57c4af0923","infoHashBuffer":{"type":"Buffer","data":[222,113,51,242,24,127,155,94,179,205,86,157,157,14,29,87,196,175,9,35]},"announce":[],"urlList":[]}}