{"title":"Na Rubu Znanosti - 2014-10-27 - Fraktalni crtezi.avi","uid":11308889,"size":402039532,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:df52aa05f87735e82fdc226e910a07e5fe3e87cf&amp;dn=Na+Rubu+Znanosti+-+2014-10-27+-+Fraktalni+crtezi.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"donatius","files":1,"time":1414455070,"description":"Na rubu znanosti: Fraktalni crtezi\n\n\nPodsvijest je bunar iz kojeg izviru nasi dozivljaji svijeta i samih sebe, a to znaci i sreca, probljemi, bolesti, ali i rjesenja. Podsvijest je to ogledalo u koje je potrebno zaviriti da bismo vidjeli prave sebe. Ali kako to uciniti uz toliko buke koju stvaraju nasi umovi? Umjetnost je oduvijek bila kanal konumikacije s podsvjesnim sadrzajima, a ta spoznaja predstavlja temelj metodama art-terapija. Jednom vidu art-terapije autori su klinicki psihologi i obiteljski terapeuti Polujahtova i Komov, a nazvali su je crtanjem fraktala. Bit fratkalne metode - koja se odnosi na podrucje medicine, psihologogije i pedagogogije - jest povezanost izmedju motorike ruku i covjekovih psihickih, psihofizioloskih sranja, jer su dozivljavanje i odabir boja usko povezani s covjekovim psihofizickim stanjem. Tako se fraktalna metoda moze koristiti za dijagnostificiranje psihofizioloskog zdravlja. Kako u crtezu vidjeti svoje unutarnje stanje, kako crkanjem doprijeti u dubine podsvijesti, koju boju odabrati i kako bojama unijeti sklad u svoj zivot, obrazlozit ce jedna od autorica metode crtanja fraktala, Tanzilija Zakirovna Polujahtova","torrent":{"xt":"urn:btih:df52aa05f87735e82fdc226e910a07e5fe3e87cf","amp;dn":"Na+Rubu+Znanosti+-+2014-10-27+-+Fraktalni+crtezi.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df52aa05f87735e82fdc226e910a07e5fe3e87cf","infoHashBuffer":{"type":"Buffer","data":[223,82,170,5,248,119,53,232,47,220,34,110,145,10,7,229,254,62,135,207]},"announce":[],"urlList":[]}}