{"title":"Mythos - The Complete Series","uid":11292451,"size":4070384056,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e41268be6116ff95db4c591934ceb0c63a3b34af&amp;dn=Mythos+-+The+Complete+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eclecticguy","files":31,"time":1414351951,"description":"Reviving this older torrent of mine as I can't find a complete set here on TPB... The MKV files include built-in subtitles and I've also added transcripts for each episode in accompanying text files. A good introduction to mythology for those interested in the subject...\n\n\nMythos - The Complete Series\n----------------------------\n\nJoseph Campbell, the late mythologist who became a household name among public television viewers in the 1980s, embarked on a series of final lectures for TV audiences before his death. The lectures were filmed and are presented here in the order and manner in which Campbell himself intended, with enhanced images and in minimally-edited form.\n\nSince time immemorial, humans have been passing &quot;life's lessons&quot; from generation to generation through their particular society's theology and folklore, or mythologies. According to Campbell, by examining the world's diverse mythologies you will find therein universal themes that are applicable and speak directly to all humankind. In Mythos, Campbell dissects a wide range of the world's mythologies. Rather than pointing out their superficial differences, he accentuates and embraces their similarities. It doesn't matter whether the myths are Greek, Indian, Egyptian, Native American, Judeo-Christian, or Arthurian in origin. Campbell explains it is their intrinsic themes that share a commonality: the trials of the hero, the cycle of life, death, and rebirth, the path to enlightenment, love, struggle, sacrifice, etc.\n\nClocking in at 14 hours, Mythos presents Joseph Campbell's vision of humankind's &quot;One Great Story.&quot; Campbell looks lively and wonderfully at ease in the familiar classroom setting discussing his life's passion. Those enchanted by what The Power of Myth introduced will be deeply satisfied with the epic, academic content of Mythos","torrent":{"xt":"urn:btih:e41268be6116ff95db4c591934ceb0c63a3b34af","amp;dn":"Mythos+-+The+Complete+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e41268be6116ff95db4c591934ceb0c63a3b34af","infoHashBuffer":{"type":"Buffer","data":[228,18,104,190,97,22,255,149,219,76,89,25,52,206,176,198,58,59,52,175]},"announce":[],"urlList":[]}}