{"title":"Victory At Sea 18of26 Two If by Sea VHSRip 720p Egilman","uid":11165485,"size":660610145,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:e5b02ef43b99c3db75b02206b6656fe04b7eb900&amp;dn=Victory+At+Sea+18of26+Two+If+by+Sea+VHSRip+720p+Egilman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Egilman","files":-1,"time":1412625075,"description":"Victory at Sea, a 26-episode series on World War II, premiered on the last Sunday of October 1952, and subsequent episodes played each Sunday afternoon (with two exceptions) through May 1953. Each half-hour installment dealt with some aspect of World War II naval warfare and highlighted each of the sea war's major campaigns: the Battle of the North Atlantic, the attack on Pearl Harbor, the Battle of Midway, antisubmarine patrol in the South Atlantic, the Leyte Gulf campaign, etc. Each episode was composed of archival footage originally accumulated by the U.S., British, Japanese or German navies. The footage was originally shot mostly in color but was carefully edited and organized to ameliorate the viciousness of war. The drama of the production was enhanced by the Leonard Graves driving voice-over narration and by Richard Rodgers's musical score.(score was arranged by Robert Russell Bennett who also was the conductor of the NBC Symphony Orchestra for this production)\n\nCompiled from over 60 million feet of  combat and newsreel footage, Victory at Sea won instant praise and loyal viewers. Television critics greeted it as a breakthrough for the young television industry. An entertaining documentary series that still provided a vivid record of recent history. The New York Times praised the series for its &quot;rare power&quot;; The New Yorker pronounced the combat footage &quot;beyond compare&quot;; and Harper's proclaimed that &quot;Victory at Sea created a new art form.&quot; It eventually garnered 13 industry awards, including a Peabody and a special Emmy. (the series has been criticized for some of it's historical accuracy and objectivity, but remembering that it is from the 50's, only seven years after the end of the war, you can give it a little leeway on that issue, Most of it still plays very well after all these years)\n\nThis release comes from my rip of the Embassy Home Entertainment VHS tapes, second release (1986 6 tape set. Very few people paid 20.00 per tape for the 1982 first 26 tape release). It is coded in x264 and AAC sound at 960x720p (4x3) resolution. It is duotone B&amp;W just like the original TV broadcast back in 1952 and I have done no alteration to the video or sound except for removing the Embassy VHS headers and trailers and converting the Mono soundtrack to Stereo..\n\n\n\nEpisode 18: Two If by Sea\n\nAired on March 8, 1953\n\nEpisode Eighteen covers the bloodiest invasion of the pacific war, Peleliu and Anguar in the Palau Islands. Many felt that this battle was a needless one. (including Admiral Halsey) The intent was to destroy the Japanese airfields and aircraft to prevent them from attacking the upcoming Leyte landings and protect MacArthurs left flank. This was accomplished easily by the first days naval bombardment, there were no other forces on the islands that could interfere in the Phillipines. The Islands were attacked by the 1st Marine Division and the 81st Infantry Division. The Marines landing on Peleliu met extremely stiff resistance once ashore, the Army on Anguar against light resistance, then transfered to Peleliu to assist the Marines. On 27 November, 1944 the island was declared secure, ending the 73-day long battle. The Marines suffered 30% casulties (and the 1st division was out of action until April of 1945) the Army 15% in securing the two islands. The 1st battalion of the 1st Marine RCT suffered 71% casulties over the course of six days. The First Marine RCT itself suffered 70% casulties before being relieved by the Army. The Islands were never used for any strategic purpose after their taking. The last Japanese surrendered on Peleliu April 22, 1947. Postwar statisticians calculated that it took US forces over 1500 rounds of artillery ammunition to kill each Japanese defender, and that during the course of the battle, the Americans expended 13.32 million rounds of 30-calibre, 1.52 million rounds of 45-calibre, 693,657 rounds of 50-calibre bullets, 118,262 hand grenades and approximately 150,000 mortar rounds. This was the first time the American forces faced the Japanese tactic of defense in depth rather than defending the beaches. It was a foretelling of what was to come on Iwo Jima, Okinawa and the Mainland of Japan.\n\nTechnical Specs (typical)\n\nVideo Codec:         : AVC\nVideo Bitrate:       : 3,192 kbps\nVideo Aspect Ratio:  : 1.33, (4x3)\nVideo Resolution:    : 960x720\nScan type            : Progressive\nAudio Codec:         : AAC LC\nAudio language:      : English\nAudio Bitrate:       : 128 kbps\nAudio Channels:      : 2 (stereo)\nRun-Time:            : 26.5 mn\nFramerate:           : 29.970 fps\nNumber of Parts:     : 26\nContainer            : MP4\nPart Size:           : 630 MiB\nSource:              : VHS-rip\nEncoded date         : 2014-09-28\nEncoded by:          : Egilman","torrent":{"xt":"urn:btih:e5b02ef43b99c3db75b02206b6656fe04b7eb900","amp;dn":"Victory+At+Sea+18of26+Two+If+by+Sea+VHSRip+720p+Egilman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5b02ef43b99c3db75b02206b6656fe04b7eb900","infoHashBuffer":{"type":"Buffer","data":[229,176,46,244,59,153,195,219,117,176,34,6,182,101,111,224,75,126,185,0]},"announce":[],"urlList":[]}}