{"title":"Brain Stimulator.avi","uid":11475898,"size":53984118,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:e5f94c1caf2526234d51690c14bb13576cc6f7af&amp;dn=Brain+Stimulator.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JohnS314","files":1,"time":1416147706,"description":"There's an Email SPAM campaign widely distributed which leads to a video with a player designed to restrict viewing to from beginning to end, with no skipping ahead. This torrent is a video capture of that into an AVI file which you can play in VLC or similar players and easily skip forward or back.\n\nThe subject is a method claimed to be instructions for a combination of easy exercise and food supplements to avoid and even reverse Alzheimer's and aging dementia. The pitch comes with a story that this is being suppressed by the &quot;elite&quot; and so is not available through regular medical channels. The video completes by offering to sell you this method. There's a &quot;put in cart&quot; button in the original video which is not carried forward in the AVI. However, a Google search leads to\n\n\nwhich offers to sell you a book and 2 CD's for $27, which looks like the same product. They offer a 60-day money-back guarantee.\n\nIf any of you actually buy this, I'd appreciate it if you left a comment here giving your evaluation, and in particular giving the number of pages in the book.\n\nIf it's not too many pages, you might consider converting the book to a PDF file and uploading it here, maybe along with images of the two CD's.\n\nIf it's a lot of pages, there are services which scan bound books (usually destroying the book). Google &quot;destructive book scanning.&quot; The first hit offers $0.06/page","torrent":{"xt":"urn:btih:e5f94c1caf2526234d51690c14bb13576cc6f7af","amp;dn":"Brain+Stimulator.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5f94c1caf2526234d51690c14bb13576cc6f7af","infoHashBuffer":{"type":"Buffer","data":[229,249,76,28,175,37,38,35,77,81,105,12,20,187,19,87,108,198,247,175]},"announce":[],"urlList":[]}}