{"title":"Morals and Dogma","uid":11415614,"size":2648509,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e66330e73f17d3aea99bc69617c871c06a294a01&amp;dn=Morals+and+Dogma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"HowdyDooDoo","files":-1,"time":1415576469,"description":"This is Albert Pikes' volume of 'lectures' on the esoteric roots of Freemasonry, specifically the 32-degree Scottish Rite. Until 1964, this book was given to every Mason completing the 14th degree in the Southern jurisdiction of the US Scottish Rite Freemasons. Masonic lectures are standard oral presentations given during initiation to a new degree. Lectures provide background material for initiates and the discuss duties of the degree in general terms. Pike states right off that half of the text is copied from other works. Unfortunately none of these quotes are properly cited, and in most cases it is only a shift in style which allows us to identify a quote. There are also lapses of fact and logic. So it would be a mistake to use this work as an authoritative source without additional research and critical thinking. That said, Morals and Dogma is a huge, rambling treasure-house of esoteric data, particularly on the Kabalah and ancient Mystery religions. Whether you just browse these pages or study it from one end to the other, this is a must-read book for anyone looking for long-lost knowledge","torrent":{"xt":"urn:btih:e66330e73f17d3aea99bc69617c871c06a294a01","amp;dn":"Morals+and+Dogma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e66330e73f17d3aea99bc69617c871c06a294a01","infoHashBuffer":{"type":"Buffer","data":[230,99,48,231,63,23,211,174,169,155,198,150,23,200,113,192,106,41,74,1]},"announce":[],"urlList":[]}}