{"title":"Powerman 5000 - Nobody's Real [promo].VOB","uid":11267986,"size":117387264,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e7750050b0143271f5b2ea391204d8e43c5933d9&amp;dn=Powerman+5000+-+Nobody%27s+Real+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1414049243,"description":"Powerman 5000 - Nobody's Real [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;Nobody's Real&quot; is an industrial metal song by Powerman 5000 featured on the album Tonight the Stars Revolt! and on the End of Days soundtrack. A music video was made in which a young boy discovers a robotic mask that grants him supernatural powers. On the band's &quot;Rockets &amp; Robots&quot; tour in early 2000, they performed the song in a modified version, for their encores. \n\nIn 1991, Spider (Spider One is the younger brother of fellow metal musician Rob Zombie) dropped out of art school, bought a cheap 4-track home studio and drum machine and recorded Much Evil with producer Lamar Lowder. Building on local success, Powerman 5000 was born. In 1993, longtime guitarist Adam 12 joined the band. In 1994 and 1995, Powerman released two independent records, True Force and The Blood-Splat Rating System. Both albums were local successes. In 1996, they performed on the second stage of Ozzfest and appeared in an episode of Beverly Hills, 90210 where David and Donna filmed a music video for their song &quot;Strike the Match&quot;.\n\nIn 1997, the band signed to Dreamworks Records and released a remastered edition of The Blood-Splat Rating System titled Mega!! Kung Fu Radio. The band toured, performing on the main stage at Ozzfest 1997 but have not appeared since. They released singles such as &quot;Organizized&quot; and &quot;Tokyo Vigilante #1&quot;. In 1999, guitarist M.33 (Mike Tempesta) joined the band as they got their biggest break. Creating a strange fusion of science fiction and &quot;Action Rock&quot;, they released Tonight the Stars Revolt!, which contained the hit singles &quot;When Worlds Collide&quot;, &quot;Nobody's Real&quot;, and &quot;Supernova Goes Pop&quot;. The album sold over a million copies.\n\n\nPowerman 5000 (sometimes abbreviated to PM5K) is an American rock band formed in 1991. The group has released seven albums over the course of their career and gained their highest commercial success with 1999's Tonight the Stars Revolt!, which reached No. 29 on the Billboard 200 album chart while spawning the top 40 hits &quot;When Worlds Collide&quot; and &quot;Nobody's Real&quot;. Their latest release, covers album Copies Clones &amp; Replicants, came out in 2011 through indie label Cleopatra Records, and the group is currently working on their next album. Frontman and only original member Spider One is the younger brother of fellow metal musician Rob Zombie.\n\nTheir newest album, Builders of the Future, was released on May 27, 2014. The band is set to play a co-headlining tour in the US with Wayne Static in November with American Head Charge supporting them.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Nobody's_Real&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Nobody's_Real&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/hACbdaaGe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/hACbdaaGe&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 4820kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 384kbps\n   Duration: 00:02:57\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.7\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee)","torrent":{"xt":"urn:btih:e7750050b0143271f5b2ea391204d8e43c5933d9","amp;dn":"Powerman+5000+-+Nobody%27s+Real+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7750050b0143271f5b2ea391204d8e43c5933d9","infoHashBuffer":{"type":"Buffer","data":[231,117,0,80,176,20,50,113,245,178,234,57,18,4,216,228,60,89,51,217]},"announce":[],"urlList":[]}}