{"title":"The Band - Stage Fright (1970) 2011 MFSL-SACD-DFF","uid":11564737,"size":1544631602,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e880c9d7897910137a1ee081716b7ef15c696424&amp;dn=The+Band+-+Stage+Fright+%281970%29+2011+MFSL-SACD-DFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hal4000","files":-1,"time":1416937187,"description":"\nThe Band was a Canadian-American roots rock group that originally consisted of Rick Danko (bass guitar, double bass, fiddle, trombone, vocals), Levon Helm (drums, mandolin, guitar, vocals), Garth Hudson (keyboard instruments, saxophones, trumpet), Richard Manuel (piano, drums, baritone saxophone, vocals) and Robbie Robertson (guitar, vocals). The members of the Band first came together as they joined rockabilly singer Ronnie Hawkins' backing group The Hawks one by one between 1958 and 1963.\n\nStage Fright, the Band's third album, sounded on its surface like the group's first two releases, Music From Big Pink and The Band, employing the same dense arrangements, with their mixture of a deep bottom formed by drummer Levon Helm and bassist Rick Danko, penetrating guitar work by Robbie Robertson, and the varied keyboard work of pianist Richard Manuel and organist Garth Hudson, with Helm, Danko, and Manuel's vocals on top. But the songs this time around were far more personal, and, despite a nominal complacency, quite troubling. Only &quot;All La Glory,&quot; Robertson's song about the birth of his daughter, was fully positive. &quot;Strawberry Wine&quot; and &quot;Sleeping&quot; were celebrations of indolence, while &quot;Time to Kill,&quot; as its title implied, revealed boredom while claiming romantic contentment. Several of the album's later songs seemed to be metaphors for trouble the group was encountering, with &quot;The W.S. Walcott Medicine Show&quot; commenting on the falseness of show business, &quot;Daniel and the Sacred Harp&quot; worrying about a loss of integrity, and the title song talking about the pitfalls of fortune and fame. &quot;The Shape I'm In&quot; was perhaps the album's most blatant statement of panic. the Band was widely acclaimed after its first two albums; Stage Fright seemed to be the group's alarmed response, which made it their most nakedly confessional. It was certainly different from their previous work, which had tended toward story-songs set in earlier times, but it was hardly less compelling for that. \n\nTracklist: \t\n1. &quot;Strawberry Wine&quot; \t                2:37\n2. &quot;Sleeping&quot;  \t                        3:19\n3. &quot;Time to Kill&quot;   \t                3:30\n4. &quot;Just Another Whistle Stop&quot; \t        3:56\n5. &quot;All La Glory&quot;   \t                3:39\n6. &quot;The Shape I'm In&quot;   \t        4.03\n7. &quot;The W.S. Walcott Medicine Show&quot;   \t3.05\n8. &quot;Daniel and the Sacred Harp&quot;   \t4:15\n9. &quot;Stage Fright&quot;   \t                3:45\n10. &quot;The Rumor&quot;   \t                4:15\n\nDSD-DFF files extracted with Scarletbook\nfrom the 2011 Hybrid Mobile Fidelity Sound Lab SACD\n\nMFSL-SACD-ISO-DFF-1Bit-2.8Mhz","torrent":{"xt":"urn:btih:e880c9d7897910137a1ee081716b7ef15c696424","amp;dn":"The+Band+-+Stage+Fright+%281970%29+2011+MFSL-SACD-DFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e880c9d7897910137a1ee081716b7ef15c696424","infoHashBuffer":{"type":"Buffer","data":[232,128,201,215,137,121,16,19,122,30,224,129,113,107,126,241,92,105,100,36]},"announce":[],"urlList":[]}}