{"title":"The Hardy Boys - The Mystery of the Applegate Treasure","uid":11207307,"size":4662579626,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e964949bbbe1e9e4b018b98c56946ebb9676c555&amp;dn=The+Hardy+Boys+-+The+Mystery+of+the+Applegate+Treasure&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Invader97","files":21,"time":1413237694,"description":"Much of this text is from Wikipedia. In the late 1950s, Disney contracted with the Stratemeyer Syndicate and Grosset &amp; Dunlap to produce two Hardy Boys TV serials which starred Tim Considine as Frank Hardy and Tommy Kirk as Joe Hardy.\n\nThe first of the serials, The Mystery of the Applegate Treasure, aired on The Mickey Mouse Club in 1956 during the show's second season. To appeal to the show's audience, the Hardy Boys were portrayed as younger than in the books, seeming to be 11 or 12 years old. The script, written by Jackson Gillis, was based on the first Hardy Boys book, The Tower Treasure, and the serial was broadcast in 19 episodes of 15 minutes each with production costs of $5,700.\n\nThis serial, The Mystery of the Applegate Treasure, was released as a two-DVD set as part of the sixth wave of Walt Disney Treasures on December 19, 2006. A second serial, The Mystery of Ghost Farm (an original story by Jackson Gillis), aired on The Mickey Mouse Club in 1957. But the second serial has not been released as a Walt Disney Treasures set.\n\nThis torrent contains two different video versions of The Mystery of the Applegate Treasure. One version is AVI and the other is MKV. In the MKV version, the two disc files each contain a bonus feature","torrent":{"xt":"urn:btih:e964949bbbe1e9e4b018b98c56946ebb9676c555","amp;dn":"The+Hardy+Boys+-+The+Mystery+of+the+Applegate+Treasure","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e964949bbbe1e9e4b018b98c56946ebb9676c555","infoHashBuffer":{"type":"Buffer","data":[233,100,148,155,187,225,233,228,176,24,185,140,86,148,110,187,150,118,197,85]},"announce":[],"urlList":[]}}