{"title":"Robert Cray - Smoking Gun [promo].VOB","uid":11267996,"size":299446272,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ed435e38a97e33e5f1d363591d651267b5b3e3aa&amp;dn=Robert+Cray+-+Smoking+Gun+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SgtRlee","files":-1,"time":1414049366,"description":"Robert Cray - Smoking Gun [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;Smoking Gun&quot; is a 1986 song by Robert Cray. It made #2 on the Mainstream Rock charts, and the next year made #22 on the Billboard Hot 100. In addition, for this song Cray was nominated for the 1987 MTV Video Music Awards for Best New Artist in a Video.\n\nThe song deals with infidelity.\n\nEd Hogan of AllMusic remarked that the song contained &quot;an arresting, up-tempo groove&quot; which &quot;ushered in the contemporary blues era with its respectful nod to the blues tradition while imparting the genre with an underlying airiness&quot;.\n\n\nRobert Cray (born August 1, 1953, Columbus, Georgia, United States) is an American blues guitarist and singer. A five-time Grammy Award winner, he has led his own band, as well as an acclaimed solo career.\n\nCray started playing guitar in his early teens. He attended Denbigh High School in Newport News, Virginia. By the age of twenty, Cray had seen his heroes Albert Collins, Freddie King and Muddy Waters in concert and decided to form his own band; they began playing college towns on the West Coast. In the late 1970s he lived in Eugene, Oregon, where he formed the Robert Cray Band and collaborated with Curtis Salgado in the Cray-Hawks. In the 1978 film National Lampoon's Animal House, Cray was the uncredited bassist in the house party band Otis Day and the Knights. After several years of regional success, Cray was signed to Mercury Records in 1982. Two albums on HighTone Records in the mid-1980s, Bad Influence and False Accusations, were moderately successful in the United States and in Europe, where he was building a reputation as a live artist. His fourth album release, Strong Persuader, produced by Dennis Walker, received a Grammy Award, while the crossover single &quot;Smokin' Gun&quot; gave him wider appeal and name recognition.\n\nHe was invited by Keith Richards to join the backing band for Chuck Berry in the 1987 film, Chuck Berry: Hail! Hail! Rock 'N' Roll, directed by Taylor Hackford.\n\nCray continues to record and tour. He appeared at the Crossroads Guitar Festival, and supported Eric Clapton on his 2006-2007 world tour. In Fargo, North Dakota, he joined Clapton on backup guitar for the Cream song &quot;Crossroads&quot;. In 2011, Cray was inducted to the Blues Hall of Fame.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Smoking_Gun_(song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Smoking_Gun_(song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/HAcbhaaGe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/HAcbhaaGe&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 7942kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD, 16 bits]\n   Duration: 00:04:08\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.7\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee)","torrent":{"xt":"urn:btih:ed435e38a97e33e5f1d363591d651267b5b3e3aa","amp;dn":"Robert+Cray+-+Smoking+Gun+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed435e38a97e33e5f1d363591d651267b5b3e3aa","infoHashBuffer":{"type":"Buffer","data":[237,67,94,56,169,126,51,229,241,211,99,89,29,101,18,103,181,179,227,170]},"announce":[],"urlList":[]}}