{"title":"Naruto Episode 4","uid":11582894,"size":49989286,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:efbb681c951e6b9b244ef85eeb9f35340586b91b&amp;dn=Naruto+Episode+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"deadskullman","files":2,"time":1417143130,"description":"As their class mates get to meet up with their Jonin instructors who will deem them genin, Team 7 are forced to wait for theirs. Eventually, with Naruto setting up a trap, he and his group meet their instructor: Kakashi Hatake. Appearing to be a slacker, Kakashi takes the day to let his students each introduce themselves and tell of their desires with Naruto stating his dream to become Hokage while Sasuke states his intent to restore his clan by killing someone. With the introductions over, Kakashi tells Team 7 that their test will begin tomorrow and that they are not to eat before then. The next day, forcing Team 7 to wait for him while revealing himself to be a skilled fighter, Kakashi explains the rules of the test that the students must attempt to take one of two bells from his person with two having a likely chance to pass while the remaining child will be sent back to the academy. While Sakura and Sasuke hide themselves away as the test begins, Naruto makes the bad move to face Kakashi with his Shadow Clone jutsu countered by Kakashi and then falling for a snare. Taking advantage of Kakashi lecturing Naruto about falling for obvious traps, Sasuke seemingly takes out instructor shuriken and kunai knives","torrent":{"xt":"urn:btih:efbb681c951e6b9b244ef85eeb9f35340586b91b","amp;dn":"Naruto+Episode+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efbb681c951e6b9b244ef85eeb9f35340586b91b","infoHashBuffer":{"type":"Buffer","data":[239,187,104,28,149,30,107,155,36,78,248,94,235,159,53,52,5,134,185,27]},"announce":[],"urlList":[]}}