{"title":"DigitalBlasphemy Wallpapers 2014","uid":11601129,"size":32174027525,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:efcb910981fc3fca9767c66a6f66e3c808ab1d70&amp;dn=DigitalBlasphemy+Wallpapers+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":-1,"time":1417354436,"description":"Upload date: 2014-11-30\n\nI've gathered (pretty much) the whole collection of DigitalBlasphemy wallpapers, sorted them by resolution and compressed each resolution directory in '.tar.xz' archives. I have mixed feelings about uploading this torrent considering the fact that the author of DigitalBlasphemy (Ryan Bliss) has wallpaper making as his sole income. Nevertheless, information wants to be free. I want to share this awesome collection with the world.\n\nRyan Bliss, I hope you can forgive me. Keep making awesome wallpapers. We all love them!\n\nIf you're not familiar with '.tar.xz' archives I can only assume you're using Windows. In that case I feel sorry for you, but you should still be able to extract these archives using either WinRAR or 7zip.\n\nEnjoy this epic collection, and for God's sake SEED THIS SHIT! Thanks everyone for making this possible :)\n\n\nPS: I'm including the Perl script I made to sort the image files by resolution. If you don't use Linux and don't understand Perl, you should leave this script alone and DON'T use it. Other than that, I hope it will be helpful to at least someone! Read the script before using it, and make a backup of the directory you're going to use it on. You need to have ImageMagick installed as the script uses 'identify' to figure out the resolution.\n\nI have merged this collection from 3 different sources to make sure it's as complete as possible. I don't personally have an account on DigitalBlasphemy.com, but if someone later wants to update (or add to) this collection or merge with another one. All you have to do is first of all use the 'resolution sorting script' in both of the directories you're going to merge, then use 'rsync':\n\nrsync --verbose --whole-file --recursive --ignore-existing --progress SRC_DIR/ DEST_DIR/\n\nThe source directory is the directory you're comparing the destination directory with, to see if it is complete. Don't forget the slashes at the end of directory names when using rsync. Make backups before using my script or rsync.\n\nFinally, use 'fdupes' to get rid of duplicate files:\n\nfdupes --recurse --delete --noprompt","torrent":{"xt":"urn:btih:efcb910981fc3fca9767c66a6f66e3c808ab1d70","amp;dn":"DigitalBlasphemy+Wallpapers+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efcb910981fc3fca9767c66a6f66e3c808ab1d70","infoHashBuffer":{"type":"Buffer","data":[239,203,145,9,129,252,63,202,151,103,198,106,111,102,227,200,8,171,29,112]},"announce":[],"urlList":[]}}