{"title":"Savan - Protos (2014) {FLAC}","uid":11390398,"size":508625351,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f10cc8e57e243dbbce743c7d26ea1fcf21ea25fc&amp;dn=Savan+-+Protos+%282014%29+%7BFLAC%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":-1,"time":1415318888,"description":"So I was looking for this album in FLAC here, but I didn't find it, even though the uploader of one of the 320 kbps torrents said he's gonna post it in FLAC later, but he didn't do it so far, but luckily I found it on some random random uploading site (a rather crappy one btw).\n\nI did a spectral analysis to check if the FLACs are legit, not just some reencoded mp3 crap, and as far as I can tell they are proper FLACs. I checked all the files, so you don't have to worry about that if you have some exotic sort of autism.\n\nIf you wanna check them yourself, you should download the free as in freedom software named audacity, open the file and click the thingy on the left of the track where it shows its name and select &quot;spectrogram&quot;. You might have to right-click a few times on the scale which shows things like &quot;8k&quot; to see everything up to 22 kHz. You should look for a frequency cut-off somewhere around 20 kHz and a shelf circa 16 kHz, obiously, the worse the quality, the lower these numbers are.\nIf you want to know more about it, check the guide at whatinterviewprep.com\n\nOh, and if you\n1) like the music,\n2) have some disposable money,\nTHEN FUCKING BUY IT (but please, for the love of god, not on iTunes, because that also supports crAppleâ„¢)\n\n\nP.S.: remember the six million Jews who died in the tragic event known as the Holocaust.\n\nP.P.S.: don't worry if there are no seeders, it just means I'm offline atm, but I'll seed indefinitely (internet is cheap here in Zimbabwe)","torrent":{"xt":"urn:btih:f10cc8e57e243dbbce743c7d26ea1fcf21ea25fc","amp;dn":"Savan+-+Protos+%282014%29+%7BFLAC%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f10cc8e57e243dbbce743c7d26ea1fcf21ea25fc","infoHashBuffer":{"type":"Buffer","data":[241,12,200,229,126,36,61,187,206,116,60,125,38,234,31,207,33,234,37,252]},"announce":[],"urlList":[]}}