{"title":"Christian Zionism. Armageddon pdf Stephen Sizer","uid":11571537,"size":8540649,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f20c7b87c3792bd3a392c9d9fe2765b6cbf75ce3&amp;dn=Christian+Zionism.+Armageddon+pdf+Stephen+Sizer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"UnviolentPeacemaker","files":2,"time":1417034554,"description":"Noam Chomsky:  If you don't stop Chr'stian Zionists... you will not free Palestine.  The Chr'stian Zionist lobby at 50-100 million Americans is 5 to 10 times the factor with the US Congress that AIPAC is.  Paraphrase\n\nTwo MUST SEE videos on Chr'stian Zionism:\n\n1.  Stephen Sizer-Christian Zionism-Road Map to Armageddon\n\n\n2.  The Roots of Christian Zionism: How Scofield Sowed Seeds of Apostasy \n\n\nThe term &quot;Zionism&quot; was first coined in the late nineteenth century, and referred to the movement for the return of the Jewish people to an assured and secure homeland in Palestine. Ironically, this vision was largely nurtured and shaped by Christians long before it received widespread Jewish support. The origins of &quot;Christian Zionism&quot; lie within nineteenth-century British premillennial sectarianism, but by the early twentieth century it had become a predominantly American dispensational movement, and pervasive within all main evangelical denominations. The contemporary Christian Zionism movement emerged after the &quot;Six Day War&quot; in Israel in 1967, and it has had a significant influence on attitudes towards the ongoing Palestinian-Israeli conflict in the Middle East. Evangelicals are increasingly polarized over whether Christian Zionism is biblical and orthodox or unbiblical and cultic. In this book Stephen Sizer provides a thorough examination of the historical development, variant forms, theological emphases and political implications of Christian Zionism. His excellent and informative survey is interwoven with critical assessment that repudiates both nationalistic Zionism and anti-Semitism.\n\nReview\n&quot;This is an excellent resource on one of the most important issues of our day. Everything from the introduction to the glossary is most helpful for anyone who wishes to understand the important spiritual and political implications of this powerful but largely unnoticed sect. In particular, Sizer's theology section is a startling eye-opener for Christians who put the Gospels at the heart of their faith.&quot; (Greg Brownfield, Christian Zionism Task Leader, ELCA Chicago Metro Synod Working Group in the Middle East)\n\n&quot;In the past quarter-century, evangelical fundamentalist Christian Zionism has developed into a major theological movement and has made a significant political impact in the United States. Its effect upon the Arab-Israeli conflict continues to increase yearly. Unfortunately, many Christians and non-Christians possess little knowledge of this phenomenon. Stephen Sizer's book is without doubt the best and most comprehensive analysis to date about Christian Zionism; it deserves to be read seriously.&quot; (Norton Mezvinsky, University Professor of History, Central Connecticut State University)\n\n&quot;No Christian leader or layperson who is interested in biblical, theological or political matters related to the Middle East or to Israel's part in its future can afford not to read this volume.&quot; (Dr. Ronald Youngblood, Chairman of the Board of Directors of International Bible Society)\n\n&quot;Stephen Sizer's work on Christian Zionism is the most important and comprehensive on the subject to date, and should be read by all students of the Middle East and by Christians concerned about a just resolution to the Palestinian-Israeli conflict. Christian Zionism raises vital theological and political challenges that must be addressed head-on by Christians in the West, particularly evangelicals.&quot; (Don Wagner, Professor of Religion and Middle Eastern Studies, North Park University, Chicago, Illinois)\n\n&quot;Christian Zionism slices through some of the terribly muddy thinking regarding modern-day Israel and the last times which seems to characterize the majority of American evangelicalism. The author is to be congratulated on the clarity of presentation as well as the courage it takes to present it!&quot; (Bruce A. McDonald, Visiting Professor of Religion, Texas Wesleyan University)\n\n&quot;When the lines are not clearly drawn and premillennialism is confused with Christian Zionism, the book Christian Zionism: Road-map to Armageddon? is essential reading. Stephen Sizer goes into the historical roots, the theological arguments and the political implications of Christian Zionism.&quot; (Nabeel T. Jabbour, Visiting Professor at Columbia Biblical Seminary, Tyndale Seminary, Western Seminary and Whitworth College)\n\n&quot;Fantastic! I'm grateful for this book's advocacy of the church as the Bride, instead of Israel the bride and the bhurch the concubine.&quot; (Gilbert Bilezikian)\n\n&quot;If any book deserves the accolade of being the definitive critique of Christian Zionism, it is this. Popular, lucid and readable, this is a dispassionate and scholarly yet critical evaluation of the phenomenon.&quot; (Dr. Anthony McRoy, lecturer in Islamics, Evangelical Theological College, Wales)\n\n&quot;I am glad to commend Stephen Sizer's groundbreaking critique of Christian Zionism. His comprehensive overview of its roots, its theological basis and its political consequences is very timely. I myself believe that Zionism, both political and Christian, is incompatible with biblical faith. Stephen's book has helped to reinforce this conviction.&quot; (Rev. John Stott, Rector Emeritus, All Souls, Langham Place, London, principal framer of the Lausanne Covenant (1974), founder of the Langham Partnership International and author of more than 40 books)\n\n&quot;I commend Stephen Sizer's important and prophetic book in calling evangelical Christians, in particular, to break the spiral of violence and hatred. Instead we must obey the teachings of the Prince of Peace who has called us to a ministry of reconciliation rather than listen to the false prophets of Armageddon whose apocalyptic message is in danger of becoming a self-fulfilling prophecy.&quot; (The Right Revd. Riah Abu El Assal, Episcopal Bishop of Jerusalem, and author of Caught in Between)\n\n&quot;Sizer's book is essential reading for any Western evangelical trying to understand the religious dimensions of American support for Israel. He shows with exacting clarity how evangelical eschatology has now embedded itself in a modern political ideology. One quick read of this book will change anyone's perspective on the Middle East permanently.&quot; (Gary M. Burge, Professor of New Testament, Wheaton College and Graduate School)\n\n&quot;Sizer's masterly overview of Christian Zionism opens our eyes to a theology that manipulates, oppresses and shows no dignity or justice to Jew or Palestinian. It is time for a theology that values all equally instead of one that sees God as biased.&quot; (Garth Hewitt, Amos Trust)\n\n&quot;Sizer's work on Christian Zionism is the most important and comprehensive on the subject to date, and should be read by all students of the Middle East and by Christians concerned about a just resolution to the Palestinian-Israeli conflict. Christian Zionism raises vital theological and political challenges that must be addressed head-on by Christians in the West, particularly evangelicals. The impact of this terribly misguided movement is increasingly putting Christians in the Middle East at risk, and it seems a far cry from the witness and message of Jesus Christ.&quot; (Don Wagner, Professor of Middle Eastern Studies, North Park University, Chicago)\n\n&quot;A masterly and highly readable analysis of the history, the world-view and the political implications of Christian Zionism. Sizer has thrown down the gauntlet in a way that demands a response from those who support the state of Israel for theological reasons.&quot; (Colin Chapman, visiting lecturer, Near East School of Theology, Lebanon)\n\nAbout the Author\n\nStephen Sizer is the vicar of Christ Church, Virginia Water, Surrey (England), and a visiting lecturer at Wycliffe Hall, Oxford, and various other seminaries and theological colleges in the United States, Britain and the Middle East. He is chairman of the International Bible Society U.K. and a director and trustee of the Amos Trust, Friends of Sabeel and Highway Projects. Sizer is the author of A Panorama of the Bible Lands and In the Footsteps of Jesus and the Apostles. He has written extensively on the church in the Middle East, the ethics of pilgrimages, dispensationalism and Christian Zionism. He is a frequent visitor to the Middle East.\n\nDavid Peterson was senior research fellow and lecturer in New Testament at Moore Theological College, Sydney, where he still teaches part time. He served as principal of Oak Hill College, London, from 1996 to 2007. His books include Engaging with God, Possessed by God (both IVP) and Hebrews and Perfection (Cambridge University Press)","torrent":{"xt":"urn:btih:f20c7b87c3792bd3a392c9d9fe2765b6cbf75ce3","amp;dn":"Christian+Zionism.+Armageddon+pdf+Stephen+Sizer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f20c7b87c3792bd3a392c9d9fe2765b6cbf75ce3","infoHashBuffer":{"type":"Buffer","data":[242,12,123,135,195,121,43,211,163,146,201,217,254,39,101,182,203,247,92,227]},"announce":[],"urlList":[]}}