{"title":"Jan Pehchan (1950) MHCe DVD5 - No Subs - Raj Kapoor, Nargis [DDR","uid":11490774,"size":4640711389,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f5789df1bfbfe68b907e33c117c6a5beda9daf0d&amp;dn=Jan+Pehchan+%281950%29+MHCe+DVD5+-+No+Subs+-+Raj+Kapoor%2C+Nargis+%5BDDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1416260017,"description":"Jan Pehchan (1950) MHCe DVD5 - No Subs - Raj Kapoor, Nargis [DDR]\n\nCAST:- Raj Kapoor, Nargis, Jeevan, Shyama, Sankatha, Amir Banu, Mukri\n\nProduced by ali Mistry, Robin Catterjee\nDirector: Fali Mistry\nMusic Director: Khemchand Prakash, Manna Dey\nLyricist: Shakeel Badayuni\t\n\nSongs are included in MP3s\t\nJan Pehchan (1950) 00. Title Music and Screen Credits, Kemchand-Manna Dey\nJan Pehchan (1950) 0Bhoolne Wale Tujhe Apni Jafaon Ki Kasam, Geeta Roy, Shakeel Badayuni, Khemchand- Manna Dey\nJan Pehchan (1950) 0Pardesi Se Lag Gayi Preet Re, Geeta Roy, Shakeel Badayuni, Khemchand- Manna Dey\nJan Pehchan (1950) 0Duniya Mohabbat Karne Na Degi, Geeta Roy, Shakeel Badayuni, Khemchand- Manna Dey\nJan Pehchan (1950) 0Nain Mila Ke Dil Chheena, Geeta Roy, Shakeel Badayuni, Khemchand- Manna Dey\nJan Pehchan (1950) 0Hum Kyon Batayen Tumse Kyon Door Ho Gaye Hain, Shankar Dasgupta, Shakeel Badayuni, Khemchand- Manna Dey\nJan Pehchan (1950) 0Zamana Ulfat Ke Gun Gaaye, Rajkumari, Shakeel Badayuni, Khemchand- Manna Dey\nJan Pehchan (1950) 0Aaoge Naa Saajan, Geeta Roy, Shakeel Badayuni, Khemchand- Manna Dey\nJan Pehchan (1950) 0Dukh Se Bhara Hua Hai Dil, Shankar Dasgupta, Shakeel Badayuni, Khemchand- Manna Dey\nJan Pehchan (1950) 0Armaan Bhare Dil Ki Lagan Tere Liye Hai, Geeta Roy, Talat Mahmood, Shakeel Badayuni, Khemchand- Manna Dey\n\nSYNPSIS:- Jan Pehchan (1950)\nAsha lives a poor lifestyle in a village in India along with her mom and blind dad. When her mom passes away, her dad re-marries another woman, Rukmini, who is cruel and abusive toward Asha as well as makes her do all the work - indoors and out. Rukmini would like Asha to get married to a semi-senile villager, Lallu, an engagement date is fixed but is subsequently postponed as the date was deemed inauspicious. Shortly thereafter the entire village is agog with the news that Asha is pregnant. A man named Jeevan comes forward to claim her as his bride and she moves in with him. Little do the villagers and Asha parents' know that Asha has been intimate with an attractive and wealthy artist by the name of Anil. But since Anil has met with an accident, he is disfigured, possibly for life, and knowing that Asha will dump him as he is not attractive anymore, decides not to return. How long will Asha continue to live with Jeevan, and what will be the outcome of her child?\n\nAnil, an artist, comes to stay in a village with his friend Jeevan. While there he meets Asha and asks her to model for his statue. The two fall in love. They marry secretly but Anil must leave as his father is dying. While on the way back his car crashes and he is disfigured. Anil is now reluctant to go to Asha in case she no longer loves him, while meanwhile Asha is pregnant and being shamed by the villagers.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 6188 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: Hindi\nRunTime: 1:56:11\nSubtitles: None\nRipped by: Trinidad [DDR]   \nDuration: 116 mins","torrent":{"xt":"urn:btih:f5789df1bfbfe68b907e33c117c6a5beda9daf0d","amp;dn":"Jan+Pehchan+%281950%29+MHCe+DVD5+-+No+Subs+-+Raj+Kapoor%2C+Nargis+%5BDDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5789df1bfbfe68b907e33c117c6a5beda9daf0d","infoHashBuffer":{"type":"Buffer","data":[245,120,157,241,191,191,230,139,144,126,51,193,23,198,165,190,218,157,175,13]},"announce":[],"urlList":[]}}