{"title":"The Sea Hawk - The Classic Film Scores of Erich Wolfgang Korngol","uid":11499165,"size":405969112,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f637d05fb0c6e3d77ee2b323701d15f15e2c1d4b&amp;dn=The+Sea+Hawk+-+The+Classic+Film+Scores+of+Erich+Wolfgang+Korngol&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"metro369","files":11,"time":1416320349,"description":"The film music of Erich Wolfgang Korngold is cherished by movie fans and classical listeners alike, for the composer inhabited both worlds and left rich legacies in each. While Korngold's operas and concert music established him as one of Europe's masters in the years leading up to World War II, he had to reinvent himself for his sojourn in Hollywood and became one of the most sought-after composers of film music. Even though his style had to change with the needs of the films he scored, notably emphasizing the heroic vein in The Adventures of Robin Hood, Captain Blood, and The Sea Hawk, much of his music retained the lush harmonies and tender lyricism of his earlier works, and not all of his scores were designed around brass fanfares. For this RCA release, Charles Gerhardt and the National Philharmonic Orchestra of London present Korngold's best-known movie themes in vibrant sound and the brilliant orchestration of these scores comes across in these carefully engineered recordings, which were produced in 1972 by the composer's son, George Korngold. This disc is recommended to anyone interested in sampling the film music in one convenient and affordable package","torrent":{"xt":"urn:btih:f637d05fb0c6e3d77ee2b323701d15f15e2c1d4b","amp;dn":"The+Sea+Hawk+-+The+Classic+Film+Scores+of+Erich+Wolfgang+Korngol","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f637d05fb0c6e3d77ee2b323701d15f15e2c1d4b","infoHashBuffer":{"type":"Buffer","data":[246,55,208,95,176,198,227,215,126,226,179,35,112,29,21,241,94,44,29,75]},"announce":[],"urlList":[]}}