{"title":"The Evil Within-RELOADED","uid":11210197,"size":36332752801,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f876086b14543b0af3e4b8362257c8c5a6b6e21e&amp;dn=The+Evil+Within-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Tenguken","files":-1,"time":1413265444,"description":"3DM-RELOADED PRESENTS:\n\nThe Evil Within  (c) Bethesda Softworks\n\n10/2014 :..... RELEASE.DATE .. PROTECTION .......: Steam\nDISC(S) .. GAME.TYPE ........: Action\n\nDeveloped by Shinji Mikami -- creator of the seminal Resident Evil series\n-- and the talented team at Tango Gameworks, The Evil Within embodies the\nmeaning of pure survival horror. Highly-crafted environments, horrifying\nanxiety, and an intricate story are combined to create an immersive world\nthat will bring you to the height of tension. With limited resources at\nyour disposal, you'll fight for survival and experience profound fear in\nthis perfect blend of horror and action.\nSTORY:\nWhile investigating the scene of a gruesome mass murder, Detective\nSebastian Castellanos and his partners encounter a mysterious and powerful\nforce. After seeing the slaughter of fellow officers, Sebastian is\nambushed and knocked unconscious. When he awakens, he finds himself in a\nderanged world where hideous creatures wander among the dead.\nFacing unimaginable terror, and fighting for survival, Sebastian embarks\non a frightening journey to unravel what's behind this evil force.\nKEY FEATURES:\n\n* Pure Survival Horror Returns\nShinji Mikami, the father of survival horror, is back to direct a\nchilling new game wrapped in haunting narrative. Tension and anxiety\nheighten dramatically as you explore the game's tortured world.\n* Brutal Traps and Twisted Creatures\nFace unthinkable horrors and cruel traps as you struggle to survive\nagainst overwhelming odds. Turn evil against itself by using the same\ndiabolical devices against overwhelming deadly creatures.\n* Unknown Threats in an Uncertain World\nMysterious and wicked fears loom ahead in a world that warps and twists\naround you. Corridors, walls, doors, and entire buildings change in\nreal-time, ensnaring players in a reality where threats can appear at\nany time and from any direction.\n* The New Face of Horror\nExperience a disturbing reality as you try to break free from warped\nmachinations that could only exist in the most horrifying worlds.\nDefeat insurmountable terror and experience the ultimate thrill by\ndiscovering The Evil Within.\n\n1. Unrar.\n2. Burn or mount the image.\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory to\nyour game install directory.\n5. Play the game.\n6. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:f876086b14543b0af3e4b8362257c8c5a6b6e21e","amp;dn":"The+Evil+Within-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f876086b14543b0af3e4b8362257c8c5a6b6e21e","infoHashBuffer":{"type":"Buffer","data":[248,118,8,107,20,84,59,10,243,228,184,54,34,87,200,197,166,182,226,30]},"announce":[],"urlList":[]}}