{"title":"Debbie Davies - Discography FLAC","uid":11309641,"size":4505675554,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f90cee89f88ec546a1bf8fb3a8a9e3dbadc7d374&amp;dn=Debbie+Davies+-+Discography+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eika256","files":-1,"time":1414503175,"description":"Debbie Davies - Discography FLAC\n\nDebbie Davies has brought a new sensibility to the blues. The former guitarist for Albert Collins &amp; the Icebreakers, Fingers Taylor &amp; the Ladyfinger Revue, and Maggie Mayall &amp; the Cadillacs, an all-female band led by John Mayall's wife, Davies has continued to attract attention as the leader of her own group since 1993. &quot;I believe my reputation backs up my ability to recognize exceptional blues,&quot; explained John Mayall during a early-2000 interview. &quot;Such a one is Debbie Davies.&quot;\nDavies' 1993 solo album, Picture This, featured a cameo appearance by Collins, who died of cancer shortly afterwards. Her fifth solo outing, Tales from the Austin Hotel, recorded with members of Stevie Ray Vaughan's band, Double Trouble, received a W.C. Handy award nomination. Love the Game, released in 2001, featured members of her touring band and was produced by Duke Robillard.\nA native of Los Angeles, Davies inherited her musical skills from her father, who wrote arrangements for Ray Charles and worked in the recording studio with Frank Sinatra and Pearl Bailey. Performing in rock and blues bands in the San Francisco area in the early '80s, she returned to southern California in 1984.\nAfter honing her talents as lead guitarist for Maggie Mayall &amp; the Cadillacs, Davies was recruited to play with Albert Collins &amp; the Icebreakers in 1988. She remained with the group for three years.\nTouring with Fingers Taylor &amp; the Ladyfinger Revue during the summer of 1991, Davies opened numerous shows for Taylor's employer, Jimmy Buffett.\nDavies continues to play occasional sessions. Her 1997 album, I've Got That Feeling, featured duets with blues guitarists Tab Benoit and Montoya.\nTo date, Davies had recorded three albums for Blind Pig (Picture This, Loose Tonight and I Got That Feeling), four for Shanachie (Round Every Corner, Tales from the Austin Motel, Love the Game, and her John Mayall tribute, Key to Love), and in 2005 she released All I Found with Telarc Records, followed in 2007 by Blues Blast on the same label. (AllMusic)\n\nAlbum list:\n1993 - Picture This\n1994 - Loose Tonight\n1997 - I Got That Feeling\n1998 - Round Every Corner\n1999 - Tales From the Austin Motel\n2001 - Love The Game\n2003 - Key to Love\n2005 - All I Found\n2007 - Blues Blast\n2009 - Holdin' Court\n2012 - After The Fall\nOtis Grand, Debbie Davies and Anson Funderburgh - 1998 - Grand Union\nTab Benoit, Debbie Davies, Kenny Neal - 1999 - Homesick For The Road\n\nEnjoy and share!","torrent":{"xt":"urn:btih:f90cee89f88ec546a1bf8fb3a8a9e3dbadc7d374","amp;dn":"Debbie+Davies+-+Discography+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f90cee89f88ec546a1bf8fb3a8a9e3dbadc7d374","infoHashBuffer":{"type":"Buffer","data":[249,12,238,137,248,142,197,70,161,191,143,179,168,169,227,219,173,199,211,116]},"announce":[],"urlList":[]}}