{"title":"Frederik Pohl - The Boy Who Would Live Forever - A Novel of Gate","uid":11597597,"size":517832314,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fa39fc003733e843673c91cb261ee65215575d4a&amp;dn=Frederik+Pohl+-+The+Boy+Who+Would+Live+Forever+-+A+Novel+of+Gate&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Cybotage","files":26,"time":1417302148,"description":"Frederik Pohl - The Boy Who Would Live Forever - A Novel of Gateway (Heechee Saga #6)\n\nRead by Oliver Wyman\nFormat: MP3\nBitrate: 64 Kbps\nUnabridged\n\nA Triumphant New Gateway Adventure\n\nIn 1977 Frederik Pohl stunned the science-fiction world with the publication of Gateway, one of the most brilliantly entertaining SF novels of all time. Gateway was a best seller and won science fiction's triple crown: the Hugo, Nebula, and John W. Campbell Memorial awards for best novel. Now, more than 25 years later, Pohl has completed a new novel set in the Gateway universe.\n\nThe Boy Who Would Live Forever has a sense of wonder and excitement that will satisfy those who loved Gateway and will delight new listeners as well. In Gateway, long after the alien Heechee abandoned their space-station, Gateway (as humans dubbed it) allowed humans to explore new worlds. The Heechee, alarmed by the alien Kugel whose goal was to destroy all organic lifeforms, had already retreated to the galactic core, where they now lived in peace. Now, in The Boy Who Would Live Forever, humans with dreams of life among the stars are joining the Heechee at the core, to live there along with those humans and Heechee whose physical bodies have died but have had their minds stored in electronic memory so that their wisdom passes down through the ages .\n\nTheir peace is threatened by the Kugel, who may yet attack the core. But a much greater threat is the human Wan Enrique Santos-Smith, whose blind loathing of the Heechee fuels an insane desire to destroy them and, incidentally, every living being in the galaxy. Stan and Estrella, two young people from Earth, went to Gateway looking for adventure, and found each other. They settle among the Heechee on Forested Planet of Warm Old Star Twenty-Four, never suspecting that they may be the last best hope to save the galaxy. But with allies like Gelle-Klara Moynlin (one of the galaxy's richest women, who isn't content to just have money, but wants to use her wealth for good) and machine mind Marc Antony (a wonderful chef to thousands of living and stored clients), they are destined to contend with Wan's terrible plan. Frederik Pohl has woven together the lives of these and other memorable characters to create a masterful new novel","torrent":{"xt":"urn:btih:fa39fc003733e843673c91cb261ee65215575d4a","amp;dn":"Frederik+Pohl+-+The+Boy+Who+Would+Live+Forever+-+A+Novel+of+Gate","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa39fc003733e843673c91cb261ee65215575d4a","infoHashBuffer":{"type":"Buffer","data":[250,57,252,0,55,51,232,67,103,60,145,203,38,30,230,82,21,87,93,74]},"announce":[],"urlList":[]}}