{"title":"C. J. Cherryh - Destroyer","uid":11526630,"size":240823207,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fcd5b62f8a407df8f69ee14096f509696e83041c&amp;dn=C.+J.+Cherryh+-+Destroyer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Cybotage","files":1,"time":1416538410,"description":"It has been two years since the starship Phoenix left Alpha Station on a rescue mission where over four thousand human spacers were under attack by a hostile alien race. Now, exhausted from their journey, the crew of the Phoenix yearns for home. But when the ship makes the jump into atevi space, they learn the worst: that supplies to the station have been cut off; that civil war has broken out on the atevi mainland; that the powerful Western Association has been overthrown; and that Tabini-aiji, Bren Cameron's primary supporter and Ilisidi's grandson and ally, is missing and may be dead.\n\nWith no one left to lead the Western Association, Ilisidi and  Bren know that the survival of their allies lies in their hands. And with the atevi world at war, the only safe landing strip lies on the human colony at Mospheira. Although there are many dangers inherent in bringing a powerful atevi leader such as Ilisidi onto human lands, Bren realizes they have no other choice. But even if they safely survive their landing, will Bren and Ilisidi together prove strong enough to muster the remaining shards of the Western Association and regain control of their planet?\n\nThe long-running Foreigner series can also be enjoyed by more casual genre readers in sub-trilogy installments. Destroyer is the 7th Foreigner novel. It is also the 1st book in the third subtrilogy","torrent":{"xt":"urn:btih:fcd5b62f8a407df8f69ee14096f509696e83041c","amp;dn":"C.+J.+Cherryh+-+Destroyer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fcd5b62f8a407df8f69ee14096f509696e83041c","infoHashBuffer":{"type":"Buffer","data":[252,213,182,47,138,64,125,248,246,158,225,64,150,245,9,105,110,131,4,28]},"announce":[],"urlList":[]}}