{"title":"Complete Relaxation Hypnosis DVD by Glenn Harrold DVD-R PAL ISO","uid":12451985,"size":1524298302,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:fd0c1d4c9cf6a7ab04d92648dc84e97a5f24344f&amp;dn=Complete+Relaxation+Hypnosis+DVD+by+Glenn+Harrold+DVD-R+PAL+ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"elessedilgirl","files":4,"time":1442697591,"description":"This superb high quality hypnotherapy DVD by the UK's best selling audio hypnotherapist, Glenn Harrold, combines powerful visual and audio hypnotherapy techniques with state of the art digital recording technology.\n\nOn the DVD Glenn Harrold will guide you into a deeply relaxed state of mental and physical relaxation. In this very receptive relaxed state you are given a number of post hypnotic and direct suggestions to help you overcome stress and cope the pressures of modern day life.\n\nThe absorbing hypnotic visual imagery combined with the powerful hypnosis audio track create a dynamic state for integrating suggestions and feeling relaxed easily. There are also a number of background echoed affirmations, which pan from left to right across the stereo range. These deeply soothing and potent methods of delivering multiple suggestions simultaneously to the unconscious mind can facilitate positive changes very quickly.\n\nThe subliminal messages (printed on the back cover) that flash up on the screen every now and again are on screen for 1/25th of a second. You do not need to consciously read them as these phrases bypass your conscious awareness and are absorbed and accepted unconditionally by your unconscious mind.\n\nThis DVD will guide you into a hypnotic trance state and then bring you back to full waking consciousness at the end. It is important to watch and listen to the session in its entirety. You need to create a time and space where you can watch the full 40-minute hypnotherapy session from start to finish.\n\nThis unique hypnotherapy DVD gives you a compelling and effective way to take complete control of your stress levels and remain much more relaxed in your every day life.\n\nWarning:\n\nThis DVD contains flashing subliminal imagery and hypnotic graphics. They are safe, but must not be used in a moving vehicle or if you suffer from epilepsy, migraine or clinical depression.\n\nExtras Inside This DVD:\n\nA new Glenn Harrold hypnosis CD - Powerful Motivation (28 min - FLAC)","torrent":{"xt":"urn:btih:fd0c1d4c9cf6a7ab04d92648dc84e97a5f24344f","amp;dn":"Complete+Relaxation+Hypnosis+DVD+by+Glenn+Harrold+DVD-R+PAL+ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd0c1d4c9cf6a7ab04d92648dc84e97a5f24344f","infoHashBuffer":{"type":"Buffer","data":[253,12,29,76,156,246,167,171,4,217,38,72,220,132,233,122,95,36,52,79]},"announce":[],"urlList":[]}}