{"title":"Wayne Shorter - Night Dreamer (1964) HDtracks 24-192-FLAC","uid":11385308,"size":1747908310,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fd509a116cf9485a13089524b1cae6016c35dd40&amp;dn=Wayne+Shorter+-+Night+Dreamer+%281964%29+HDtracks+24-192-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"hal4000","files":-1,"time":1415253548,"description":"Wayne Shorter (born August 25, 1933) is an American jazz saxophonist and composer.\nJazz critic Ben Ratliff of the New York Times has described Shorter as &quot;probably jazz's greatest living small-group composer and a contender for greatest living improviser.&quot; Many of Shorter's compositions have become jazz standards. His output has earned worldwide recognition, critical praise and various commendations, including 10 Grammy Awards. He has also received acclaim for his mastery of the soprano saxophone (after switching his focus from the tenor in the late 1960s), beginning an extended reign in 1970 as Down Beat's annual poll-winner on that instrument, winning the critics' poll for 10 consecutive years and the readers' for 18.\nShorter first came to wide prominence in the late 1950s as a member of, and eventually primary composer for, Art Blakey's Jazz Messengers. In the 1960s, he went on to join Miles Davis's Second Great Quintet, and from there he co-founded the jazz fusion band Weather Report. He has recorded over 20 albums as a bandleader.\n\nTenor saxophonist Wayne Shorter's Blue Note debut found him well prepared to enter the big time. With an impressive quintet that includes trumpeter Lee Morgan, pianist McCoy Tyner, bassist Reggie Workman, and drummer Elvin Jones, Shorter performed a well-rounded program consisting of five of his originals, plus an adaptation of &quot;Oriental Folk Song.&quot; Whether it be the brooding title cut, the Coltrane-ish ballad &quot;Virgo,&quot; or the jams on &quot;Black Nile&quot; and &quot;Charcoal Blues,&quot; this is a memorable set of high-quality and still fresh music.\n\nHDtracks PCM-24Bit-192Khz-FLAC","torrent":{"xt":"urn:btih:fd509a116cf9485a13089524b1cae6016c35dd40","amp;dn":"Wayne+Shorter+-+Night+Dreamer+%281964%29+HDtracks+24-192-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd509a116cf9485a13089524b1cae6016c35dd40","infoHashBuffer":{"type":"Buffer","data":[253,80,154,17,108,249,72,90,19,8,149,36,177,202,230,1,108,53,221,64]},"announce":[],"urlList":[]}}