{"title":"Ten Must Have Essential R &amp; B Albums [-emidius-]","uid":11653238,"size":1585043732,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ff0e458e85b00050a7b450d9095c05b789f22675&amp;dn=Ten+Must+Have+Essential+R+%26amp%3B+B+Albums+%5B-emidius-%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"emidius","files":200,"time":1417898442,"description":"The included are considered by many to be some of the top essential R &amp; B albums of all time. Regardless of any album rankings...these are truly MUST OWN albums for anyone interested in R &amp; B. I hope you enjoy this collection and I will be releasing further collections in the near future.\n\n10. Whitney Houston - Whitney Houston (1985)\nDefinitely Whitney's best album. This release made her an overnight superstar. It would be years before she came down off of the high this album resulted.\n\nYou Give Good Love, Saving All My Love for you, How Will I Know, Greatest Love of All\n\n\n\n9. Janet Jackson - Control (1986)\nJanet was all grown up and wanted the world to know she was not just Michael Jackson's baby sister. This, her second album, took her to superstardom.\n\nControl, What Have You Done For Me Lately, Nasty, The Pleasure Principle, Let's Wait Awhile\n\n\n\n\n8. James Brown - Live at the Apollo (1963)\nThis was a landmark album recorded at Harlem's Apollo theatre in 1963 at Brown's expense. It spent 66 weeks on the Billboard Pop Charts, peaking at #2. Radio Stations would play one side of the album at a time on the air. The record sold out in stores across the country.\n\nTry Me, Think, I Don't Mind, Night train\n\n\n\n\n7. Mary J. Blige - My Life (1994)\nAlthough Mary's 1st album, &quot;What's the 411,&quot; was a smash, this album is considered by most, her best from beginning to end.\n\nI'm Going Down, My Life, Be Happy, You Bring Me Joy\n\n\n\n6. R. Kelly - 12 Play (1993)\nR. Kelly almost made Bump and Grind Music it's on genre with this album. This is bonified baby making music.\n\nBump and Grind, Seems Like You're Ready, Your Body's\nCalling, 12 Play, Sadie\n\n\n\n5. Aretha Franklin - I Never Loved A Man (1967)\nBreakthrough album by Aretha Franklin that established her a superstar. She remade Otis Redding's &quot;Respect&quot; and made it a number 1 song, followed by a host of other hits.\n\nRespect, I Never Loved a Man (The Way that I Love You),\nDr. Feel Good, Do Right Woman Do Right Man\n\n\n\n4. Prince - Purple Rain (1984)\nPrince could do no wrong in 1984 after releasing a number one movie and soundtrack. This was definitely his peak although he stayed around years after.\n\nWhen Doves Cry, Let's Go Crazy, Purple Rain, Take Me With You, I Would Die 4 U\n\n\n\n3. Stevie Wonder - Songs in the Key of Life (1976)\nAfter Marvin Gaye found success with &quot;What's Going On,&quot; label head, Berry Gordy Jr allowed Stevie to write and produce his own record as well. This double album was the outcome.\n\nSir Duke, Isn't She Lovely, I Wish, Knocks Me Off My Feet, As\n\n\n\n2. Marvin Gaye - What's Going On (1971)\nMarvin declared not to record if Berry Gordy Jr wouldn't let him write and produce for himself. Berry cringed when hearing the idea of a protest album but agreed thinking if Marvin fails he will have learned something and he can get back to doing pop records written by others like, &quot;I Heard it Through the Grapevine&quot; and &quot;How Sweet It Is.&quot; Marvin did his thing and did it well. He would write and produce all of his records after this album stayed on the charts for months and broke all types of records outselling any Motown record to that date.\n\nWhat's Going On, Mercy, Mercy, Me, Makes Me Wanna Hollar, God is Love\n\n\n\n1. Michael Jackson - Thriller (1983)\nWhen Michael called Quincy to record their second collaboration, he had all intentions on making the best record in history. He came, He saw, He conquered. Thriller is the top grossing album of all time and introduced the world to his fancy footwork and made music videos a must for good music.\n\nThriller, Billie Jean, Beat It, The Girl is Mine, Want to Be Starting Something, PYT","torrent":{"xt":"urn:btih:ff0e458e85b00050a7b450d9095c05b789f22675","amp;dn":"Ten+Must+Have+Essential+R+%26amp%3B+B+Albums+%5B-emidius-%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff0e458e85b00050a7b450d9095c05b789f22675","infoHashBuffer":{"type":"Buffer","data":[255,14,69,142,133,176,0,80,167,180,80,217,9,92,5,183,137,242,38,117]},"announce":[],"urlList":[]}}